{
  "url": "https://healthify.nz/health-a-z/a/arthritis-children/",
  "title": "Arthritis Children",
  "content": "####  How is JIA diagnosed? \nThere is no single test for JIA and reaching a diagnosis may take time, which can be very frustrating for families. Your child will be referred to a paediatrician who will work with a paediatric rheumatologist (who specialises in children with arthritis). \nDiagnosis will be based on medical history, physical examination, blood tests, X-rays and other tests. Some of these are to rule out other diseases that cause pain and swelling in the joints, and they may need to be repeated.\n####  How is JIA managed? (+ APPS) \nEvery child’s JIA is different and treatment may seem like ‘trial and error’ to find what works best. Your child is still growing, so their condition needs to be monitored closely and changes to treatment will be made from time to time.The overall aim is for your child and whānau to lead as normal a life as possible. \nTreatment will depend on:\n  * what form of JIA your child has\n  * which joints are affected,\n  * how active the condition is\n  * how your child responds to the medicines prescribed.\n\n\nThe good news is that if JIA is diagnosed early and managed well, most children will outgrow it. About half of children with JIA may not need treatment as adults.\n#### Medicines\n  * Pain relievers (analgesics) can help your child feel more comfortable, be more active and sleep better but they don't reduce inflammation.\n  * [Non-steroidal anti-inflammatory drugs](https://healthify.nz/medicines-a-z/n/non-steroidal-anti-inflammatories-nsaids) (NSAIDS) reduce inflammation and control stiffness and swelling, but they don't cure JIA. The most common side effects are stomach upsets.\n  * Disease-modifying anti-rheumatic drugs (DMARDS), eg, [methotrexate](https://healthify.nz/medicines-a-z/m/methotrexate), can slow the progression of JIA by ‘calming’ the overactive immune system. They take several months to reach maximum effectiveness. Some children are more likely to catch infections and they should not be give live virus vaccinations (eg, measles, mumps, rubella, oral polio, chicken pox) while on DMARDS.\n  * Corticosteroids are hormones that are produced naturally by the adrenal glands. As medicine, they can rapidly reduce pain and inflammation. ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.192046+00:00",
    "source": "healthify"
  }
}
