{
  "url": "https://healthify.nz/health-a-z/a/amoebiasis/",
  "title": "Amoebiasis",
  "content": "* You may be asked for several samples from different days. This is because  _E. histolytica_ isn't always found in every sample.\n  * Diagnosing amoebiasis can be very difficult because other parasites and cells can look very similar to  _E. histolytica_ under a microscope.\n\n\nFor the diagnosis of amoebic liver abscess, the parasite may be seen when pus from the liver abscess is examined under a microscope. To collect the pus, a needle is passed through your skin into the abscess. An ultrasound scan is usually used to guide the person performing the procedure.\n####  How is amoebiasis treated? \nIf the results of your poo tests show that you have the parasite, your doctor will prescribe medicines to kill the parasite. This is important even for people who don't have symptoms, to reduce the risk of spread. Examples of medicines include [metronidazole](https://healthify.nz/medicines-a-z/m/metronidazole), [ornidazole](https://healthify.nz/health-a-z/a/amoebiasis) and paromomycin.\nPeople with amoebiasis must not attend school, child care services or work until the diarrhoea has stopped.\n  * You'll need to take time off work until the symptoms stop.\n  * If you're a food handler or healthcare worker, you will need to talk to your healthcare provider about when you can return to work. You may need another poo test to ensure the infection has cleared first. \n\n\n####  How can amoebiasis be prevented? \n**There is no vaccine to prevent amoebiasis.**\n#### To avoid getting amoebiasis:\n  * Wash your hands thoroughly with soap and hot running water for at least 15 seconds after using the toilet or changing a nappy and before preparing food.\n  * Wash raw fruit and vegetables before eating.\n  * Only drink water that's treated and known to be safe – if you're not sure if the water is safe, boil it first.\n\n\n####    \nIf you're travelling overseas (especially to less developed countries)\n  * Be careful around the food and water you consume. Avoid uncooked foods. Avoid fruit and vegetables unless you're able to peel them yourself and then wash your hands.\n  ",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.681479+00:00",
    "source": "healthify"
  }
}