{
  "url": "https://healthify.nz/health-a-z/a/allergies-food/",
  "title": "Allergies Food",
  "content": "However, peanut, tree nut, seed and seafood allergies tend to be lifelong allergies.\n####  What are the common allergy-causing foods? \nAlthough almost any food can cause an allergic reaction, the main foods causing food allergy in Aotearoa New Zealand are:\n  * dairy (cow's milk)\n  * eggs\n  * fish\n  * peanuts\n  * sesame\n  * shellfish (crustacea and molluscs)\n  * soy\n  * tree nuts (almonds, Brazil nuts, cashews, hazelnuts, macadamias, pecans, pine nuts, pistachios, walnuts)\n  * wheat\n  * kiwifruit.\n\n\nYou should always see a paediatric or allergy dietitian before removing any food groups (eg, dairy or wheat) from your, or your child's, diet unless there has been an immediate reaction to the food. Any avoidance of foods needs to happen with medical and dietitian supervision to make sure there's adequate nutrition for growth and development.  \n  \n\n![Foods most likely to cause allergies](https://healthify.nz/assets/Infographics/Foods-most-likely-to-cause-allergies-HN-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Healthify He Puna Waiora_\n####  What are the symptoms of food allergy? \nSymptoms, their severity and the time they take to develop may be different for each person, and from one episode to another.\nSymptoms usually occur within 5 to 30 minutes of exposure to an allergen. However, some reactions can occur up to 2 hours later.\nMost reactions will be mild to moderate but, in some cases, a food allergy can lead to life-threatening symptoms, known as anaphylaxis, [](https://healthify.nz/health-a-z/a/anaphylaxis)which is a medical emergency. Some people experience anaphylaxis without first developing mild or moderate symptoms. Read more about [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis).\n####    \nMild to moderate symptoms include:\n  * [hives/urticaria](https://healthify.nz/health-a-z/h/hives \"Hives\") (swollen, itchy, pink/red bumps) or welts on your skin\n  * swelling of your lips, face or eyes\n  * abdominal or tummy pain\n  * vomiting (being sick).\n\n\n####    \nSigns of a severe allergic reaction (anaphylaxis) include:\n  * swelling of your tongue\n  * swelling or tightness in your throat\n  * difficulty breathing or noisy breathing (wheezing)\n  * difficulty talking or a hoarse voice\n  * dizziness, loss of consciousness or collapse\n  * being pale and floppy (in young children).  \n  \n\n\n**Anaphylaxis is a medical emergency, requiring urgent medical attention and treatment. If you or someone you care for experiences the above symptoms of anaphylaxis, give adrenaline if available and call 111 for an ambulance.**  \n---  \n####    \nOther reactions to food\nOther reactions to foods can occur and are often mistaken for food allergy. These include [food intolerances](https://healthify.nz/health-a-z/f/food-allergy-or-intolerance), toxic reactions, food poisoning, enzyme deficiencies, food aversion or irritation from skin contact with certain foods.\n####  How is food allergy diagnosed? \nIf an infant or young child has had a severe reaction, they should be treated in an emergency department. ",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.501194+00:00",
    "source": "healthify"
  }
}