{
  "url": "https://healthify.nz/health-a-z/a/asthma-pregnancy/",
  "title": "Asthma Pregnancy",
  "content": "* Preterm birth (early birth before 37th week of pregnancy).\n  * Death of the baby immediately before or after birth.\n\n\n####  Warning signs to look out for \nSigns that your asthma may be getting worse include:\n  * a cough that is worse at night, early morning, or when you exercise\n  * wheezing\n  * breathlessness \n  * tightness in your chest\n  * using more of your reliever inhaler than usual (if you’re needing to use your reliever inhaler 3 or more times per week you may be at risk of an asthma attack).  \n\n\n\nIf you have these symptoms, talk to your healthcare provider or asthma specialist, who will advise you on the best treatment. \n####    \nSigns of a severe asthma attack include:\n  * severe difficulty with breathing, walking or talking\n  * your lips or skin turning blue\n  * exhaustion and tiredness due to the effort of breathing\n  * wheezing stopping suddenly.  \n\n\n\n**If you experience any of these signs of a severe asthma attack, dial 111 and ask for an ambulance.**\n####  Is it safe to take asthma medication during pregnancy? \nAny medicine you take during pregnancy can affect your baby, but inhaled asthma medicines won’t harm your baby. Your baby will do best if you are breathing well, so it’s important that your asthma is well-controlled.\nMedical experts advise that it’s far safer to manage your asthma with medicine than it is to leave asthma untreated or poorly controlled during pregnancy. So, it’s important to keep taking your medicine as normal unless your healthcare provider tells you to stop.\nAsthma treatment during pregnancy is the same for non-pregnant people. Read more about [medicines used to manage asthma](https://healthify.nz/medicines-a-z/a/asthma-medication).  \n  \n\n![Pregnant woman using inhaler](https://healthify.nz/assets/Healthy-Living/Pregnancy-babies/Pregnant-woman-using-inhaler-Depositphotos-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Depositphotos_\n####    \nPreventer inhalers\n  * Preventer inhalers help to control your asthma. \n  * Preventer inhalers contain a corticosteroid which doesn’t relieve your symptoms immediately but builds up over time (weeks to months) to reduce swelling in the airways and stop your asthma symptoms developing.\n  * Use your prescribed regular preventer inhaler throughout pregnancy, even when you are well, to reduce the chance of severe asthma attacks.\n  * Examples of preventer inhalers are: \n    * [Flixotide® ](https://healthify.nz/medicines-a-z/f/fluticasone-inhaler-and-accuhaler)\n    * [Beclazone](https://healthify.nz/medicines-a-z/b/beclometasone-inhaler)\n    * [Pulmicort®](https://healthify.nz/medicines-a-z/b/budesonide-inhaler)\n    * [Qvar®](https://healthify.nz/medicines-a-z/b/beclometasone-inhaler)   \n\n\n\n#### Reliever inhalers\n  * Reliever inhalers work quickly to reduce your symptoms straight away. \n  * They work by relaxing the muscles around your airways, allowing them to widen and making it easier for you to breathe. \n  * You should use your reliever inhaler whenever you get asthma symptoms or if you’re having an asthma attack.\n  * Everyone with asthma should have a reliever inhaler and you should always carry your reliever inhaler with you. \n  * Examples of reliever inhalers are: \n    * Salamol®\n    * [Salbutamol](https://healthify.nz/medicines-a-z/s/salbutamol) (SalAir®, Ventolin®)\n    * [Bricanyl®. ](https://healthify.nz/medicines-a-z/t/terbutaline)\n\n\n#### Combination inhalers \n  * Combination inhalers contain both preventer and long-acting reliever medications – they relieve asthma symptoms and also help to prevent the underlying inflammation. \n  * Some combination inhalers need to be used with a reliever, others can be used as both a preventer and/or reliever by themselves. \n  * As for the other inhalers, continue to use your combination inhaler as advised by your healthcare provider during pregnancy.\n  * Examples of combination inhalers are: \n    * [Symbicort® ](https://healthify.nz/medicines-a-z/s/symbicort-for-asthma)\n    * [Seretide® ](https://healthify.nz/medicines-a-z/f/fluticasone-plus-salmeterol)\n    * [Breo Ellipta® ](https://healthify.nz/medicines-a-z/f/fluticasone-plus-vilanterol)\n    * [Vannair® ](https://healthify.nz/medicines-a-z/v/vannair-for-asthma)  \n\n\n\nThe use of reliever inhalers without a preventer inhaler is no longer recommended. Read more about [using combination inhalers to manage asthma](https://healthify.nz/medicines-a-z/a/asthma-reliever-medicine). Your healthcare provider will suggest the most appropriate inhalers for you.\n####    \nSteroid tablets \n  * Steroid tablets contain more anti-inflammatory corticosteroid than a preventer inhaler.\n  * They are prescribed by your doctor or nurse prescriber for a short time if your asthma gets worse. \n  * Steroid tablets work to reduce the inflammation(swelling) in your airways and are safe to take as a short course during pregnancy.\n  * An example of a steroid tablet is [prednisone](https://healthify.nz/medicines-a-z/p/prednisone). Read more about [steroid tablets.](https://healthify.nz/medicines-a-z/s/steroid-tablets)\n\n\n####  What about labour, delivery and breastfeeding? \nMake sure that asthma is included in your birth plan so that everyone supporting you knows you have asthma and what to do if you have symptoms.\nIf you’re taking asthma medicine, continue doing so during labour and delivery. Most women don’t get severe asthma symptoms during labour and delivery. During labour and delivery you have the same choice of pain medication as any woman. \nYou may be advised to have continuous monitoring of your baby during labour and delivery.\nIt’s safe to continue your asthma medicines while you’re breastfeeding. Inhaled asthma medicines are not found in breast milk. Breastfeeding has lots of benefits for you and your baby and it may reduce the chances of your child developing asthma.\n####  What self-care can I do if I have asthma and I'm pregnant? (+ APPS) \nThere are many things you can do to help reduce the severity of your asthma symptoms and how often you get them.\n####   \nHave an asthma management action plan\nEveryone with asthma should have an [asthma management action plan(external link)](https://www.asthmafoundation.org.nz/resources/topic/asthma-action-plans \"Open external link\"). ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:36.173056+00:00",
    "source": "healthify"
  }
}
