{
  "url": "https://healthify.nz/health-a-z/a/amblyopia/",
  "title": "Amblyopia",
  "content": "# Squints\n## Also known as Strabismus\n### Key points about squints\n  * A squint is also called strabismus.\n  * A squint is when the eyes are not looking in the same direction. \n  * If squints are untreated it can lead to eye problems like amblyopia. \n  * It is important to start treatment at an early age.\n  * Treatment may include glasses, patching, exercises, or surgery and is usually a combination of these.\n  * The content on this page comes from [KidsHealth(external link)](https://www.kidshealth.org.nz/squint \"Open external link\").\n\n\n![Small child with glasses and eye patch on his left lens](https://healthify.nz/assets/Health-A-Z/Eye-topics/Small-child-with-glasses-and-eye-patch-canva-950x690.jpg)\nQR Code Print\n####  What is a squint? \nA squint (or strabismus) is when the eyes are not looking in the same direction. A squint may be noticeable all the time, or it may come and go.   \n  \nThe eyes of newborn babies may sometimes appear to wander or be turned. But, by around 4 months of age, your baby's eyes should be straight and move together in all directions. Some babies look like they have a squint due to the wide bridge of their nose. As they grow, their features develop and this appearance goes away. But, a child with a true squint will not grow out of it.\n#### Different types of squints\nWhen one eye is straight the other may look in or out as in the picture below.  \n  \nOne eye turning inwards (called esotropia)  \n  \n\n![Young child with squint in eyes](https://healthify.nz/assets/Legacy/17226/young-child-with-squint-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\nImage credit: Canva\nOne eye may also look up (hypertropia) or down (hypotropia).\n####  What causes a squint? \nChildren can be born with a squint or develop it in childhood. Often, it's caused by a problem with the muscles that move the eyes, and can run in families.   \n  \nSometimes, a child may develop a squint because an eye is abnormal and there is a problem with sight.\n####  What can I do if I think my child has a squint? \nSee your family doctor if you think your baby or child has a squint.\n####  What is the treatment for a squint? \nChildren do not outgrow a squint. It's important to start treatment at an early age. Treatment might include glasses, patching, exercises, or surgery and is usually a combination of these.  \n  \nYour child will need to see an ophthalmologist (eye specialist) or an orthoptist (specialist in the assessment, diagnosis and treatment of certain eye problems).  \n  \nThe aims of treatment are:\n  * good vision in both eyes\n  * eyes that look as straight as possible\n  * both eyes working together equally.\n\n\n####  The main complication of a squint is amblyopia \nSometime, people call amblyopia a ‘lazy eye’. Amblyopia refers to reduced vision in an eye caused by abnormal development early in life, usually between birth and 7 years of age\nIt is the most common cause of poor vision in children.\nAmblyopia occurs when one eye (rarely both) is weaker and drifts inwards or upwards. About 1 in 25 children develop some degree of amblyopia.\n![Young girl with amblyopia in eyes](https://healthify.nz/assets/Legacy/18305/young-girl-with-amblyopia-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\nImage credit: Canva\nWith early detection and treatment, long-term vision problems can be prevented.\n####  What is amblyopia? \nWhen eyes don't line up together, the straight or straighter eye does most of the work. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:26.858116+00:00",
    "source": "healthify"
  }
}
