{
  "url": "https://healthify.nz/health-a-z/a/adhd-adults/",
  "title": "Adhd Adults",
  "content": "ADHD affects about 1 in 20 adults – that’s about 280,000 New Zealanders.\nBrain scans and studies of brain function show ADHD brains are wired differently from other people's.\nThe main features of ADHD are:\n  * difficulty paying attention (eg, to workplace tasks, conversations, or personal belongings)\n  * hyperactivity (eg, fidgeting or being unable to sit still, talking or thinking a lot)\n  * impulsivity (eg, interrupting conversations, difficulty waiting in line).\n\n\nADHD is usually diagnosed in childhood. Until recently it was thought that children grow out of ADHD, but it's now known that about 7 out of 10 children with ADHD will still have symptoms as adults. You may have ADHD throughout your childhood but not be diagnosed until you’re an adult. \nADHD often comes with energy and creativity and, if used well, this can help you learn how to manage the more challenging aspects of ADHD as an adult.\n####    \nVideo: ADHD in adults  \n  \n\n(Healthify He Puna Waiora, NZ, 2024)\n####  What causes ADHD? (+ VIDEO) \nThe exact cause of ADHD isn’t known. It's found in about 5 to 7% of people from all ethnicities. It’s more commonly diagnosed in boys and men. This may be because it’s not as obvious to other people in girls and so it's diagnosed later. \nIt’s likely to be a genetic condition, which runs in families. If one parent has ADHD there’s a 70 to 80% chance of a child having it. Research shows that ADHD probably results from the combination of several genes interacting with environmental risk factors.\nThese risk factors are thought to include:\n  * brain injury\n  * exposure to alcohol or nicotine before birth\n  * premature birth\n  * epilepsy\n  * exposure to toxins such as lead in childhood.\n\n\nPeople with ADHD have differences in the size, connections and neurotransmitters (chemical messengers between brain cells) in parts of their brains compared to people without ADHD.\nHaving ADHD is also related to other neurodevelopmental conditions, such as [autism spectrum disorder](https://healthify.nz/health-a-z/a/autism), and [learning disabilities](https://healthify.nz/health-a-z/l/learning-difficulties) such as dyslexia. \nThe video below talks about the parts of the brain and the neurotransmitters that are involved in ADHD.\n####    \nVideo: Sarah on \"what's ADHD?\"  \n  \n\n(ADHD New Zealand, 2022)\n  \nADHD is not caused by poor parenting, absent fathers, too much sugar, food additives, TV, video games or vaccines. These possibilities have been studied and found not to be causes.\n####  What are the good things about ADHD? \n#### ADHD can bring benefits, including:\n  * high energy\n  * being creative and a good problem solver\n  * a good sense of humour\n  * being entrepreneurial and enterprising\n  * tenacity (being determined)\n  * being able to hyper-focus on favourite topics, activities, games or sports\n  * the ability to respond quickly in a crisis\n  * a strong sense of social justice, a drive to support the under-dog\n  * being sensitive, insightful and empathetic\n  * being a person who takes a chance and embraces opportunities.  \n  \n\n\n\n![Woman's hands and watercolour painting](https://healthify.nz/assets/Health-A-Z/Mental-health/Womans-hands-and-watercolour-painting-canva-950x690__ResizedImageWzYwMCw0MzZd.png)   \n_Image credit: Canva_\n####  What are the symptoms of ADHD? \nThere are key symptoms used in the diagnosis of ADHD.\n####  **  \n**Inattention (problems with paying attention)\nExamples of inattention symptoms are:\n  * inability to focus on a task for a long time\n  * poor attention to detail\n  * being disorganised (for example being unable to use diaries or calendars regularly)\n  * forgetting things\n  * being easily distracted\n  * delaying attending to tasks\n  * unreliable work habits\n  * forgetting appointments\n  * having more accidents\n  * daydreaming or switching off in classes or meetings\n  * poor time management.\n\n\n",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.549680+00:00",
    "source": "healthify"
  }
}
