{
  "url": "https://healthify.nz/health-a-z/a/adhd-children/",
  "title": "Adhd Children",
  "content": "This might include some questionnaires for you and your child's teacher to complete.\nThere is no single test to diagnose ADHD. Making a diagnosis may take more than one appointment.\n#### Making a diagnosis of ADHD\nFor a diagnosis of ADHD, the symptoms need to be obvious in more than one setting of a child's life (such as home and school or daycare).\nThe symptoms also need to be having an impact on day to day functioning. It's important to make sure the symptoms are not due to another problem like hearing difficulties, sleep problems, learning difficulties.\n####  Can children with ADHD sometimes have other problems? \nYes, children with ADHD are more likely to have:\n  * learning difficulties\n  * anxiety\n  * depression\n  * disruptive behaviour.\n\n\nIf you're worried about other problems, talk to your healthcare provider.\n####  What should I do if I think my child might have ADHD? \nIf you are concerned about your child, talk to your family doctor and teacher. Sometimes teachers may be the first to raise concerns and suggest that you and your child see your family doctor.\nYour family doctor may arrange a referral to a paediatrician, child psychiatrist or psychologist to make an assessment.\n####  How is ADHD–Aroreretini managed? (+ APPS) \nThere is no cure for ADHD, but in most cases, symptoms can be managed.\nIn preschool tamariki diagnosed with ADHD behaviour and parenting strategies usually help.\nIn school-aged children, behavioural strategies work best in combination with medicine. Your child may also be able to get extra support at school. Talk to your child's teacher.\n####    \nBehaviour strategies can help\n  * Positive parenting programmes – having a child with ADHD can be more challenging as a parent. It helps to learn a range of strategies so that if the first thing you try doesn't work, you have other options in your parenting toolbox.\n  * Counselling – sometimes your healthcare provider may suggest counselling for your child or your whānau.\n\n\nRead more about strategies to help your child at home and school from the [Royal Children's Hospital, Melbourne, Australia(external link)](https://www.rch.org.au/kidsinfo/fact_sheets/ADHD_ways_to_help_children_at_school_and_home/ \"Open external link\"). \n####    \nMedicines\n**Stimulants are an effective treatment**\nIn school-aged children, medicines called ‘stimulants’ are the most effective treatment for ADHD. For some children, a combination of behaviour therapy and medicine works even better.\nParents and teachers often notice that children with ADHD have a significant improvement in their symptoms when they start taking medicine.\n**How stimulants can help**\nStimulant medicine can help your child with ADHD to:\n  * concentrate better\n  * be less impulsive\n  * feel calmer\n  * learn and practice new skills.\n\n\n**Stimulants are safe**\nWhile some parents may understandably feel cautious about starting their child on this medicine, it is important to know that stimulant medicines do not affect your child's personality or brain, and are not addictive. These medicines have been used safely for many years in children with ADHD.\n**Methylphenidate**\nThe most common stimulant medicine in Aotearoa New Zealand is[methylphenidate.](https://healthify.nz/medicines-a-z/m/methylphenidate \"Methylphenidate\")\nIt may take some time for your doctor and you to find the dose and timing that works best for your child.\n**Common side effects of methylphenidate**\nSome side effects can be reduced by starting on a low dose. If your child develops any side effects, talk to your doctor.\nCommon side effects of methylphenidate may include:\n  * mild tummy discomfort\n  * mild headache\n  * loss of appetite\n  * difficulty getting to sleep.\n\n\nSome children can become sad or withdrawn on methylphenidate. It's important to talk to your doctor if this happens to your child. They may need to try another medicine.\n**Other medicines**\nThere are other stimulants such as dexamfetamine and lisdexamfetamine. Your healthcare provider may suggest this if your child cannot take methylphenidate or if methylphenidate has not improved your child's symptoms.\n**Funding of dexamfetamine and lisdexamfetamine**\nIn Aotearoa New Zealand dexamfetamine and lisdexamfetamine are funded under a Special Authority, for people who meet the criteria. A special authority means your specialist will need to make an application to Pharmac (the government medicine funding agency) for approval before the medicine can be funded for you.\n  * From December 2024 Pharmac has removed the special authority renewal requirements for dexamfetamine. This means that once special authority approval has been granted, it won't need to be renewed. Your doctor or nurse practitioner can continue to prescribe it.\n  * Previously, people needed input from a specialist every 2 years to renew their special authority. \n  * Read more about the [removal of the renewal criteria for stimulant treatments(external link)](https://pharmac.govt.nz/news-and-resources/consultations-and-decisions/decision-to-remove-renewal-criteria-for-adhd-treatments \"Open external link\").\n\n\nRead more about [methylphenidate](https://healthify.nz/medicines-a-z/m/methylphenidate), [dexamphetamine](https://healthify.nz/medicines-a-z/d/dexamfetamine) and [lisdexamfetamine](https://healthify.nz/medicines-a-z/l/lisdexamfetamine).\nIf stimulant medicines don't work for your child, there are other medicines you can use. Your healthcare provider can tell you more about these.\n####  VIDEOS: (animated) to help children understand ADHD \nYou can watch a series of animated videos ‘Me and My ADHD’. They aim to help tamariki understand ADHD.\nThere is a [parents' guide to the child video series(external link)](https://caddac.ca/wp-content/uploads/Parent-Resource-Guide-ENGLISH.pdf \"Open external link\").\n####    \nVideo: That's Me, I Have ADHD!\n(Centre For ADHD Awareness, Canada, 2019)\n####    \nVideo: When my ADHD gets me into trouble  \n  \n\n(Centre For ADHD Awareness, Canada, 2019)\n####    \nVideo: My ADHD at school  \n  \n\n(Centre For ADHD Awareness, Canada, 2019)\n####  Related topics on Healthify \n[ADHD in adults | Mate mauri rere](https://healthify.nz/health-a-z/a/adhd-adults \"ADHD in adults | Mate mauri rere\")  \n[What is mental health?](https://healthify.nz/hauora-wellbeing/m/maori-mental-health-videos \"What is mental health?\")  \n[Anxiety | Mate māharahara](https://healthify.nz/health-a-z/a/anxiety \"Anxiety | Mate māharahara\")\n####  More information \n[ADHD New Zealand(external link)](https://www.adhd.org.nz/ \"Open external link\") Information and support in Aotearoa New Zealand for children and adults with ADHD  \n[ADHD in children(external link)](https://mentalhealth.org.nz/conditions/condition/adhd-in-children \"Open external link\") Mental Health Foundation of New Zealand   \n[ADHD – ways to help children with ADHD(external link)](https://www.rch.org.au/kidsinfo/fact_sheets/ADHD_ways_to_help_children_with_ADHD/ \"Open external link\") Royal Children's Hospital, Melbourne, Australia Helpful, practical ways to help children with ADHD such as how to use verbal instructions, how to help with written work, reducing overactivity and fatigue, keeping structure and communication between home and school  \n[CHADD(external link)](https://chadd.org/for-parents/overview/ \"Open external link\") The National Resource on ADHD, US  \n[Attention deficit hyperactivity disorder (ADHD)(external link)](https://www.nhs.uk/conditions/adhd-children-teenagers/ \"Open external link\") NHS Choices, UK  \n[Attention deficit hyperactivity disorder(external link)](https://www.nimh.nih.gov/health/topics/attention-deficit-hyperactivity-disorder-adhd \"Open external link\") National Institute of Mental Health, US  \n  \n\n#### Brochures\n[Methylphenidate for ADHD(external link)](http://www.nzfchildren.org.nz/nzf/resource/MFC/MfC_Methylphenidate-for-ADHD.pdf \"Open external link\")[(external link)](http://www.nzfchildren.org.nz/nzf/resource/MFC/MfC_Methylphenidate-for-ADHD.pdf \"Open external link\") NZ Medicines Formulary\n[ADHD in Burmese [PDF, 76 KB]](https://healthify.nz/assets/adhd-in-burmese.pdf \"ADHD in Burmese\") Waitematā DHB and Auckland DHB, NZ\n[Attention Deficit/Hyperactivity Disorder (ADHD) – a resource for educators(external link)](https://inclusive.tki.org.nz/assets/inclusive-education/MOE-publications/MOESE0040-ADHD-booklet.pdf \"Open external link\") Ministry of Education, NZ, 2015\n####  Information for healthcare providers (+ VIDEO) \n#### Clinical pathways\n[ADHD across the lifespan(external link)](https://www.ranzcp.org/clinical-guidelines-publications/clinical-guidelines-publications-library/adhd-across-the-lifespan \"Open external link\") The Royal Australian and New Zealand College of Psychiatrists, 2023  \n[Attention deficit hyperactivity disorder – diagnosis and management(external link)](https://www.nice.org.uk/guidance/NG87 \"Open external link\")  \n[ADHD – clinical practice guideline for the diagnosis, evaluation, and treatment of attention-deficit/hyperactivity disorder in children(external link)](http://pediatrics.aappublications.org/content/early/2011/10/14/peds.2011-2654 \"Open external link\")  \n[Recognition and assessment of common mental disorders in young people(external link)](https://bpac.org.nz/BPJ/2010/January/assessment.aspx \"Open external link\")\n####    \nContinuing medical education\n**Podcasts**\n[ADHD management(external link)](https://www.goodfellowunit.org/podcast/adhd-management \"Open external link\")  \nIn this second podcast on ADD and ADHD, Dr Colette Muir talks about management in children.\n####    \nVideos and seminars\n[Emotional and behavioral disorders, importance of the early years from PHARMAC Seminars(external link)](https://www.youtube.com/watch?v=HEv-jcOlO58&list=PLyuOPjKiQp7wQPM6pIptOCyPuMywQllGj \"Open external link\")\n**1. PHARMAC seminar: Emotional and behavioural disorders, importance of the early years 1a of 3**  \n**Importance of the early years for lifelong wellbeing - Dr Tanya Wright (parts 1, 2) (30 minutes + 28 minutes = 58 minutes)**\n(PHARMAC, NZ, 2018)\n**  \nPHARMAC seminar: Emotional and behavioural disorders, importance of the early years part 1b of 3  \n  \n**\n(PHARMAC, NZ, 2018)\n**  \n2. PHARMAC seminar: Attachment theory and reflective functioning 2 of 3**  \n**Attachment theory and reflective functioning - Dr Tanya Wright (28 minutes)**\n(PHARMAC, NZ, 2018)\n**  \n3. PHARMAC seminar: ADHD in children, youth and adults 3a of 3**  \n**ADHD in children, youth and adults - Dr James Gardiner (parts 1, 2 & 3) (36 mins + 36 mins + 45 mins = 117 minutes)  \n  \n**\n(PHARMAC, NZ, 2018)\n**  \nJames Gardiner ADHD in children, youth and adults, part 2  \n  \n**\n(PHARMAC, NZ, 2018)\n**  \nPHARMAC seminar: ADHD in children, youth and adults, 3c of 3  \n  \n**\n(PHARMAC, NZ, 2018)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[!",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.903908+00:00",
    "source": "healthify"
  }
}
