{
  "url": "https://healthify.nz/health-a-z/a/arthritis-and-exercise/",
  "title": "Arthritis And Exercise",
  "content": "Can be a social activity.  \n**Considerations:** Doesn't challenge your brain or include balance or upper body components. May not raise your heart rate enough. Can be a social activity.\n#### Jogging and running\n**Positives:** Can be done anywhere and anytime at no cost. Can be social.  \n**Considerations:** High impact so could aggravate your knees, hips or spine. \n#### Cycling \n**Positives:** Great for osteoarthritis in your knees. It's non-weight bearing and low impact so puts less stress on joints. If done inside you can join a class, change the intensity using a stationery bike and it's not weather dependent.  \n**Considerations:** Doesn't help to strengthen bones as it's low impact and doesn't strengthen upper back if needed for posture. If done outside you need access to a bike and somewhere safe to cycle. It's also weather dependent. If inside you need access to a stationery bike at home or by joining a gym class.\n#### Swimming\n**Positives:** Non weight-bearing so good for joints, Good for cardio.  \n**Considerations:** No bone strengthening or balance work provided, and you need access to a pool.\n![Older people swimming in a class](https://healthify.nz/assets/Card-Images/older-people-swimming-canva-65x443__ResizedImageWzYwMCw0MDBd.png) _Image credit: Canva_\n#### Gym\n**Positives:** Equipment provides cardio and resistance work and balance and flexibility can be included. You can personalise what you do and measure your progress.  \n**Considerations:** You may not feel confident going to a gym. You need to pay for access to the gym and to an exercise professional for advice on a programme to suit you.\n#### Seated classes\n**Positives:** Good if you have limited mobility, and can include strength work using bands and weights.  \n**Considerations:** No balance component involved and not very intense. There can be a cost involved.\n#### Circuit classes\n**Positives:** You can work at your own pace and include cardio, resistance and balance work.  \n**Considerations:** There's likely to be costs involved for access to a gym and a good instructor.\n#### Yoga\n**Positives:** Balance, strength and flexibility provided for. There's a good focus on breathing. It can be done in a class or at home.  \n**Considerations:** Need a teacher to provide alternatives and options which may have a cost.\n![Woman doing a yoga stance outside](https://healthify.nz/assets/Healthy-Living/Exercise/Larger-woman-yoga-by-water-canva-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Canva_\n#### Tai Chi\n**Positives:** Helps with balance and strength and cognitive skills (in learning moves). Gentle exercise.  \n**Considerations:** No cardio component, classes can be costly.\n",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.102436+00:00",
    "source": "healthify"
  }
}
