{
  "url": "https://healthify.nz/health-a-z/a/advance-care-planning/",
  "title": "Advance Care Planning",
  "content": "# Advance care planning\n### Key points about advance care planning\n  * Advance care planning is the process of thinking about, talking about and planning for future health care and end-of-life care.\n  * Advance care planning is important for people and their families at all times during the health care journey.\n  * This page provides information about what advance care planning is, and includes guides and resources to get you started.\n\n\n![Older woman in garden with dog](https://healthify.nz/assets/Healthy-Living/Seniors/Older-woman-in-garden-with-dog-canva-950x690.jpg)\nQR Code Print\n####  Key points about advance care planning \nThinking, talking, planning, sharing and reviewing what matters to you, can better prepare you, your whānau and healthcare team for what the future might hold. \nTalking to your whānau and healthcare team ahead of time is especially helpful if you are in a situation where you can no longer tell them yourself, such as if you're in an advanced stage of dementia or when something unexpected happens.\nYou may find that thinking about what matters most to you and your wishes and care priorities in advance can help you take part better in your future health care decision making. You can then write down your thoughts in an advance care plan, which is a written record that includes your preferences for your future health care.\nAdvance care planning can be done when you are perfectly healthy and want to prepare for the worst-case scenario or because you have a long-term condition or life-threatening illness.\nThe 5 steps involved in advance care planning include thinking about, talking about, planning for, sharing and reviewing ([see below](https://healthify.nz/health-a-z/a/advance-care-planning#five-steps)). Advance care planning is a voluntary process. \n####  What is advance care planning and why is it important? \nAdvance care planning is a process of thinking and talking about your values and goals and what your preferences are for current and future health care. Advance care planning helps you to understand what the future might hold and say what health care you would or wouldn't want, including end-of-life care. Read more about [advance care planning(external link)](https://www.myacp.org.nz/what-is-advance-care-planning \"Open external link\").\nAdvance care planning is important because:\n  * it encourages conversation about what matters to you and your whānau\n  * it can help you and your whānau understand what is happening to your health and what that might mean for you in the future\n  * it can help you and your whānau feel more in control and reduce anxiety as you face future health events\n  * it enables you to say how you would like to be cared for if you're not able to tell people this yourself, eg, if you have advanced dementia or when something unexpected happens.\n\n\nMany people choose to write down their advance care planning wishes in an advance care plan. The [creating your plan(external link)](https://www.myacp.org.nz/your-plan \"Open external link\") section on the advance care planning national website has lots of tools to help you think about and write down what matters most to you.   \n  \n\n![Grandmother holding grandchild on couch](https://healthify.nz/assets/Maori-and-Pasifika-people-/grandmother-cradling-newborn-baby-Canva__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Canva_\n####  What is an advance care plan? \nAn advance care plan is a template where you can write down your advance care planning wishes, including the things that are important to you and the types of medical care and treatment you do or don't want to receive in the future, including at the end of your life. \nAn advance care plan tells your family and your healthcare team about the treatment and care you want if you are no longer able to tell them yourself.\nAn[advance care plan(external link)](https://www.myacp.org.nz/your-plan#writing-your-acplan \"Open external link\") can include things such as:\n  * Who you are and what's important to you.\n  * What's happening with your health now and what you might expect might happen in the future.\n  * Your spiritual and emotional needs.\n  ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:21.568143+00:00",
    "source": "healthify"
  }
}
