{
  "url": "https://healthify.nz/health-a-z/a/amoebiasis/",
  "title": "Amoebiasis",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Minja Bojic, Clinical Editor, Auckland Region Community HealthPathways\nLast reviewed: 14 Aug 2024\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/amoebiasis \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Amoebiasis\n### Key points about amoebiasis\n  * Amoebiasis is an infection of the bowel caused by a parasite called _Entamoeba histolytica_.\n  * It's not common in Aotearoa New Zealand and most people who get it have recently travelled to less-developed countries, or have had contact with someone who has.\n  * When a person is infected, the parasite is in their poo and can easily infect others.\n  * Antibiotics work well for treating amoebiasis.\n\n\n![Family of 4 off travelling at airport](https://healthify.nz/assets/Healthy-Living/Families/Family-travelling-canva-950x690.jpg)\n####  What is amoebiasis? \nAmoebiasis is an infection of the bowel caused by a parasite _Entamoeba histolytica_.\nAmoebiasis isn't common in Aotearoa New Zealand and most people who get it have recently travelled to less-developed countries or have had contact with someone who has.\n  * When a person is infected, the parasite is in their poo and can easily infect others.\n  * Most people who have the parasite don't have symptoms, or have mild symptoms such as diarrhoea (runny poo), stomach pain, and stomach cramping.\n  * In rare cases, people can develop severe symptoms such as amoebic dysentery.\n  * Antibiotics are effective in treating amoebiasis.\n\n\n####  How is amoebiasis spread? \nYou get infected when you swallow the parasite _Entamoeba histolytica_ that causes amoebiasis. The parasite can spread when infected people don't dispose of their poo hygienically or don't wash their hands properly after going to the toilet.\nYou can ingest the parasite when you:\n  * eat contaminated raw fruit and vegetables\n  * drink contaminated water\n  * engage in unprotected sexual activity (oral–anal sex).\n\n\nThe parasite can survive for weeks, or even months, in soil, fertiliser, or water that's contaminated with infected faeces (poo).   \n\n**Note:** Most people who become infected don't have symptoms, but the parasite is still present in their poo.\n####  Who is most at risk of getting amoebiasis? \nPeople who have amoebiasis have recently travelled to areas where amoebiasis is common. This is mostly countries with poor sanitation, such as in Central and South America, Africa, and Asia.\n####  What are the symptoms of amoebiasis? \nMost people who have the parasite don't have symptoms, or have mild symptoms such:\n  * watery, runny poo (diarrhoea)\n  * stomach cramps\n  * fever (high temperature).\n\n\nSymptoms usually develop within 2 to 4 weeks but can show up later. In rare cases, people can develop severe symptoms.\n#### Severe symptoms of amoebiasis\n**Amoebic dysentery**\nThis is severe inflammation of the gut causing ulceration of the intestinal lining. Symptoms include severe diarrhoea with blood and mucus in your poo, loss of appetite, weight loss, or bleeding from the rectum with no diarrhoea. Symptoms can last for several weeks.\n**Amoebic liver abscess**\nThis happens when the parasite passes through the intestinal wall, enters your bloodstream, and moves to your liver where it forms an abscess. The abscess is filled with pus. It can develop some time after the initial infection – months or years. Symptoms include fever and abdominal (tummy) pain or discomfort and tenderness. You may also notice that the skin and the whites of your eyes become yellow (jaundiced) and your liver may also become enlarged (a doctor may be able to tell this when they examine your abdomen).\nRarely, the parasite has spread to other parts of the body, including the lungs and brain.\n####  How is amoebiasis diagnosed? \nAmoebiasis is diagnosed by testing for the presence of the parasite in your poo. If you develop gastro after returning home from overseas, contact your healthcare provider, so they can arrange for a test.\n  * You will need to provide a poo sample. ",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.681479+00:00",
    "source": "healthify"
  }
}
