{
  "url": "https://healthify.nz/health-a-z/a/actinic-keratoses/",
  "title": "Actinic Keratoses",
  "content": "Actinic keratoses start as flat pink or grey scaly spots. They're rough to touch and grow into patches and get thicker. They can then look white or yellow. There are often more than 1 of them, and they can grow to join together. Sometimes they can be tender (sore to touch.)\nActinic keratoses are very common in places that get a lot of sun exposure, especially:\n  * the backs of your hands\n  * ears\n  * nose\n  * cheeks\n  * lips\n  * temples\n  * forehead\n  * balding scalps.\n\n\nActinic keratoses are precancerous. That is, some can develop into a type of non-melanoma skin cancer called a squamous cell carcinoma. The risk is small, but if you have many this can add up.\nThe images below show actinic keratoses on the back of a hand and on a forehead. \n![Actinic keratoses on a hand and a forehead](https://healthify.nz/assets/Health-A-Z/Skin-topics/Actinic-keratoses-on-hand-and-forehead-DermNet-665x350.png)\n_Image credit: DermNet NZ_\n####  What causes actinic keratoses? \nActinic keratoses are skin damage caused by years of exposure to ultraviolet (UVB) radiation found in sunlight. They're more common if:\n  * you have fair skin\n  * you've been sunburned often in the past\n  * you've worked outdoors for many years, especially without sun protection\n  * your immune system is supressed by disease or medicines.\n\n\nThey often start to appear when you're in your 60s.\n####  How are actinic keratoses diagnosed and treated? (+ APPS) \n#### Diagnosis\nActinic keratoses have a typical appearance which can be diagnosed on examination by your healthcare provider. Sometimes they will use a dermoscope (a magnifying instrument). If they think you could have a squamous cell carcinoma (SCC) they might take a biopsy (a small sample to send to the laboratory). Read more about [SCCs](https://healthify.nz/health-a-z/s/squamous-cell-carcinoma-scc).\n####    \nTreatment\nThe aim of treatment is to remove the abnormal skin cells to prevent them becoming skin cancers. New skin then forms from deeper cells that have escaped sun damage. You may choose to have them treated because of how they look or where they are. Actinic keratoses are usually treated by your GP or nurse.\nTreatment will depend on the size and number of the skin lesions and may include:\n  * Observation only.\n  * Emollients (eg, 10% urea cream) for scaliness.\n  * Cryotherapy – freezing with liquid nitrogen. This is a very common treatment that's easy to do. It may leave a pale scar and often needs repeating. \n  * Topical creams – a range of creams are available. These are useful for treating areas that are not suitable for other treatments or for large areas where there are multiple keratoses, eg, on your scalp, forehead or ears. Examples of topical creams include[5-Fluorouracil](https://healthify.nz/medicines-a-z/f/fluorouracil-cream \"Fluorouracil \\(cream\\)\")[Imiquimod](https://healthify.nz/medicines-a-z/i/imiquimod-cream \"Imiquimod \\(cream\\)\"). \n  * Photodynamic therapy (PDT) – this involves applying a photosensitiser (a porphyrin chemical) to the affected area before exposing it to a strong source of visible light. The treated area develops a 'burn' and then heals over a couple of weeks or so. Metvix PDT is available in Aotearoa New Zealand.\n  * Excision – this involves a small surgical procedure using local anaesthetic to cut the lesion out. This will often need a few sutures (stitches), which are removed 5 to 14 days later (depending on the location). \n\n\n",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:19.660212+00:00",
    "source": "healthify"
  }
}
