{
  "url": "https://healthify.nz/health-a-z/a/angioedema/",
  "title": "Angioedema",
  "content": "* Medicine may prevent swelling. \n\n\n![Wasp hovers about to sting](https://healthify.nz/assets/Plants-and-animals/Wasp-canva-950x690.png)\n####  What is angioedema? \nAngioedema involves swelling in the deep layers of your skin.The most common areas affected are your face, lips, tongue, throat and genitals. Swelling in one area usually lasts between 1 to 3 days. Occasionally, swelling of internal organs, eg, your oesophagus (food pipe or gullet that leads to the stomach), stomach, or bowel can trigger chest or stomach pains.\n#### Call 111 if you or your whānau:\n  * have sudden swelling of your lips, tongue or throat\n  * are struggling to swallow\n  * are finding it hard to breathe.\n\n\n####  Don't wait, this is a medical emergency.  \n---  \n####  What causes angioedema? \nThe release of chemical called histamine from some of the immune cells within your skin seems to be the trigger for swelling in most people. The most common triggers for this are [allergy](https://healthify.nz/health-a-z/a/allergies), [ACE inhibitor medicines](https://healthify.nz/medicines-a-z/a/ace-inhibitors \"ACE inhibitors\"),[hereditary angioedema (HAE)](https://healthify.nz/health-a-z/h/hereditary-angioedema-hae \"Hereditary angioedema HAE\"), acquired C1-inhibitor deficiency and infection.\n####    \nAllergies\nAngioedema is often the result of an allergic reaction. This is where your body mistakes a harmless substance, such as a certain food, for something dangerous. It releases chemicals (eg, histamine) into your body to attack the substance, which causes swelling.\nAngioedema can be triggered by an allergic reaction to:\n  * food – particularly nuts, shellfish, milk and eggs\n  * medicine – including some [antibiotics](https://healthify.nz/medicines-a-z/a/antibiotics), [aspirin](https://healthify.nz/medicines-a-z/a/aspirin-low-dose) and [non-steroidal anti-inflammatory drugs](https://healthify.nz/medicines-a-z/n/non-steroidal-anti-inflammatories-nsaids) (NSAIDs), eg, [ibuprofen](https://healthify.nz/medicines-a-z/i/ibuprofen)\n  * [insect bites and stings](https://healthify.nz/health-a-z/i/insect-bites-and-stings) – particularly wasp and bee stings\n  * latex – a type of rubber used to make medical gloves, balloons and condoms.\n\n\nThe images below show angioedema on an eyelid following an insect sting and hives on skin.\n![Boy with angioedema on his eyelid from an insect sting](https://healthify.nz/assets/Health-A-Z/Skin-topics/Boy-with-angioedema-from-wasp-sting-on-eyelid-Depositphotos-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Depositphotos  \n  \n_\n![Hives on skin](https://healthify.nz/assets/Health-A-Z/Skin-topics/Skin-with-hives-Depositphotos-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Depositphotos_\n  \nAngioedema caused by allergies is known as allergic angioedema. Allergic disease is almost never the cause of swelling that lasts for days or comes back over and over for weeks at a time.\n####    \nMedicines\nSome medicines can cause angioedema – even if you're not allergic to the medicine. Most swellings appear within the first few months of starting the medicine but sometimes you may not have any reaction for months to years, or it may only happen when your dose is increased.\nMedicines that can cause angioedema include:\n  * [angiotensin-converting enzyme (ACE) inhibitors](https://healthify.nz/medicines-a-z/a/ace-inhibitors), eg cilazapril, enalapril, lisinopril, perindopril and ramipril, which are used to treat [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high) and heart problems, ibuprofen and other types of [non-steroidal anti-inflammatory](https://healthify.nz/medicines-a-z/n/non-steroidal-anti-inflammatories-nsaids) painkillers\n  * [angiotensin-2 receptor blockers (ARBs)](https://healthify.nz/medicines-a-z/a/angiotensin-receptor-blockers-arbs), eg, candesartan, irbesartan, losartan, olmesartan and valsartan – another medicine used to treat high blood pressure.\n\n\nAngioedema caused by medicine is known as drug-induced angioedema.\nThe swellings from these medications are not itchy or painful, usually occur around your face, tongue and throat and are not accompanied by hives. It can take a few weeks after stopping the medicine for the swelling to go down. \n####    \nHereditary angioedema (HAE)\nRarely, angioedema occurs because of a genetic defect. These people have low levels (deficiency) or reduced effectiveness of C1-inhibitor enzyme – a chemical which slows down certain immune reactions. How often the swelling occurs can vary. Some people experience it every week, while others experience it less than once a year. If you have HAE, you have a 50/50 chance of passing it on to your children. Read more about[hereditary angioedema (HAE)](https://healthify.nz/health-a-z/h/hereditary-angioedema-hae). \n####    \nAcquired C1-inhibitor deficiency\nIn even rarer cases, low levels of C1-inhibitor occur in association with some cases of lymphoma, malignancies or autoimmune diseases, eg, systemic lupus erythematosus (SLE). \n####    \nInfection\nA viral infection is the most common cause of hives and angioedema in children, especially if they last for more than 24 hours. \n####    \nOther causes\nThyroid gland disease and some types of inflammatory arthritis are more common in people with hives and angioedema. In some people whose swellings continue for years without an obvious cause, an autoimmune process may be responsible. This means that part of your body's immune system may be attacking your skin. \n",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.154293+00:00",
    "source": "healthify"
  }
}
