{
  "url": "https://healthify.nz/health-a-z/a/acupuncture/",
  "title": "Acupuncture",
  "content": "![Acupuncture needle going into right hand](https://healthify.nz/assets/Health-A-Z/Pain/Acupuncture-needle-in-hand-Canva.jpg)\n####  What is acupuncture? \n![Practitioner puts acupuncture needles in a stomach](https://healthify.nz/assets/Legacy/17548/acupuncture-stomach-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Canva_\nAcupuncture is a form of [complementary and alternative medicine (CAM)](https://healthify.nz/medicines-a-z/c/complementary-and-alternative-medicine \"Complementary and alternative medicine\") and refers to a therapy used to stimulate certain points on your body, normally with needles.  \n  \nThere are 2 main types of acupuncture practised in New Zealand – traditional Chinese acupuncture and Western medical acupuncture.\n####    \nTraditional Chinese acupuncture\nChinese acupuncture as it is practised now is a highly modified version of an ancient practice. It is based on the belief that a‘life force’  \n  \nThe acupuncturist may say there is an imbalance in these elements, and use a variety of techniques, including acupuncture, to bring your body into balance and harmony. These are not scientific concepts, and the language that acupuncturists use is not compatible with the language of other health practitioners in New Zealand.\nThere are different styles of Chinese acupuncture, and some traditional acupuncturists now also use the modern-day knowledge of anatomy but still use this traditional language. \n####    \nWestern acupuncture\nWestern medical acupuncture is also known as dry needling. This is done for musculoskeletal problems, and the aim is to insert the needle into trigger points in your body to try and improve pain and function. The needle points in Western acupuncture may align with the points of traditional Chinese acupuncture.\n####  What conditions is acupuncture used to treat? \nTraditional Chinese Medicine (TCM) providers may use acupuncture to attempt to treat a wide range of health conditions. Some of the conditions treated are pain, mental health conditions, cancer, infertility, digestive problems, respiratory problems, menstrual problems, erectile dysfunction, alcoholism, diabetes, menopause, high blood pressure, baldness and smoking cessation. \nNon-TCM providers, such as some physiotherapists, may use Western medical acupuncture to treat various pain and injury problems, but not some of the other conditions treated by TCM providers. \nThe use of acupuncture is not always based on scientific evidence. Read about the evidence below at\n####  What happens during acupuncture treatment? \nAcupuncture involves using very thin disposable needles being placed in your skin to stimulate specific sensory nerves under your skin and in your muscles.\nThe insertion of needles in certain points can cause your nervous system to release different pain-relieving molecules and can cause changes in your brain. \nIn a typical session, the acupuncturist discusses your symptoms, examines you and talks you through the treatment options they can offer. \nThe first session can take up to an hour and follow up appointments about 15–30 minutes. You usually have 6–12 treatments, spread over a few months, for each condition. \nDepending on what is being treated, 5–20 needles are gently inserted into your skin. You may feel an aching sensation when they are first placed but it should not be painful. The needles stay in place for 10–20 minutes while you relax. They may be moved or twirled during this time. \nAt times you may experience tingling or aching sensations, but you should not feel pain. Let your acupuncturist know if it becomes too uncomfortable or you feel any pain. \nWhen the needles are removed you may be a bit sore, and sometimes have some bruising and a little bleeding. \nMany traditional Chinese medicine providers offer other CAM treatments such as herbal medicine, cupping, moxibustion (burning artemesia near your skin), skin scraping, electro-acupuncture and tui na (Chinese massage). These other treatments are not discussed on this page.\n####  What are the risks of acupuncture? \nAcupuncture is generally very safe. Rare side effects include puncturing your lungs, puncturing the lining of your abdomen, puncturing an organ, infection, breaking a needle and it staying under your skin, and nerve damage.  \n  \nMore common side effects include short-term pain or bruising in the area (about 1 in 30).   \n  \nSerious side effects are more common with poorly trained and unregistered acupuncturists. Registered acupuncturists are required to use disposable sterile needles. \nTalk to your doctor before having acupuncture if you have a bleeding disorder, use blood thinners, have a pacemaker or are pregnant.\n####  Does acupuncture work? \nMost of the research has been done for pain conditions rather than for other conditions such as infertility, cancer and organ problems. Whether acupuncture works or not is a highly controversial area, and the research is inconclusive and conflicting. Much of the effect, if any, may be due to the placebo effect. Read more about[the placebo effect](https://healthify.nz/medicines-a-z/c/complementary-and-alternative-medicine \"Complementary and alternative medicine\"). \nThere are some important points to note about the research on acupuncture.\n  * The diseases treated by traditional acupuncturists don’t exist in Western medicine. One Western diagnosis can have many Eastern diagnoses, eg, diabetes can be diagnosed as‘lung fire’,‘kidney fire’‘stomach fire’.\n  * The treatments are often individualised, and the results may depend on the experience of the practitioner, the cultural context in which it is performed and the expectations of the patient. \n  * There are many different styles and techniques that are taught and practised, and the acupuncture points chosen by practitioners vary widely.\n  ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.042457+00:00",
    "source": "healthify"
  }
}
