{
  "url": "https://healthify.nz/health-a-z/a/anorexia/",
  "title": "Anorexia",
  "content": "You develop obsessive eating habits such as avoiding eating, eating only small amounts of certain foods, or weighing and measuring your food extremely carefully, despite suffering hunger pangs.\nOther habits to maintain low body weight may also include frequent, intense exercise, purging mechanisms such as forced vomiting, and abuse of laxatives, enemas and diuretics. \n####  What are the symptoms of anorexia? \nAnorexia includes physical and emotional symptoms such as:\n  * an intense fear of becoming fat or putting on weight, even if already underweight\n  * distorted views of weight or shape image\n  * denying the seriousness of extremely low body weight\n  * resistance to maintaining a normal body weight\n  * severe sensitivity to cold\n  * growth of down-like body hair\n  * delayed onset, infrequent or no menstrual periods in females who have reached puberty\n  * irritability, inability to concentrate/think clearly\n  * obstinate behaviour, unhappiness, depression.\n\n\n####  What are the causes of anorexia? \nFactors involved can include:\n  * low self-esteem\n  * poor body image\n  * a reluctance to mature – physically, sexually and emotionally\n  * a feeling of not being in control of your life\n  * life crises, eg, changed relationships, death, childbirth.\n\n\n####  What is the treatment for anorexia? \nIf you have anorexia, it's important to realise this is a serious problem. Because of the complexities of eating disorders, treatment should be started as early as possible for the best outcome and should involve comprehensive specialist care.   \n  \nTreatment for anorexia is usually tailored to your individual needs. This usually includes medical oversight (either by a GP or psychiatrist), who carry out regular medical assessments and psychological treatment. The medical professional and the psychologist keep in regular contact to ensure your welfare is being looked after as much as possible.  \n  \nPsychological treatment can include looking at factors that contribute to the eating disorder (thoughts and behaviours) and learning ways to reduce or change these. If the person with anorexia is a child or young person, the best treatment seems to be family systems therapy.  \n  \nIf you have a dangerously low weight, you might need to restore your weight to a healthy level. Weight restoration could be required when it is clear that your health is in danger, eg, your potassium is so low that your heart is of risk of developing problems, or your psychological health is at risk, eg, if you get too low in weight your brain will literally eat itself to survive and your thinking will become very distorted.  \n  \nYou and your team work together to decide what \"weight restoration\" means in your case.\n[Selective serotonin re-uptake inhibitors (SSRIs)](https://healthify.nz/medicines-a-z/s/ssri-antidepressants \"SSRI antidepressants\")  \n  \nFamily, whānau and friends should try to encourage you to take personal responsibility in seeking help, and to learn to accept your strengths and limitations and your successes and failures as being a normal part of life.\n**It is important to remember the following** :\n  * Early recognition can help prevent more serious eating disorders developing.\n  * While dietary monitoring and advice are important, effective treatment must address any underlying psychological issues.\n  ",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:31.515311+00:00",
    "source": "healthify"
  }
}
