{
  "url": "https://healthify.nz/health-a-z/a/albuminuria/",
  "title": "Albuminuria",
  "content": "It has many important functions including building muscle, repairing tissue, and fighting infection. It also acts a bit like a sponge to hold fluid in your bloodstream instead of it leaking into places it shouldn't be.\nAlbumin and other proteins aren't usually found in urine (pee), or they're only found in tiny amounts, because healthy kidneys stop most of your protein from entering your urine. If your kidneys are damaged, larger amounts of albumin and other proteins can pass through their filters and into your urine. If other proteins (as well as albumin) are found in your pee, it's usually called proteinuria.\nHaving albumin in your urine (called albuminuria) is not a separate disease, but may be a symptom of many conditions that can cause kidney damage.\n####  What causes albuminuria? \nAlbuminuria may be short-term or temporary, eg, when caused by:\n  * not drinking enough water ([dehydration](https://healthify.nz/health-a-z/d/dehydration-adults))\n  * fever or infection of the urinary tract\n  * high-intensity exercise.\n\n\nAlbuminuria may be ongoing and may be a sign of a long-term (chronic) health condition, for example:\n  * [diabetes](https://healthify.nz/health-a-z/d/diabetes-overview) (especially if your blood glucose levels are higher than your target range)\n  * [hypertension](https://healthify.nz/health-a-z/b/blood-pressure-high) (high blood pressure)\n  * [heart disease](https://healthify.nz/health-a-z/h/heart-disease) and/or heart failure or a sudden worsening (flare-up)\n  * pre-eclampsia in pregnancy\n  * diseases of a part of the kidney called the glomeruli (eg, IgA nephropathy, lupus nephritis, focal segmental glomerulosclerosis (FSGS), or glomerulonephritis).\n\n\nIn these long-term conditions, having albumin in your urine increases your risk of kidney failure and cardiovascular disease (heart attack or stroke). It can also lower your life expectancy if left untreated. \n####  How would I know I have albuminuria? \nYou may not know you have albuminuria as you may not have any symptoms. The only way to confirm whether or not you have it is to test a sample of your urine (pee) for albumin.\nIt's a good idea to have regular health check-ups, including having your urine tested, especially if you have kidney disease or health problems that can affect your kidneys (see the causes section above). \nIf you have early albuminuria you usually won’t notice any symptoms. When the levels of albumin and other proteins in your urine get higher, your pee may become foamy or frothy. When your kidneys are very damaged, your skin may get puffy or you may have swollen ankles, hands, tummy or face.\n####  How is albuminuria diagnosed? \nDetecting albumin in the urine can be done in 2 ways – a urine dipstick test and a urine albumin and creatinine ratio measurement (called uACR). For these tests you'll be asked to give a urine sample in a special container. \n#### Urine dipstick test\nYour healthcare provider places a dipstick, a strip of chemically treated paper, into the urine. The dipstick changes colour if albumin is present in your urine. This test doesn't report the exact amount of albumin that's present. Instead, the change in colour on the test strip is compared to a reference chart to estimate how much albumin may be present. Read more about [urine testing](https://healthify.nz/health-a-z/u/urine-testing). \n![Urine dipsticks and chart](https://healthify.nz/assets/Health-A-Z/Healthcare/Urine-dipsticks-canva-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Canva_\n#### Albumin and creatinine ratio (ACR) measurement\nThis measurement is used to determine the ratio between the albumin and creatinine in your urine and to estimate the amount of albumin excreted in 24 hours.\n  * Creatinine is a waste product that's filtered in your kidneys and excreted in your urine.\n  * For this test, your healthcare provider will send a sample of your urine to the laboratory for analysis.\n\n\n",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:23.337979+00:00",
    "source": "healthify"
  }
}
