{
  "url": "https://healthify.nz/health-a-z/a/agoraphobia/",
  "title": "Agoraphobia",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Phoebe Hunt, Medical Officer, Northland\nLast reviewed: 26 Oct 2023\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/agoraphobia \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Agoraphobia\n### Key points about agoraphobia\n  * Agoraphobia is a type of anxiety disorder where you feel extremely scared of situations or places that would be difficult to get away from or get help in.\n  * Agoraphobia varies from day to day. It doesn’t mean you panic every time you go to the supermarket or into a situation you have felt scared about before, but sometimes you do.\n  * As agoraphobia is a severe type of anxiety, many people with agoraphobia do have panic attacks.\n  * Agoraphobia can affect your life a lot, so it’s important that you get help.\n  * There are treatments that can make a difference.\n\n\n![Felled tree with green shoots showing resilience](https://healthify.nz/assets/Plants-and-animals/Resilience-felled-tree-sprouting-canva-950x690.jpg)\nQR Code Print\n####  What is agoraphobia? \nAgoraphobia is a type of anxiety disorder in which you feel extremely scared of situations or places that would be difficult to get away from or get help in.\nAlthough agoraphobia is often thought of as a fear of ‘open spaces’, it’s about:\n  * a fear of feeling panic when you think about being in a situation that would be hard or embarrassing to leave or to get help in, and\n  * the panic you feel when you are in that situation.\n\n\nThese fears can make you scared about leaving your home, using public transport or being in a public place. Those who suffer the most change their behaviour so much that they can’t leave the house.\n####  Who develops agoraphobia? \nAgoraphobia affects about 1.5 per cent of the population. Agoraphobia usually develops between the ages of 25 and 35 years and is usually a lifelong condition unless treated. Agoraphobia commonly occurs alongside other anxiety disorders or post-traumatic stress disorder (PTSD).\n![Woman holding mug looks wistfully out window](https://healthify.nz/assets/Legacy/2191/woman-looking-out-of-window-holding-mug-123rf__ResizedImageWzYwMCw0MDBd.jpg)\n_Image credit: 123rf_\n####  What causes agoraphobia? \nWhile the cause of agoraphobia isn’t known, it’s more common in people who tend to be anxious or nervous. About two-thirds of people with[panic disorder](https://healthify.nz/health-a-z/p/panic-disorder \"Panic disorder\")\n  * trauma\n  * severe stress\n  * other mental illness, eg, depression or eating disorders\n  * drug or alcohol misuse\n  * a family history of anxiety or depression.\n\n\n",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:22.717348+00:00",
    "source": "healthify"
  }
}
