{
  "url": "https://healthify.nz/health-a-z/a/anxiety/",
  "title": "Anxiety",
  "content": "Anxiety is a normal human emotion. Most people experience some anxiety when facing a new, unknown situation, when a stressful event happens or something goes wrong in their life. However sometimes the anxiety keeps going after the problem has gone, the anxiety is intense even though the problem is ordinary, or there is no threat, but you worry ‘what might happen if…’. If this lasts a long time and interferes with your day-to-day life, it’s called an anxiety disorder.\nAnxiety disorders are very common. Approximately 1 in 4 New Zealanders will have an anxiety disorder at some stage in their lives. At any one time, 15% of the population will be affected. The types of anxiety disorders include:\n  * [social anxiety disorder](https://healthify.nz/health-a-z/s/social-anxiety-disorder \"Social anxiety disorder\")\n  * generalised anxiety disorder\n  * separation anxiety disorder\n  * selective mutism (not talking)\n  * [specific phobia](https://healthify.nz/health-a-z/p/phobias \"Phobias\")\n  * [panic disorder](https://healthify.nz/health-a-z/p/panic-disorder \"Panic disorder\")\n  * [agoraphobia](https://healthify.nz/health-a-z/a/agoraphobia \"Agoraphobia\")\n  * substance/medication-induced anxiety disorder.\n\n\n####  What causes anxiety disorders? \nMany different things can lead to anxiety disorders.\n  * Anxiety disorders can run in families, and having a family member with depression makes an anxiety disorder more likely too.\n  * Difficult past life experiences are a common background for anxiety disorders, eg, childhood abuse, neglect or bullying.\n  * Life events are common triggers for anxiety, eg, death of a loved one, job loss or relationship breakups.\n  * Having a long-term illness such as diabetes, arthritis or chronic obstructive pulmonary disease (COPD) makes an anxiety disorder more likely to happen.\n  * Medical conditions, eg, [hyperthyroidism](https://healthify.nz/health-a-z/o/overactive-thyroid).\n  * Medicines and recreational drugs including salbutamol and prednisone, alcohol, caffeine, MDMA (Ecstasy), methamphetamine and cannabis.\n\n\n####  What are the symptoms of an anxiety disorder? \nAnxiety disorders have a range of physical and mental symptoms, such as:\n  * restlessness\n  * a sense of dread\n  * feeling constantly \"on edge\" or irritable\n  * difficulty concentrating\n  * impatience\n  * dizziness\n  * strong or irregular heartbeat (palpitations)\n  * dry mouth or sweating\n  * shortness of breath\n  * nausea and or stomach ache\n  * headache\n  * poor sleep.\n\n\nThe physical symptoms are caused by adrenaline and stress hormones. Symptoms can come on gradually or build up quickly. You worry about will happen because of the anxiety. This can lead to changes in your behaviour including avoiding things which might set off anxious feelings. You may find yourself withdrawing from social contact and not wanting to see your whānau and friends to avoid feelings of worry and dread.  \n  \nGeneralised anxiety disorder is a common type of anxiety disorder. This is when you’re extremely worried about many different things for longer than 6 months – even when there is little or no reason to worry about them. It can be hard to know what the cause is or why certain things trigger you to worry.\nOther anxiety disorders have these symptoms too, as well as symptoms specific to the type of disorder. Read more about [agoraphobia](https://healthify.nz/health-a-z/a/agoraphobia), [phobias](https://healthify.nz/health-a-z/p/phobias), [panic disorder](https://healthify.nz/health-a-z/p/panic-disorder) and [social anxiety disorders](https://healthify.nz/health-a-z/s/social-anxiety-disorder).\n####  How is an anxiety disorder diagnosed? \nIf you think your feelings of anxiety may be an anxiety disorder you can start with a [screening test](https://healthify.nz/tools/g/general-anxiety-scale-gad-7) called the GAD-7. The test is also available in [multiple languages(external link)](https://www.phqscreeners.com/select-screener \"Open external link\").\nScreening tests can’t diagnose an anxiety disorder. For this test if you score 5 or above, it means you should see a healthcare provider to talk about your responses.\nYou can choose to see a mental healthcare provider or make an appointment with your GP or nurse practitioner. [Find a mental health professional(external link)](https://mentalhealth.org.nz/help/accessing-mental-health-services \"Open external link\").\n",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:32.177865+00:00",
    "source": "healthify"
  }
}