{
  "url": "https://healthify.nz/health-a-z/a/anencephaly/",
  "title": "Anencephaly",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Janine Bycroft, GP, Auckland\nLast reviewed: 13 Oct 2023\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/anencephaly \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Anencephaly\n### Key points about anencephaly\n  * Anencephaly is when a baby's brain and head doesn't form properly when it's growing in the womb (uterus). \n  * Sadly, this means the baby dies before it is born or very soon afterwards.\n  * Support and information are available for parents.\n  * There is no cure or treatment for anencephaly but risk can be reduced by taking folic acid before and during early pregnancy.\n\n\n![Side-view of pregnant woman cradling her baby bump](https://healthify.nz/assets/Healthy-Living/Pregnancy-babies/Pregnant-woman-Canva-950x690.png)\n####  What is anencephaly? \nAnencephaly is when the neural tube that forms the brain and spinal cord doesn’t fully close at the top while the fetus is growing.It happens during the first 24 days of a pregnancy and is known as a neural tube defect (NTD). The most common types of NTDs are [spina bifida](https://healthify.nz/health-a-z/s/spina-bifida) and anencephaly.\nWith anencephaly, the brain doesn’t fully develop – there will be no forebrain (front part) and no cerebrum (the coordinating and thinking part). Often the rest of the brain isn’t covered over with skull and skin. Without a fully formed brain, the baby dies before or shortly after birth – within hours or days. \nIn Aotearoa New Zealand, 5 to 6 babies in every 10,000 pregnancies are born with anencephaly, although many more are diagnosed with this condition during pregnancy. The number of pregnancies affected by NTDs is decreasing because there is more awareness of the importance of folic acid for babies’ development (see below). \nThe image below shows how the front and top of the baby’s brain hasn’t developed and the top of the head has no bone or skin covering.\n![Image of baby with brain and head not fully formed due to anencephaly](https://healthify.nz/assets/Health-A-Z/Neurological/Anencephaly-wikimedia-commons-CDC-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Centers for Disease Control and Prevention, National Center on Birth Defects and Developments; Disabilities, Wikimedia Commons_\n####  What are the causes of anencephaly? \nThe cause is not clear but it’s likely be due to a combination of genes and environmental factors, eg, diet and medicines.While it’s not possible to prevent all cases of anencephaly, it is possible to decrease the risk of having a baby with this condition.\nStudies have shown that taking folic acid supplements for at least 1 month before getting pregnant and for the first 3 months of pregnancy can reduce the risk of having a baby with anencephaly and [spina bifida](https://healthify.nz/health-a-z/s/spina-bifida).Read more about [folic acid in pregnancy.(external link)](https://healthify.nz/hauora-wellbeing/f/folic-acid-and-folate/ \"Open external link\")\nIf you have a family history of any NTD, your risk is higher and the dose of folic acid you take also needs to be higher to be effective (see below). \nUse of anti-epileptic drugs also increases the risk of anencephaly, so if you're taking these medicines see your healthcare provider or specialist **before** you plan to become pregnant.\n####  How is anencephaly diagnosed? \n",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.787411+00:00",
    "source": "healthify"
  }
}