{
  "url": "https://healthify.nz/health-a-z/a/abortion/",
  "title": "Abortion",
  "content": "Once you have the information you need, it is your decision to make. Learn more about[pregnancy options.](https://healthify.nz/hauora-wellbeing/p/pregnancy-options)\n####  Does it cost anything to have an abortion? \nMost abortion services and related counselling services are free in Aotearoa New Zealand to any pregnant person eligible for publicly funded healthcare. However, you may need to pay for an ultrasound scan. There are fees for abortion if you are not a New Zealand resident. Find out more about [non-resident abortion costs in New Zealand.(external link)](https://decide.org.nz/en/faqs/ \"Open external link\")\n####  When can abortions be carried out? \nA qualified healthcare provider can provide you with abortion services up to and including week 20 of your pregnancy.\nIf you are more than 20 weeks pregnant, a qualified healthcare provider may still provide abortion services, if they reasonably believe that the abortion is clinically appropriate in the circumstances (taking into account your physical and mental health, and overall wellbeing and the gestational age of the fetus). The practitioner must consult with another qualified healthcare provider before providing abortion services. There are a limited number of providers for late-gestation abortions, so it is likely you would need to travel to access this service. \n####  What are the different types of abortion? \nTwo different methods of abortion are used in Aotearoa New Zealand:\n  * **Medical abortion**\n  * **Surgical abortion**\n\n\nTalk to a healthcare provider as soon as you can – both procedures are more straightforward and involve less risk the earlier the abortion is completed. \n####  What is a medical abortion and how is it done? \nMedical abortion is a way to end a pregnancy by using medication. ",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:18.744080+00:00",
    "source": "healthify"
  }
}
