{
  "url": "https://healthify.nz/health-a-z/a/asthma-first-aid/",
  "title": "Asthma First Aid",
  "content": "# Asthma – first aid\n## What to do if someone's having an asthma attack\n### Key points about asthma first aid\n  * An asthma attack is an emergency and symptoms can get worse quickly – act fast.\n  * Anyone with asthma can have a severe asthma attack.\n  * Worsening asthma symptoms include wheeze, feeling short of breath, tightness in your chest and coughing.\n  * If you have an asthma action plan follow the instructions there.\n  * If you don't have an asthma action plan follow the instructions on this page.\n  * If your asthma attack doesn't get better with asthma first aid dial 111 and ask for an ambulance.\n\n\n![Young woman outdoors experiences pain in chest when coughing ](https://healthify.nz/assets/Health-A-Z/Pain/Pain-in-chest-when-coughing-canva-950x690.jpg)\nQR Code Print\n####  What is an asthma attack? \nAn asthma attack is when your airways swell and narrow, and make more mucus. You find it difficult to breathe, your chest can feel tight, and you might wheeze or cough. \n![Diagram of labelled respiratory system and normal and asthmatic airways](https://healthify.nz/assets/Health-A-Z/Respiratory/Asthma-diagram-Depositphotos-800x800__ResizedImageWzcwMCw3MDBd.png)\n_Image credit: Depositphotos_\n**Note:** The information on this page is for adults. See KidsHealth, NZ for information about [asthma attacks in children(external link)](https://www.kidshealth.org.nz/asthma-attacks-in-children \"Open external link\").\n####    \nAn asthma attack may be mild, moderate or severe\n  * Anyone with asthma can have a severe asthma attack. \n  * An asthma attack can take anything from a few minutes to a few days to develop.\n  * Symptoms may be mild or moderate and can quickly get worse so it's important to act fast.\n  * If you have an asthma action plan follow the instructions on there.\n\n\n####    \nMild asthma symptoms\nEarly signs that asthma may be getting worse can include feeling breathless, chest tightness, cough and mild wheeze especially morning and night or when you're exercising or excited.\n####    \nModerate asthma symptoms\nWhen asthma becomes more serious, your symptoms may include:\n  * worse cough or wheeze \n  * difficulty breathing\n  * difficulty talking, you can only talk in short sentences\n  * your reliever inhaler only works for a few hours.\n\n\n#### **  \nSevere symptoms – call 111 if:**\n  * **you're gasping for breath**\n  * **you can't speak a full sentence in 1 breath**\n  * **you're blue around the mouth**\n  * **you've used a reliever inhaler but it's not helping much.**\n\n\n####  Actions to take for an asthma attack (+VIDEO) \nIf you or someone near you is having an asthma attack, follow the ASTHMA acronym. Someone having an asthma attack may not be able to follow asthma first aid themselves – they are relying on you to help. \n#### A = Assess\nAssess whether the person's asthma attack is mild, moderate or severe.\nIf the person has **severe asthma** or is frightened, call an ambulance on 111.\n#### S = Sit\nSit the person upright and stay with them. Reassure them calmly.\n#### T = Treat (with a reliever inhaler)\nIt's important to carry your reliever inhaler with you at all times. If you're helping someone else you may need to help them find one.\n  * **Symbicort or DuoResp Spiromax:** Use 1 puff initially and repeat if needed, up to 12 puffs daily. These inhalers quickly reduce inflammation of your airways and help you to breathe more easily.\n  * **Ventolin or SalAir:** Always use a spacer with these inhalers. Inhale 1 puff through the spacer and take 6 breaths per puff. Use 1 puff initially and repeat if needed, up to 6 puffs. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:35.965483+00:00",
    "source": "healthify"
  }
}
