{
  "url": "https://healthify.nz/health-a-z/a/abuse-and-safety/",
  "title": "Abuse And Safety",
  "content": "[](https://healthify.nz/assets/Card-Images/power-and-control-wheel-by-nz-police__ResizedImageWzYwMCw0NDld.jpg)\n_Credit: NZ Police_\n####  What is family violence? \n#### Family violence is a crime\nIt is not a private matter. It is one of New Zealand’s most serious social issues. [Elder abuse](https://healthify.nz/health-a-z/a/abuse-elder) is also a significant concern.\n  * Between 33 and 39% of New Zealand women experience physical or sexual violence from an intimate partner in their lifetime.\n  * Family violence is one of the leading causes of injury and death to women.\n  * It also leads to short and long-term health problems such as mental illness, and problems with sexual and reproductive health. \n  * Children who live in a home where there is violence are significantly more at risk of being the victims of physical, sexual and psychological abuse and neglect than other children.\n\n\nFamily violence can be carried out by anyone you are in a domestic or close relationship with. They don't have to be living with you. It could be a:\n  * partner or ex-partner\n  * carer\n  * friend\n  * flatmate or family member.\n\n\n#### Family violence is never your fault\nIf you are a victim of family violence or in a relationship that makes you scared about your own or anyone else's safety, seek help as soon as possible. You have the right to be safe.  \n  \nIf you're unsure whether your relationship is abusive or not, you can take this[positive relationship quiz.(external link)](http://areyouok.org.nz/i-need-help/positive-relationship-quiz/ \"Open external link\")\nRead more about [family violence](https://healthify.nz/health-a-z/f/family-violence-overview) and where to get [support for family violence](https://healthify.nz/support/f/family-violence-support). \n####  Where to get immediate help if you are being abused \nIf you are in immediate danger, call the Police on 111. They will respond straight away.\n#### National helplines\n  * Are You OK: Phone**0800‑456‑450**\n  * Oranga Tamariki (Ministry for Children): For immediate concerns about the safety of children, when a child's behaviour is putting the safety of family members at risk, uncertainty about what to do next, or for advice phone **0508-326-459** (24 hours a day, 7 days a week).\n  * Shakti: Help for migrant and refugee women of Asian, African, and Middle Eastern origin who are victims of violence and abuse phone **0800‑742‑584**.\n  * Shine: Advocacy and refuges for victims of domestic abuse phone **0508-744-633** (9.00 am to 11.00 pm, 7 days).\n  * Women's Refuge: Provides education programmes, support services, information, and safe housing to women, young people and children experiencing abuse, crisis line phone **0800‑733‑843.**\n  * Victim's information: A government service that provides information about local support services and the justice system to anyone affected by crime, phone **0800‑650‑654.**\n  * Victim support: Emotional and practical support, information, referral to other support services, and advocacy for the rights of victims, phone **0800‑842‑846.**\n\n\n**Wellington region**\n  * Kōkiri Marae Māori Women's Refuge: A kaupapa-Māori support and advocacy service for wahine and tamariki living in the Hutt Valley phone **0800-733-843** (24 hours a day, 7 days a week).\n\n\n**For longer-term and ongoing protection**\n  * a [Police safety order(external link)(external link)](https://www.police.govt.nz/advice/family-violence/police-safety-orders \"Open external link\")\n  * a [protection order(external link)(external link)](https://www.police.govt.nz/advice/family-violence/protection-orders \"Open external link\")\n  * a [restraining order(external link)(external link)](https://www.justice.govt.nz/courts/civil/restraining-orders/ \"Open external link\")\n  * if children are involved you can also apply for an [urgent parenting order(external link)(external link)](https://www.justice.govt.nz/family/about/urgent-help/ \"Open external link\") (without notice). \n\n\n####  Where to get other support if you are being abused \n[Family violence – where to get help(external link)(external link)](https://www.justice.govt.nz/family/family-violence/get-help/ \"Open external link\") Ministry of Justice, NZ  \n[Victims information for people affected by sexual violence (English)(external link)(external link)](https://sexualviolence.victimsinfo.govt.nz/en/ \"Open external link\") Ministry of Justice, NZ  \n[Victims information for people affected by sexual violence (te reo Maori(external link)(external link)](https://sexualviolence.victimsinfo.govt.nz/mi/ \"Open external link\") Ministry of Justice, NZ  \n[Safe to talk national sexual harm helpline(external link)(external link)](http://www.safetotalk.nz/ \"Open external link\") free 24 hours a day, 7 days a week by calling 0800 044 334 or texting 4334. For people experiencing or carrying out sexual harm.  \n[Shine helpline(external link)(external link)](https://www.2shine.org.nz/get-help/helpline \"Open external link\") Call 0508 744 633 if you are experiencing violence or if you are worried about a friend, family member, child or anyone who might be living with abuse. Shine uses the [NZ Relay(external link)(external link)](https://www.nzrelay.co.nz/ \"Open external link\") service for people who are Deaf or hearing or speech impaired, and has access to an interpreting service if you need it. \n####  What do I do if I know someone is being abused? (+ APPS) \nIf you are a friend or acquaintance of a victim of family violence, you can help by listening and being supportive, ensuring the person and any children are safe and finding out what help is available in the community. ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:18.526604+00:00",
    "source": "healthify"
  }
}
