{
  "url": "https://healthify.nz/health-a-z/a/anaemia/",
  "title": "Anaemia",
  "content": "Anaemia is the result of:\n  * your body not having enough healthy red blood cells to carry the oxygen you need around your body, or\n  * your red blood cells not having enough haemoglobin in them.\n\n\nRed blood cells are made in the bone marrow inside your pelvis and sternum (breastbone). The red blood cells are released into your blood stream where they live for 100 to 120 days.\nThere are many different types of anaemia, each with its own cause. The most common types are iron deficiency anaemia and anaemia of chronic disease. \n#### Types\n| \n#### Description  \n---|---  \n**Iron deficiency anaemia**\n  * occurs when the body does not have enough iron to produce haemoglobin.\n\n|  Common in:\n  * people who do not get enough iron in their diet\n  * women with heavy periods\n  * people with certain conditions, eg, Crohn’s disease or coeliac disease.\n\n  \n**Pernicious anaemia**\n  * occurs if your body cannot make enough red blood cells because it cannot absorb enough vitamin B12 from food.\n\n| \n  * In your gut, vitamin B12 is absorbed by binding to a protein produced in the stomach called intrinsic factor.\n  * In people with pernicious anaemia, the body’s immune system attacks and destroys the cells that produce intrinsic factor in the stomach.\n  * If these cells are destroyed, enough vitamin B12 can't be absorbed from food.\n\n  \n**Aplastic anaemia**\n  * occurs if your body cannot make enough red blood cells, white blood cells and platelets.\n\n|  Occurs in conditions where there is damage to the bone marrow such as:\n  * if you have a disease of the bone marrow\n  * if you're undergoing chemotherapy or radiation.\n\n  \n**Haemolytic anaemia**\n  * This occurs when the body destroys red blood cells and cannot replace them at a fast enough rate.\n\n|  Haemolytic anaemia may:\n  * be hereditary (run in your whānau/family), eg, as in [sickle cell disease](https://healthify.nz/health-a-z/s/sickle-cell-disease \"Sickle cell disease\") or thalassaemia\n  * occur with diseases such as [lupus](https://healthify.nz/health-a-z/l/lupus), liver disease or malaria.\n\n  \n####  What causes anaemia? \nThe 3 main causes of anaemia are:\n  * not making enough healthy red blood cells\n  * your body breaking down red blood cells too quickly\n  * bleeding.\n\n\n####    \nNot making enough red blood cells\nYour body may not make enough red blood cells if:\n  * your diet is lacking in the nutrients needed (iron,[folic acid](https://healthify.nz/hauora-wellbeing/f/folic-acid-and-folate \"Folic acid\") and [vitamin B12](https://healthify.nz/hauora-wellbeing/v/vitamin-b12 \"Vitamin B12\"))\n  * your body isn't able to absorb these nutrients properly from your gut\n  * your bone marrow isn't working properly.\n\n\nExamples of this are:\n  * [Iron-deficiency](https://healthify.nz/health-a-z/i/iron-deficiency \"Iron deficiency\") from low iron intake or increased blood loss – this is one of the most common forms of anaemia.\n  * Vitamin B12 or B9 (commonly called[folate](https://healthify.nz/hauora-wellbeing/f/folic-acid-and-folate \"Folic acid and folate\")) deficiency. This causes the body to produce abnormally large red blood cells that cannot function properly.\n  * Gut diseases, eg, Crohn's disease, coeliac disease or pernicious anaemia can stop your body from absorbing these nutrients.\n  * Diseases of the bone marrow (eg, [leukaemia](https://healthify.nz/health-a-z/l/leukaemia)) stop it from making red blood cells.\n  * Medicines that affect your bone marrow (eg, chemotherapy for cancer).\n  * A long-term disease (eg, [kidney disease](https://healthify.nz/health-a-z/k/kidney-disease \"Kidney disease\"), heart failure or cancer) can keep your body from making enough red blood cells. This is called anaemia of chronic disease. and is the other most common cause.\n  * Your body may not produce enough red blood cells during pregnancy when extra red blood cells are needed for the growing baby. \n\n\n####    \nBreaking down red blood cells too quickly\nRed blood cells last about 3 to 4 months in your body. In some situations, the red blood cells are damaged or destroyed more quickly than normal.\nExamples are:\n  * haemolytic anaemia\n  * [sickle cell disease](https://healthify.nz/health-a-z/s/sickle-cell-disease)\n  * thalassemia\n  * medical treatments, eg, chemotherapy. \n  * Autoimmune diseases, eg, [rheumatoid arthritis](https://healthify.nz/health-a-z/r/rheumatoid-arthritis) or SLE ([lupus](https://healthify.nz/health-a-z/l/lupus))\n\n\n####    \nLosing too much blood\nThis is a common cause of anaemia. Situations where too much blood can be lost include:\n  * when women have [heavy bleeding(external link)](https://www.healthnavigator.org.nz/health-a-z/m/menorrhagia/ \"Open external link\") during their periods (this is the commonest cause among young women)\n  * stomach [ulcers(external link)](https://www.healthnavigator.org.nz/health-a-z/p/peptic-ulcer/ \"Open external link\") or other problems such as bowel cancer that cause bleeding inside the gut\n  * giving birth\n  * blood loss from surgery or an injury.\n\n\n####  What are the symptoms of anaemia? \nThe most common way anaemia is found in Aotearoa New Zealand is with a blood test. Most anaemia is mild and has no symptoms. If you have moderate or severe anaemia you might have symptoms of:\n  * feeling tired or having little energy (lethargy)\n  * feeling faint and dizzy\n  * looking pale, having pale skin\n  * being short of breath or feeling breathless\n  * headaches\n  * faster heart rate or a thumping heart (palpitations)\n  * cold hands or feet\n  * lack of concentration.\n\n\nSee your healthcare provider if you think you have anaemia.\n**As some serious conditions can cause anaemia, see your doctor urgently if you have any of the following:**  \n---  \n  * weight loss, fevers, bone pain, and night sweats\n  * unexplained changes in your bowel habits.\n\n  \n####  How is anaemia diagnosed? \nYour healthcare provider can help diagnose anaemia. ",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:28.568610+00:00",
    "source": "healthify"
  }
}
