{
  "url": "https://healthify.nz/health-a-z/a/avoidant-restrictive-food-intake-disorder-arfid/",
  "title": "Avoidant Restrictive Food Intake Disorder Arfid",
  "content": "[Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Avoidant restrictive food intake disorder (ARFID)\n### Key points about avoidant restrictive food intake disorder (ARFID)\n  * ARFID is an eating disorder and a serious mental health condition.\n  * Tamariki with ARFID either strongly dislike or avoid food, or restrict their food intake for different reasons.\n  * Having ARFID can lead to significant weight loss and health concerns when a child isn’t meeting their nutritional or energy needs.\n  * Unlike with other eating disorders, tamariki with ARFID don't limit their food intake because of concerns with their body weight or shape.\n  * It's important to recognise eating disorders as early as possible and get help for your child straight away.\n  * The content on this page comes from [KidsHealth(external link)](https://www.kidshealth.org.nz/avoidant-restrictive-food-intake-disorder-arfid \"Open external link\").\n\n\n![Reluctant eater ](https://healthify.nz/assets/Healthy-Living/Food-and-drink/Reluctant-eater-canva-950x690.jpg)\n####  What is ARFID? \nAvoidant restrictive food intake disorder (ARFID) involves ongoing feeding or eating issues that can cause tamariki to avoid food. It's more than just ‘picky eating’, which is common among tamariki. Tamariki with ARFID eat only a small range or amount of food. They often have an extreme dislike of certain foods or are generally not interested in food or eating. \nTamariki with ARFID might restrict their food intake for a few different reasons. ARFID can look very different from 1 child to another. There can be more than 1 reason for avoiding food.\n#### Sensory aversion\nSome tamariki are very sensitive to how food feels, smells, tastes or looks. ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:39.126097+00:00",
    "source": "healthify"
  }
}