{
  "url": "https://healthify.nz/health-a-z/a/arrhythmias/",
  "title": "Arrhythmias",
  "content": "* Dizziness, faintness or collapse.\n  * Shortness of breath.\n  * Tiredness.\n  * Chest pain.\n\n\n####  How is an arrhythmia diagnosed? \nYour healthcare provider will ask questions about your symptoms and examine your chest and pulses. They will arrange an [ECG](https://healthify.nz/health-a-z/e/electrocardiograph-ecg), an electrical reading of your heart. Your GP or nurse practitioner will be able to diagnose and help you with most arrhythmias.\nFor some types, or if it's not clear what's happening, you might need to be referred to a cardiologist (heart specialist.) They can arrange a heart monitor which stays on your chest for at least 24 hours to find rhythm problems that come and go. \nYou may need other tests depending on the possible cause, eg, blood tests, echocardiogram or an electrophysiology study. Read more about [heart tests](https://healthify.nz/health-a-z/h/heart-disease-tests).\n####  What are the types or arrhythmia? \n#### Ectopic beats\nThese are extra heartbeats. The electrical signal comes from somewhere other than the sinoatrial node. We all get them and they are nearly always harmless. You don't normally notice them. You may notice them as a skipped beat or a stronger than usual beat in your chest if you're lying still in bed. Caffeine in tea or coffee, and alcohol may cause you to have more ectopic beats than usual.\n#### Sinus tachycardia\nHere, the heart rate from the sinoatrial node speeds up, eg, when you're exercising or have a fever. The rhythm is regular.\n#### Supraventricular tachycardia (SVT)\nA group of heart muscle cells or part of your electrical system in the top part of your heart (atria) start sending electrical signals faster than your sinoatrial node does. This makes your ventricles pump faster too, between 140 and 200 beats per minute (bpm). It sometimes lasts for a few minutes, it sometimes lasts for hours. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:33.400168+00:00",
    "source": "healthify"
  }
}
