{
  "url": "https://healthify.nz/health-a-z/a/allergies-food/",
  "title": "Allergies Food",
  "content": "Most allergic reactions to food are due to a small number of foods (see the [list of foods most likely to cause an allergy](https://healthify.nz/health-a-z/f/food-allergies#common-allergenic-foods) below).\nWhen you have a food allergy, your body triggers an allergic reaction every time you eat or drink anything that contains the allergen. Even a very tiny amount can cause a reaction.\nReactions usually happen quickly – often within minutes, and almost always within a couple of hours. Symptoms of an allergic reaction can range from mild to severe, including [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis). You can find [a list of signs and symptoms](https://healthify.nz/health-a-z/f/food-allergies#food-allergy-symptoms) below.\n####  Food intolerance \nFood allergy and food intolerance are commonly confused as the symptoms can be similar. A food intolerance is an unpleasant reaction to a food, but it doesn't involve your immune system. \nFood intolerances can have various causes. Symptoms, such as bloating, headaches and tummy pain, may happen within hours to days after a food is eaten. A food intolerance is not life-threatening and doesn't include immediate, severe reactions such as [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis).\nThere are lots of expensive intolerance tests available (eg, hair test) but none of these are valid and should be avoided. Read more about the difference between [food allergy and intolerance](https://healthify.nz/health-a-z/f/food-allergy-or-intolerance).\n####  Who is affected by food allergy? \nA food allergy can develop at any age, but it's most common in tamariki under 5 years of age. About 1 in 10 infants have a food allergy by 12 months of age. Read more about [reducing food allergies in infants](https://healthify.nz/hauora-wellbeing/r/reducing-food-allergies-in-infants).\nSome people will grow out of their food allergies (mainly allergies to milk or eggs) – it's estimated that 6–8% of school age children and 2–4% of adults have a food allergy. \nYou have a slightly higher chance of getting a food allergy if you or a close family member have any [allergies](https://healthify.nz/health-a-z/a/allergies), [asthma](https://healthify.nz/health-a-z/a/asthma-adults) or [eczema](https://healthify.nz/health-a-z/e/eczema).\nDeveloping a food allergy as an adult isn't common. Food intolerance is much more common in adults and can have a variety of causes. Read more about the difference between [food allergy and intolerance](https://healthify.nz/health-a-z/f/food-allergy-or-intolerance).\n####    \nDo food allergies last for life?\nMost children who are allergic to cow's milk, soy, wheat or egg will ‘outgrow’ their food allergy. About 80% of children eventually tolerate these foods by 5 years of age.\n",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.501194+00:00",
    "source": "healthify"
  }
}
