{
  "url": "https://healthify.nz/health-a-z/a/allergies/",
  "title": "Allergies",
  "content": "It requires immediate life-saving medicine such as adrenaline. Read more about[anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis).\n\n\n####  How are allergies diagnosed? \nIt's important to talk to your healthcare provider if you think you or your child may have an allergy to something. There are many causes of allergies and some symptoms may be due to other conditions.\nYour healthcare provider will ask you or your child about allergic symptoms such as a rash or an upset stomach. Other questions may include the following:\n  * How often do your symptoms occur?\n  * Is there anything that will trigger your symptoms?\n  * How soon do your symptoms occur after being exposed to a particular allergen?\n  * Are there any family members who also have allergies?\n  * Have you been exposed to new foods, pets or medicines recently?\n\n\nWhen symptoms appear soon after you have been exposed to a particular allergen, it is easy to identify which allergen is causing your reaction. However, if the cause is unknown, other diagnostic tests may be needed. This might include a skin prick test or a blood test to test for the presence of the antibody (IgE) that causes an allergic reaction. Your healthcare provider may also refer you or your child to a paediatric clinic or allergy specialist for further tests if the cause is still unclear.\n####    \nSkin prick tests\n  * A needle is pricked into your skin through a drop of the suspected allergen, usually on the skin of your inner forearm or back.\n  * The size of the weal on your skin indicates how strongly you are allergic to a particular allergen.\n  * As many as 30 allergens can be tested at the same time to work out the particular substances you are allergic to.\n\n\n![Skin prick test for allergen reaction](https://healthify.nz/assets/Health-A-Z/Skin-topics/Skin-prick-test-for-allergens-Bruce-Blaus-Wikimedia-Commons-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Bruce Blaus via[Wikimedia Commons(external link)](https://commons.wikimedia.org/wiki/File:Skin_Prick_Test.png \"Open external link\")_\n####  How are allergies treated? \nThe most important part of managing allergies is to avoid allergens, if possible. Allergic symptoms also have specific treatments, including medicines and self-help measures. For some allergic conditions such as allergic rhinosinusitis, allergen immunotherapy (AIT) can also help.\n#### Medicines\nMedicines are used to treat allergic symptoms, including:\n  * antihistamines\n  * steroid nasal inhalers or decongestant nasal spray\n  * medicated or non-medicated eye drops\n  * emollient or corticosteroid creams\n  * steroid tablets\n  * adrenaline – usually in an autoinjector called EpiPen.\n\n\n  \n**Antihistamines**\n  * Antihistamines are medicines that reduce or block histamines, the substance released by your body in response to allergens.\n  * They're most commonly used to treat allergic symptoms.\n  * Antihistamines are usually well tolerated and work well.\n  * Antihistamines can be bought from pharmacies or prescribed by your doctor or nurse prescriber.\n  * Ask your pharmacist/chemist or healthcare provider if you don't know which one you need.\n  * Read more about[antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines).\n\n\n  \n**Steroid nasal inhalers or decongestant nasal sprays**\n  * These are used to relieve symptoms of [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\").\n  * A prescription may be needed for stronger doses of steroids.\n  * Decongestant nasal sprays can relieve stuffiness or congestion of your nostrils and can be bought over the counter. However, these medicines are not suitable for long-term use. Ask your pharmacist or healthcare provider if you don't know if they're suitable for you.\n  * Read more about[steroid nasal sprays](https://healthify.nz/medicines-a-z/s/steroid-nasal-sprays)[decongestant nasal sprays](https://healthify.nz/medicines-a-z/d/decongestants).\n\n\n  \n**Medicated or non-medicated eye drops**\n  * Some eye drops may be helpful in some allergic conditions such as [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\").\n  * These eye drops can be lubricating eye drops or may contain medications\n  * Ask your healthcare provider or pharmacist about suitable eye drops for you.\n  * Read more about[eye drops](https://healthify.nz/medicines-a-z/e/eye-drops).\n\n\n  \n**Emollients and corticosteroid creams**\n  * Emollients or corticosteroid creams can help improve allergic symptoms or conditions that involve your skin, such as [hives](https://healthify.nz/health-a-z/h/hives \"Hives\") or [eczema](https://healthify.nz/health-a-z/e/eczema \"Eczema\").\n  * Read more about[emollients](https://healthify.nz/medicines-a-z/e/emollients-moisturisers)[steroid creams](https://healthify.nz/medicines-a-z/s/steroid-creams-and-ointments).\n\n\n**Steroid tablets**\n  * Steroid tablets can also be used to treat allergic symptoms such as hives and to reduce inflammation.\n  * A prescription from your healthcare provider is needed.\n  * Read more about[steroid tablets](https://healthify.nz/medicines-a-z/s/steroid-tablets).\n\n\n  \n**Adrenaline**\n  * Adrenaline is used in an emergency to treat [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\").\n  * It is usually in the form of an autoinjector, called an EpiPen.\n  * EpiPens are easy to use and can be given by non-medical people.\n  * If you have been prescribed an EpiPen, your healthcare provider or pharmacist can teach you how to use it.\n  * Read more about[EpiPens](https://healthify.nz/medicines-a-z/e/epipen).\n\n\n####    \nAllergen immunotherapy (AIT)\nWhen medicines don’t provide enough relief, an option is immunotherapy. Immunotherapy may also be an option if your symptoms are severe and the allergen is difficult to avoid, such as with allergic rhinosinusitis or [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\"). \nThe aim of immunotherapy is to make you develop tolerance to a particular allergen. It works by changing the way your immune system reacts to allergens. Your doctor will give you an allergen you are allergic to, either under your tongue, through your nose or by an injection. This will be repeated over a period of 3 to 5 years. \nImmunotherapy isn't suitable for everyone. Ask your healthcare provider or an allergy specialist about it. \n",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.120341+00:00",
    "source": "healthify"
  }
}
