{
  "url": "https://healthify.nz/health-a-z/a/asthma-children/",
  "title": "Asthma Children",
  "content": "Outdoor environmental pollution may make asthma symptoms worse but it doesn't actually cause asthma. Experts continue to study the reasons for the increase in asthma. \n####  What causes an asthma attack? \nTamariki and rangatahi with asthma have airways that are sensitive and react to certain triggers. Some children have asthma all year round. Others may only have it in certain seasons or situations. \nThings that can cause an attack include the following:\n  * **Infections:** Viruses like colds and the flu can cause some children to have worse asthma symptoms which may lead to an asthma attack.\n  * **Allergies:** If your child is allergic to things like pollens, grass, dust or pet fur, this can worsen their asthma. \n  * **Irritants:** Irritants may trigger asthma attacks. Examples or irritants are air pollution, car exhaust, vapours and mouldy environments.\n  * **Tobacco smoke:** Tobacco smoke can trigger asthma attacks and can make your child's asthma symptoms worse. All tamariki need a smoke-free environment, wherever they happen to be.\n  * **Exercise:** Exercise and physical activity are a big part of helping tamariki stay healthy and fit. Exercise is also an important part of asthma management. But, sometimes exercise or activity can trigger an episode of asthma.\n  * **Changes in the weather:** Some children may find a change in the weather or certain conditions, like cold or damp weather, can make their asthma worse.\n\n\n####  How can I prevent my child from having asthma attacks? \n#### Medicine\nSome tamariki need to be on a preventer medicine. \nSee our page on the [different types of asthma medicines](https://healthify.nz/medicines-a-z/a/asthma-reliever-medicine) and when to use them.\nOther things that can help your child's asthma include:\n  * living in a smoke-free environment at all times\n  * keeping your house warm and dry\n  * where possible, avoiding things that trigger their asthma.\n\n\n#### Be smoke-free\nMake sure your child's environment is [smoke-free](https://healthify.nz/hauora-wellbeing/s/smokefree-for-your-children), wherever they happen to be. Asthma increases in tamariki whose parents smoke. Tobacco smoke also triggers asthma attacks and makes a child's asthma more severe. Many environmental factors contribute to asthma. Cigarette smoke is one that you can avoid.\nIf you want to give up smoking:\n  * call the free Quitline on 0800 778 778 or text 4006\n  * check out the [Quitline | Me Mutu website(external link)](https://quit.org.nz/ \"Open external link\")\n  * ask your healthcare provider for support.\n\n\n#### Keep your house warm and dry\nCheck out our useful tips for [keeping your home warm and dry](https://healthify.nz/hauora-wellbeing/w/winter-how-to-keep-your-home-warm-in-winter).\n#### Keep a symptom diary and a record of possible triggers\nAsthma symptoms and triggers may differ from child to child and from time to time. ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:35.211425+00:00",
    "source": "healthify"
  }
}
