{
  "url": "https://healthify.nz/health-a-z/a/asthma-pregnancy/",
  "title": "Asthma Pregnancy",
  "content": "Your action plan describes the medicines you need to take and when to take them. It also explains how to adjust your treatment to meet your needs, such as if your asthma is getting worse, or during asthma attacks.\nAlso, make sure that asthma is included in your [birth plan](https://healthify.nz/hauora-wellbeing/p/pregnancy-birth-plans) so that everyone supporting you during your pregnancy and labour knows you have asthma and what to do if you have symptoms.\n####    \nExercise regularly\nYou can continue to exercise normally during your pregnancy. If you find that exercise makes your asthma worse, try using your reliever or combination inhaler before exercise.\nTalk to your healthcare provider about how you should manage your symptoms.\n####    \nAvoid smoking\nDon't smoke or vape during your pregnancy and avoid second hand smoke. This can make your asthma worse.\nSmoking during pregnancy increases the chance of [sudden unexplained death of an infant (SUDI)](https://healthify.nz/health-a-z/s/sudi \"SUDI\") and of [chest infections](https://healthify.nz/health-a-z/c/chest-infections \"Chest infections\"), [asthma](https://healthify.nz/health-a-z/a/asthma-children \"Asthma – children\") and [middle-ear disease](https://healthify.nz/health-a-z/e/ear-infection-middle-ear \"Ear infection \\(middle ear\\)\") in babies.\nRead more about [smoking and pregnancy](https://healthify.nz/hauora-wellbeing/s/smoking-and-pregnancy), and [how to quit.](https://healthify.nz/hauora-wellbeing/s/smoking-why-quit)\n####    \nAvoid allergic triggers\nAs much as possible try to avoid or control the things that make your asthma worse (called triggers), such as animal fur, pollen, mould and dust.\n####    \nControl conditions affecting your nose\nConditions such as [sinusitis](https://healthify.nz/health-a-z/s/sinusitis-acute \"Sinusitis – acute\") or [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\") can make asthma worse. The common symptoms are sneezing, a blocked or runny nose, an itchy nose, mouth or inner ear, and [headaches](https://healthify.nz/health-a-z/h/headache \"Headache\").\nTalk to your healthcare provider about how to best manage these symptoms if they bother you. \n####    \nControl gastro-oesophageal reflux disease (GORD) symptoms\n[GORD](https://healthify.nz/health-a-z/g/gastro-oesophageal-reflux \"Gastro-oesophageal reflux\") causes acid reflux and heartburn, which can make asthma symptoms worse. If you develop GORD, talk to your healthcare provider about how to best manage your symptoms.   \n  \nSome suggestions to help reduce GORD symptoms include to:\n  * raise the head of your bed with extra pillows\n  * eat smaller meals\n  * wait at least 3 hours after eating before lying down\n  * avoid foods that seem to cause heartburn.\n\n\n####    \nGet the flu, pertussis and COVID-19 vaccine\nHaving the [flu (influenza)](https://healthify.nz/health-a-z/i/influenza) can make your asthma worse. The flu vaccine gives you extra protection against the flu. ",
  "chunkIndex": 10,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:36.173056+00:00",
    "source": "healthify"
  }
}
