{
  "url": "https://healthify.nz/health-a-z/a/abuse-elder/",
  "title": "Abuse Elder",
  "content": "It can be psychological, physical, financial, sexual or institutional. It can also be neglect.\nIt may happen just once but may happen again and again. \n  \n  \n\n####  Who does elder abuse affect? \nElder abuse is a worldwide problem. Up to 10% of older adults in Aotearoa New Zealand (1 in 10) will experience some form of elder abuse.   \n  \nElder abuse can happen:\n  * in every religious, cultural, ethnic and income group\n  * in any setting, rural or urban\n  * for older people living on their own or living with others\n  * in private homes or within a residential care or health care setting\n  * to people who are frail and vulnerable and depend on others to meet their needs.\n\n\nSadly, much abuse isn't reported or is only reported after it has got to the point of causing real harm to an older person. \n####  What can lead to elder abuse? \nElder abuse can happen for many reasons. \n####    \nCaregiver factors \nThese can include:\n  * difficult circumstances, such as lack of money, especially if they depend on the older person financially\n  * mental health or substance abuse problems\n  * too much responsibility and not enough support\n  * a difficult relationship with the person being cared for in the past.\n\n\n#### The older person’s situation\nThis may contribute too, for example:\n  * Needing increasing amounts of care to a level where the carer doesn’t have the understanding or ability to provide it, especially personal care like showering and toileting.\n  * Communication problems (eg, hearing or vision loss) make care harder or more frustrating.\n  * An illness or dementia that can cause unpredictable behaviour, wandering, aggression, or major changes in personality.  \nAlcohol or other substance abuse.\n  * Having left school at an early age.\n  * Having few family members or friends in their life.\n\n\n#### In residential care or hospitals\nAbuse can happen when staff and organisations are under stress or poorly managed. Some examples are listed below. \n  * When staff members are working alone, or isolated from other parts of the hospital or community.\n  * When staff members are under pressure, or are poorly supervised or supported, due to: \n    * lack of training\n    * heavy workload, or burnout\n    * high turnover\n    * poor environment or working conditions.\n  * If staff have personal problems such as mental health or substance abuse problems.\n  * If staff (or the organisation) has ways of working that don’t meet the social and cultural needs of residents.\n\n\n####  What are the types of elder abuse? \nThere are 5 common categories of elder abuse, plus neglect.\n####    \nPhysical abuse – acts of violence\nThis can include:\n  * physical punishment, hitting, pushing, shaking, slapping, pinching, choking or burning \n  * force-feeding\n  * over-medication\n  * inappropriate use of physical restraints or limiting physical freedom.\n\n\n####    \nPsychological abuse – behaviour causing fear, stress or emotional pain\nThis can include:\n  * verbal abuse, threats, belittling\n  * harassment\n  * holding back affection\n  * taking away choices, decision-making power or isolating people.\n\n\n####    \nFinancial abuse – inappropriate use of money or property\nThis can include:\n  * forging somebody’s signature\n  * forcing them to sign over money or belongings, or pressuring them to sign a document like a will or house sale and purchase agreement\n  * use of their home without helping out with costs\n  * stealing money or things \n  * misusing a power of attorney\n  * scams – creating a relationship to exploit their assets.\n\n\n#### Sexual abuse – force or threats related to sexual behaviour\nThis can include:\n  * forcing people into sexual acts they don’t, or can’t, agree to (including with people of limited mental capacity)\n  * unwanted touching\n  * forced nudity or taking explicit photos.\n\n\n####    \n  \nInstitutional abuse – when a person’s rights aren’t respected by an organisation\nThis can include:\n  * withholding of care such as continence products or taking people to the toilet\n  * lack of respect for a person’s culture or religious customs\n  * inflexible routines such as very early bedtimes or having to be up and ready at a strict time. \n\n\n####    \nNeglect – not doing what’s needed\nThis can include:\n  * not providing for the person’s essential needs, such as food, clothing, warmth, health needs or medicines.\n  * lack of social contact or support\n  * not paying necessary bills such as rest home costs or medical bills.\n\n\n",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:18.334825+00:00",
    "source": "healthify"
  }
}
