{
  "url": "https://healthify.nz/health-a-z/a/animal-and-human-bites/",
  "title": "Animal And Human Bites",
  "content": "* Make sure you remove any hair, dirt or anything else in the wound.\n  * If it is not already bleeding freely, squeeze it gently to encourage the blood to bring out any dirt from inside the bite.\n  * If it is bleeding a lot, wash it then put a clean pad or sterile dressing over it and apply pressure. Once the bleeding stops, dry the wound and cover it with a clean dressing or plaster.\n  * Watch out for fainting – animal bites can be upsetting.\n  * If the bite has severed (removed) a body part like a finger or an ear, wash it with tap water, wrap it in a clean tissue, and store it in a plastic bag surrounded by ice so it can be transported to hospital for reattachment.\n  * If the bite has caused a very serious life or limb-threatening injury, call 111 for emergency help.\n\n\nIf the bite has broken the skin, you should seek immediate medical attention after cleaning the wound.\n####  What will the doctor do? \nDepending on the severity of the bite a number of things might happen. Your doctor may:\n  * Clean up loose or damaged skin around the wound.\n  * Arrange for a blood test to check for infection.\n  * Prescribe antibiotics to treat an infection.\n  * Recommend a tetanus injection.\n  * Close the wound with stitches.\n  * Send you for an x-ray to check for bone damage or a foreign body in the wound, eg, a tooth.\n  * Refer you to a specialist if tendon or nerve damage is suspected\n  * Treat you if you have been bitten by a person with hepatitis or HIV to stop you getting infected.\n  * Give you advice on how to keep the wound clean and help it to heal. Read more about[what you can do to help a wound heal.](https://healthify.nz/health-a-z/w/wound-healing \"Wound healing  – stages, barriers and self-care\")\n\n\n####  Recovering from a bite wound \nThe time it takes for wounds to heal depends on the extent of the damage and your overall state of health. If the bite is infected, the infection will usually heal in 7–10 days with treatment. A deep bite may cause scarring and it might damage nearby nerves.\nFollow your healthcare provider's instructions for care of the wound.**Watch out for signs of infection.  \n",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.997007+00:00",
    "source": "healthify"
  }
}