{
  "url": "https://healthify.nz/health-a-z/a/agoraphobia/",
  "title": "Agoraphobia",
  "content": "####  What are the symptoms of agoraphobia? \nYour symptoms may be mild or severe. They can affect your body (physical), your mind (cognitive) and your behaviour.\n**Physical symptoms** are are similar to the symptoms of a [panic attack](https://healthify.nz/health-a-z/p/panic-disorder \"Panic disorder\"), such as:\n  * breathing quickly and taking shallow breaths\n  * your heart beating fast\n  * feeling sick in your stomach\n  * breaking out in a sweat\n  * pain in your chest\n  * feeling faint or dizzy.\n\n\n**Cognitive symptoms** are thoughts that bad outcomes will happen (eg, having a panic attack) that would:\n  * make you look stupid\n  * make you feel embarrassed\n  * threaten your life by your heart stopping or you not being able to breathe\n  * mean you couldn’t escape without help from someone.\n\n\nYou may also have **other fears** , such as:\n  * not being able to cope without help\n  * being left alone at home\n  * a general feeling of anxiety or dread.\n\n\nThese symptoms can affect your behaviour so that you do things like:\n  * avoid situations that could lead to panic attacks, such as crowded places, public transport or queues\n  * become unable to leave the house for long periods of time\n  * need to be with someone you trust when you go out\n  * avoid being far away from home.\n\n\n####  How is agoraphobia diagnosed? \nIt’s important to contact your healthcare provider if you think you have the symptoms of agoraphobia. If you can’t manage to get to your healthcare provider, arrange to have a phone or telehealth consultation. Your healthcare provider will ask you to describe your symptoms, how often they occur and in what situations. Tell them as much as possible about what you’re feeling and thinking and how that limits what you do. They may do a physical check up to make sure your symptoms don’t have a physical cause.\n####  How is agoraphobia treated? (+ APPS) \nThings that can make a difference include:\n  * learning about agoraphobia and the self-care techniques you can use to manage it (see below)\n  * psychological therapy\n  * medicine.\n\n\nFor most people, a combination of these will work best.\n#### Psychological therapy\nThere are trained professionals who know about agoraphobia and how to help someone who is affected by it. They can provide you with support and help for working through any distressing thoughts and feelings you have. They can also support you to make positive changes in your life. For some people, it might be helpful to understand why your agoraphobia developed, and this may involve processing earlier trauma. For others this isn’t important or useful and the key is to focus on changing their thinking and behaviour.\n[Cognitive-behavioural therapy (CBT)](https://healthify.nz/health-a-z/c/cognitive-behavioural-therapy), a psychological therapy that largely focuses on overcoming unhelpful beliefs, has been shown to work well with agoraphobia. Sometimes, therapy will also involve desensitisation which is a gradual exposure to your fear of situations or places that would be difficult to get away from or get help in. This can be a very effective step in getting over your phobia. Don’t worry though – this only happens when you are ready and at a pace that is right for you.\nAsk your healthcare provider for a referral or you can [find a counsellor, therapist or psychologist(external link)](https://mentalhealth.org.nz/help/accessing-mental-health-services \"Open external link\") yourself. If you can’t get out to see a counsellor or therapist, some people offer phone counselling. Phone Anxiety NZ 0800 ANXIETY (0800 269 4389) for a recommendation.\n#### Medicines\nMedicine such as a selective serotonin reuptake inhibitor (SSRI) is usually recommended. Sometimes benzodiazepines may be used together with relaxation techniques and psychological therapy, however it’s important to develop techniques to reduce anxiety, rather than relying on a medicine to make you feel relaxed. The choice of medicine will depend on your preference, response to previous medicines and consideration of possible side effects.\nSelective serotonin reuptake inhibitors (SSRIs) are a type of antidepressant that have been found to be effective in treating mood disorders (eg, anxiety, panic attacks and obsessional thoughts). An SSRI called sertraline is a commonly used medicine for people with agoraphobia. Read more about [sertraline](https://healthify.nz/medicines-a-z/s/sertraline).\nBenzodiazepines have a calming, relaxing effect and a short course may be prescribed for severe flare-ups of panic-related symptoms. Benzodiazepines must be used for a short time only, as they are very addictive medicines. Ongoing use for longer than 2 to 4 weeks is not recommended. Read more about [benzodiazepines](https://healthify.nz/medicines-a-z/b/benzodiazepines).\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [Mental health and wellbeing apps.",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:22.717348+00:00",
    "source": "healthify"
  }
}
