{
  "url": "https://healthify.nz/health-a-z/a/aids-hiv/",
  "title": "Aids Hiv",
  "content": "It can also be passed on from mother to baby during pregnancy and delivery.   \n  \nYou can't become infected through ordinary day-to-day contact (eg, kissing, hugging, shaking hands) or from sharing personal objects, food or water. \n####  Who is at risk of HIV? \n#### Behaviours and conditions that put you at greater risk of contracting HIV\n  * Having unprotected anal or vaginal sex.\n  * Having another sexually transmitted infection (STI) such as syphilis, herpes, chlamydia, gonorrhoea or [bacterial vaginosis](https://healthify.nz/health-a-z/b/bacterial-vaginosis \"Bacterial vaginosis\").\n  * Sharing contaminated needles, syringes and other injecting equipment and drug solutions when injecting drugs.\n  * Receiving unsafe injections, blood transfusions and tissue transplantation, and medical procedures that involve unsterile (dirty) cutting or piercing.\n  * Experiencing accidental needle-stick injuries, a risk particularly for healthcare workers.\n\n\nWhile anyone can acquire HIV, men who have sex with men, and their sexual partners, are the most affected group in Aotearoa New Zealand. Read more about [HIV in Aotearoa.(external link)](https://www.burnettfoundation.org.nz/learn/hiv/hiv-in-aotearoa/ \"Open external link\")\n####  What are the stages of HIV? \nIf you get HIV and don’t get treatment, you usually progress through 3 stages of disease. Medicine to treat HIV, known as [antiretroviral therapy (ART)](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy), helps you at all stages of the disease if you take it as prescribed. It can slow or prevent progression of HIV from one stage to the next.   \n  \nIf you take HIV medicine as prescribed and get to and keep an undetectable viral load, you have zero risk of passing on HIV to an HIV-negative partner through sex.\n####    \nStage 1: Acute HIV infection\nWithin 2 to 4 weeks after infection with HIV, you may experience a flu-like illness, which may last for a few weeks. This is your body’s natural response to infection.   \n  \n",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:23.427849+00:00",
    "source": "healthify"
  }
}