{
  "url": "https://healthify.nz/health-a-z/a/angioplasty/",
  "title": "Angioplasty",
  "content": "####    \nWhen is it done?\nAngioplasty is done if the blood vessels to your heart (coronary arteries) are blocked or narrowed from a build-up of cholesterol and other substances (called plaque). This condition is known as [atherosclerosis](https://healthify.nz/health-a-z/a/atherosclerosis) which can cause [coronary artery disease](https://healthify.nz/health-a-z/c/coronary-artery-disease).\nThe main symptoms of the blockage or narrowing are chest pain ([angina](https://healthify.nz/health-a-z/a/angina)) or shortness of breath. While angina can often be treated with medicines, a coronary angioplasty may be needed in severe cases where medicines aren't enough. After an angioplasty, many people find their symptoms get better and they're able to do more than they could before the procedure.\nAngioplasty is also done as an emergency treatment after a heart attack, when blood flow to a section of heart muscle becomes blocked.\nAngioplasty can increase your chances of surviving more than clot-busting medication (thrombolysis).\n####  What happens in an angioplasty (+ VIDEO) \nCoronary angioplasty is done by an interventional cardiologist (heart doctor) in the cardiac catheterisation laboratory of a hospital. A coronary angioplasty is performed using local anaesthetic, which means you'll be awake during the procedure. You will be given sedating medicines to make you sleepy and relaxed.\n  * The start of the procedure is the same as for a [coronary angiogram](https://healthify.nz/health-a-z/c/coronary-angiography).\n  * A catheter (which is a fine, flexible hollow tube), will be passed into an artery in either your groin or arm. A wire with a small, inflatable balloon at its tip is passed up the catheter. A fine wire mesh tube called a stent sits on the outside of the balloon.\n  * Your doctor will then use X-ray screening to direct the wire into a coronary artery until its tip reaches a narrow or blocked section. The balloon is then gently inflated.\n  * The stent expands with the balloon. As the balloon is inflated, it opens the stent against the artery walls.\n  * The balloon is deflated and removed.\n  * The stent stays in the artery to flatten the plaque against the artery wall, opening the artery to allow blood to flow more easily.\n  * During this time you may experience mild chest pain as the blood supply to the heart muscle is temporarily interrupted. It's important to let your doctor know if this happens.\n\n\nStents can be bare metal stents or drug eluting stents, which are coated in medicines to stop the artery blocking again. Your cardiologist will discuss with you which type of stent is the best for you.\nSometimes no stent is used and the balloon alone is used to press on the plaque and open the artery. This is called balloon angioplasty.\nThe image shows a catheter, balloon and stent placed into a coronary artery. \n![Angioplasty image showing artery stent, catheter and balloon](https://healthify.nz/assets/Health-A-Z/Cardiac/Angioplasty-image-showing-arter-stent-catheter-guide-wire-and-balloon-Bruce-Blaus-665x443__ResizedImageWzYwMCw0MDBd.jpg)   \n_Image credit:[Blausen Medical Communications, Inc.(external link)(external link)](https://en.wikipedia.org/wiki/Blausen_medical \"en:Blausen medical\")_\n#### Video: Heart stents – what you need to know\nThis video provides lots of information about angioplasty and coronary stents. It may take a few moments to load.  \n  \n\n(Heart Matters, Australia, 2021)\nA [shorter video on coronary angioplasty(external link)](https://www.youtube.com/watch?v=j9VY6FSIr64 \"Open external link\") can be watched on YouTube. \n####  How to prepare for angioplasty \nThere will be a routine examination and some tests before the procedure, eg, blood tests and an [electrocardiogram](https://healthify.nz/health-a-z/e/electrocardiograph-ecg) (ECG). A healthcare provider will explain the procedure and answer any questions you may have. \nIf you're are taking medicines (especially [dabigatran](https://healthify.nz/medicines-a-z/d/dabigatran), [rivaroxaban](https://healthify.nz/medicines-a-z/r/rivaroxaban) or [warfarin](https://healthify.nz/medicines-a-z/w/warfarin)), your healthcare provider will advise you on whether to continue or stop taking it. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.545587+00:00",
    "source": "healthify"
  }
}