{
  "url": "https://healthify.nz/health-a-z/a/advance-care-planning/",
  "title": "Advance Care Planning",
  "content": "* Who you would want to be involved in decision about your health if you were too unwell to be part of the discussion.\n  * Where you would like to spend your last days.\n\n\nHere are some [tools to help you think about advance care planning(external link)](https://www.myacp.org.nz/your-plan#thinkingaboutacp \"Open external link\"). \n####    \nTalking about\nOnce you have thought about what's important to you, it's a good idea to talk about them. You should involve the people you want to know about your wishes for care and treatment if you can’t tell them yourself. This could include your whānau and friends, your Enduring Power of Attorney for care and welfare if you have appointed one, your healthcare provider or specialist (particularly if you have been diagnosed with a serious illness) and other members of your healthcare team.\n####    \nPlanning for\nWhen you know what's important to you and what you want others to know in the future, it's a good idea to write it down for your whānau and healthcare team to refer to in the future if you can't tell them yourself. \n[Tools to help you write down your wishes(external link)](https://www.myacp.org.nz/your-plan#writing-your-acplan \"Open external link\") can be found on the advance care planning website. \nRemember, you don’t need to complete every section in the 'My advance care plan and guide booklet', just those that feel relevant to you. \n####    \nSharing\nOnce you have made your plan, make sure you share it with your key whānau members, Enduring Power of Attorney and your healthcare team. It's important your whānau and other loved ones know you have a plan and where the plan is kept. In many parts of the country, you can ask for your plan to be added to your medical record. Each area of Aotearoa New Zealand has a different process, find out [who to contact in your area(external link)](https://www.myacp.org.nz/who-can-i-contact-in-my-area \"Open external link\"). \n[My advance care plan and guide(external link)](https://static1.squarespace.com/static/62e8790dafcbaf632ac96c76/t/6372b9e5948e6a29c523f4d9/1668463089521/ACP_Plan_print_.pdf \"Open external link\")[electronic version of my advance care plan(external link)](https://static1.squarespace.com/static/62e8790dafcbaf632ac96c76/t/663c2578d757116b6288dbcc/1715217787176/Digital+advance+care+plan.pdf \"Open external link\") that you can complete online and email to your family.\n####    \nReviewing\nIt's a good idea to review your plan regularly to make sure nothing has changed for you. People find it useful to decide on a day to review it every year, such as their birthday, Labour day or the time the clocks go back for winter. Every time you make a change, let your healthcare team and anyone who has a copy of your advance care plan know.\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [falls prevention apps](https://healthify.nz/apps/f/falls-prevention-apps) and [long-term condition apps](https://healthify.nz/apps/l/long-term-condition-apps).\n####  VIDEOS: Personal stories \n#### Video: Arthur Te Anini's story (English subtitles)\n  \nArthur Te Anini has written an advance care plan for his future health and end-of-life care. In this video, he talks about how writing down what he wants to happen has given him and his whānau confidence about the future.  \n  \n\n",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:21.568143+00:00",
    "source": "healthify"
  }
}