{
  "url": "https://healthify.nz/health-a-z/a/arrhythmias/",
  "title": "Arrhythmias",
  "content": "Your heart has a natural pacemaker in the top right-hand corner. This is a group of heart muscle cells called the sinoatrial node. The sinoatrial node sends out regular electrical signals which travel down a conducting system, like electrical wires. The electrical signal makes your heart muscle pump. The top chambers (the atria) of your heart pump first, squirting blood into the bottom chambers which are called ventricles. Then the ventricles pump and send blood to your lungs and the rest of your body. You feel this as your heart beat or pulse. It's normally 60–100 beats per minute and has a regular rhythm.\n![Image of heart showing atria, ventricles and the electrical conduction system ](https://healthify.nz/assets/Health-A-Z/Cardiac/Heart-conduction-system-Kreuger-wikimedia-commons-600x620.jpg)\n_Image credit: Rob Kreuger, medical illustrator, AMC, The Netherlands,[ CC BY-SA 3.0(external link)](https://creativecommons.org/licenses/by-sa/3.0 \"Open external link\") via Wikimedia Commons_\nIf the signal to pump comes from any other part of your heart, this system doesn’t work as well and your heart can beat too slowly, too fast or in an irregular rhythm. This can cause problems with the blood flow around your heart and around your body. A slow heartbeat is called a bradycardia, a fast heartbeat is called a tachycardia.\nAn arrhythmia can last for a second or a few minutes, or your heart can stay in an abnormal rhythm for days or permanently.\nSome of the causes of electrical problems are:\n  * ischaemic heart disease ([angina](https://healthify.nz/health-a-z/a/angina) and [heart attacks](https://healthify.nz/health-a-z/h/heart-attack))\n  * heart valve disease\n  * cardiomyopathy\n  * congenital (being born with an electrical conduction problem)\n  * [overactive thyroid](https://healthify.nz/health-a-z/o/overactive-thyroid) (hyperthyroidism)\n  * [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high)\n  * some medicines.\n\n\n####  What are the symptoms of an arrhythmia? \n  * Palpitations – an awareness of your heart beating fast, slow or irregularly.\n  ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:33.400168+00:00",
    "source": "healthify"
  }
}
