{
  "url": "https://healthify.nz/health-a-z/a/arrhythmias/",
  "title": "Arrhythmias",
  "content": "This can happen to people in their twenties and thirties. It usually goes away by itself. Sometimes you can stop it by holding your breath (a Valsalva manoeuvre) or by plunging your face into a bowl of iced water. If it doesn’t go away after a few hours or if you feel very unwell, you can go to hospital where medicine or a shock can be used to get your heart rhythm back to normal.\n#### Atrial fibrillation (AF)\nAF is a fast irregular heart rhythm starting in the upper chambers (atria.) It can cause stroke or heart failure and often needs ongoing medication or a shock.\n#### Atrial flutter\nAtrial flutter is similar to atrial fibrillation. The atria beat at about 300 bpm but the ventricles are unable to beat that quickly and so beat at between 75 and 150 beats per minute.\n#### Ventricular tachycardia\nThis is uncommon and serious. It starts in the lower chambers of the heart. There's a trigger of electrical signals somewhere in the ventricles which overrides the normal signals coming down from the sinoatrial node. The ventricles beat faster than normal (between 120 and 200 bpm). The rate in the atria is normal.\n#### Ventricular fibrillation (VF)\nThis is a common cause of cardiac arrest and death. Electrical signals are triggered in many places in the ventricles so the muscle quivers and can't pump blood. It can only be fixed by a shock from a defibrillator given within a few minutes.\n#### Heart block\nThis happens when the electrical signals are partially or fully blocked between the atria at the top of your heart and the ventricles at the bottom. The sinoatrial node in the right atrium sends signals at the normal rate but the rate the ventricles pump (heart rate) depends on how many signals get through to the ventricles:\n  * **First-degree heart block** means there's a slight delay in each signal, but each impulse does get through and your resting heart rate is normal. First degree heart block is only noticed on an [ECG](https://healthify.nz/health-a-z/e/electrocardiograph-ecg).\n  * **Second-degree heart block** means that some signals from the atria don’t get through to the ventricles. The ventricles can pump more slowly.\n  * **Third-degree, or complete, heart block** means that no signals are conducted through. The ventricles then pump at their own in-built rate of about 20-40 beats per minute. You have a very slow pulse.\n\n\n",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:33.400168+00:00",
    "source": "healthify"
  }
}
