{
  "url": "https://healthify.nz/health-a-z/a/angioedema/",
  "title": "Angioedema",
  "content": "The rash will usually settle in a few days. Otherwise, the skin over the swelling may feel tight and painful but look normal.\n####    \nOther symptoms\nLess common symptoms of angioedema include:\n  * difficulty breathing\n  * red, irritated eyes [(conjunctivitis)](https://healthify.nz/health-a-z/c/conjunctivitis)\n  * [tummy (abdominal) pain](https://healthify.nz/health-a-z/a/abdominal-pain)\n  * [nausea (feeling sick) ](https://healthify.nz/health-a-z/n/nausea-vomiting-adults)\n  * [diarrhoea (runny poo)](https://healthify.nz/health-a-z/d/diarrhoea)\n  * dizziness\n  * [fainting](https://healthify.nz/health-a-z/f/fainting). \n\n\n####  Is angioedema dangerous? \nThe only danger from angioedema is if your throat or tongue swell severely, as this can cause difficulty breathing. Severe throat swelling requires early use of medicine (eg, adrenaline for[anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\"))\n#### Call 111 if you or your whānau:  \n  \n\n  * have sudden swelling of your lips, tongue or throat\n  * are struggling to swallow\n  * are finding it hard to breathe.\n\n\n####  Don't wait, this is a medical emergency.  \n---  \n  \nSwelling on the outside of your neck is uncomfortable but doesn't affect your breathing. Swelling that interferes with breathing is uncommon, even in people with recurrent angioedema.\nIf you have recurrent (coming and going) angioedema you should be referred by your healthcare provider to a clinical immunology/allergy specialist to see if there's an underlying cause and to optimise treatment.\n####  How is angioedema treated? \n#### The treatment for angioedema depends on what's causing it\nThere are several different types of angioedema, each of which has a different cause. Angioedema can usually be treated at home, but if you have a severe case you may need to be treated in hospital.\nYour symptoms may disappear over time without any treatment. Some people only have a single episode, whereas others suffer from repeated bouts, which eventually stop for no apparent reason.\n####    \nChange medicines\nIf a certain medicine is thought to be causing your angioedema, your healthcare provider will usually advise stopping it. They can prescribe a different medicine for you to take instead. This is usually all that needs to be done. Tell your healthcare provider if your symptoms continue or come back after switching medicines.\n####    \nAvoid aggravating factors\nAvoiding excessive heat, spicy foods and alcohol as these things can make angioedema worse. Aspirin should be avoided unless you're already taking it without a problem.\n####    \nTake antihistamines\n[Antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines) block the effect of histamine which is usually the cause of the swelling. Since they take 1 to 2 hours to reduce symptoms, it's often better to take them regularly, rather than as needed. The aim is to stop the episodes of swelling or to make them less frequent or less severe.\nIf you have severe angioedema, it's often better to take antihistamines every day, stopping every month or two to see if they are needed, and restarting them if they are.\nDifferent people respond best to different antihistamines. Non-sedating antihistamines (eg, [cetirizine](https://healthify.nz/medicines-a-z/c/cetirizine), [fexofenadine](https://healthify.nz/medicines-a-z/f/fexofenadine) and [loratadine](https://healthify.nz/medicines-a-z/l/loratadine)) are less effective for angioedema than for hives and are often don't work at all for the non-itchy angioedema.\n####    \nOther medicines\nOther medicines are usually reserved for when angioedema can't be prevented by taking antihistamines. They are generally given under specialist supervision because they're more likely to have side effects.\n####  What is the outlook for someone with angioedema? \nAngioedema eventually disappears for most people. ",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.154293+00:00",
    "source": "healthify"
  }
}
