{
  "url": "https://healthify.nz/health-a-z/a/allergic-rhinitis/",
  "title": "Allergic Rhinitis",
  "content": "You can also get hay fever treatments from your pharmacy or healthcare provider. \n\n\n![Conifer pollen canva 950x690](https://healthify.nz/assets/NZ-outdoors/Conifer-pollen-canva-950x690.jpg)\n![](https://healthify.nz/health-a-z/h/hay-fever)\n####  What is hay fever? \nHay fever is a common allergic condition that affects your nose, throat, sinuses and eyes. It’s also known as allergic rhinitis. The eye symptoms are also called allergic conjunctivitis. About 1 in 5 New Zealanders have hay fever. It often starts between the ages of 6 and 14 and continues all through life.\nHay fever can be caused by many different allergens, not just grasses. Allergens, or triggers, are things that can cause an allergic reaction in some people and include plant pollen, mould, hair and skin flakes from animals (also known as pet dander) and dust mites. \nSymptoms of hay fever include:\n  * a blocked nose\n  * a runny and itchy nose\n  * sneezing\n  * an itchy throat\n  * red, itchy and watery eyes.\n\n\nHay fever is more common if you have a history of [asthma](https://healthify.nz/health-a-z/a/asthma-topics) or [eczema](https://healthify.nz/health-a-z/e/eczema).  \n  \n\n![Symptoms of hay fever](https://healthify.nz/assets/Health-A-Z/Respiratory/Hay-fever-Depositphotos-800x800__ResizedImageWzYwMCw2MDBd.png)\n_Image credit: Depositphotos_\n####    \nThere are 2 types of allergic rhinitis\n  * **Seasonal allergic rhinitis:** This is when you get symptoms at certain times of the year. Pollens carried by the wind cause seasonal hay fever, usually in spring and summer. The length of the pollen season usually depends on where you live and the plants you're allergic to.\n  * **Perennial allergic rhinitis:** This is when you get symptoms all year round. Dust mites, moulds and pets are the most common causes of perennial rhinitis.\n\n\nSevere hay fever can have a big impact on your daily life as it can affect your sleep and concentration. You may also be more likely to develop ear or sinus infections, and if you have asthma it may be harder to manage.\n####  What causes hay fever? \nHay fever is inflammation of the lining of your nose, eyes, throat and sinuses due to an allergy. When cells in these areas come into contact with an allergen, or trigger, they release the chemical histamine which causes inflammation.\nMost often this response is triggered by plant pollen, especially grasses. Other allergens that can cause hay fever include:\n  * house dust mites\n  * mould spores\n  * hair and skin flakes from animals (also known as ‘dander')\n  * cockroach droppings\n  * chemicals or irritants, such as perfumes or workplace chemicals.\n\n\nFood allergies don't trigger hay fever.\n####  What are the symptoms of hay fever? \nSymptoms of hay fever include:\n  * sneezing \n  * a runny nose \n  * watery, itchy, red and puffy eyes\n  * a blocked nose\n  * mucus from your nose running down the back of your throat (postnasal drip)\n  * an itchy throat, mouth, nose and ears\n  * blocked ears\n  * throat clearing or coughing\n  * loss of smell\n  * headache\n  * earache\n  * lack of energy and fatigue.\n\n\nThese symptoms can range from mild to severe and can make it difficult for you to do normal activities, including tasks at work or school.\nDespite its name, hay fever doesn’t cause fever.\n##  ![](https://healthify.nz/assets/Legacy/15999/boy-sneezing-canva-665x443__ResizedImageWzY1MCw0MzNd.png)\n_Image credit: Canva_\n####  What are the complications of hay fever? \nIf hay fever is severe and untreated:\n  * you may have problems sleeping, which can leave you feeling tired during the day\n  * you may be more likely to get [sinus infections](https://healthify.nz/health-a-z/s/sinusitis-acute), [ear infections](https://healthify.nz/health-a-z/e/ear-infection-outer-ear) and [eye infections](https://healthify.nz/health-a-z/c/conjunctivitis)\n  * you may find it hard to concentrate during the day\n  * if you also have [asthma](https://healthify.nz/health-a-z/a/asthma-adults), your asthma symptoms may be harder to manage – 50 to 80% of people with asthma have hay fever, and 20 to 30% of people with hay fever have asthma.\n\n\n####  How is hay fever diagnosed? \nHay fever is usually diagnosed from the pattern of typical hay fever symptoms. It can be similar to other conditions that affect your nose, such as [the common cold](https://healthify.nz/health-a-z/c/colds \"Colds\") or [nasal polyps](https://healthify.nz/health-a-z/n/nasal-polyps \"Nasal polyps\"). You don't necessarily need to see a healthcare provider if you think you may have hay fever, unless treatments recommended by your pharmacist aren't working. Read more about [hay fever treatments](https://healthify.nz/health-a-z/h/hay-fever#treatment) below. \nIf your hay fever symptoms are not helped by using treatment, see your healthcare provider to get the right diagnosis. They will ask about your symptoms and when they occur. They will also examine your eyes, nose and throat for signs of irritation and congestion.   \n  \n",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:24.384743+00:00",
    "source": "healthify"
  }
}
