{
  "url": "https://healthify.nz/health-a-z/a/autism/",
  "title": "Autism",
  "content": "People with autism often prefer to identify as autistic, an autistic person, a person with autism or as an autistic individual. In the health system, it's often called autism spectrum disorder (ASD).\n####  What are the signs of possible autism in a young child (under 3 years of age)? \nA young child with autism might have some or all of the following challenges.\n#### Relating to others and playing\nA young child may:\n  * prefer to play or be alone\n  * not smile when smiled at\n  * have difficulty with eye contact\n  * not recognise or respond to another person's happiness or distress\n  * not want to be picked up or cuddled\n  * seem disinterested in, or too friendly with, other people\n  * appear to be in their own world\n  * prefer to play alone\n  * not copy others (clapping, waving)\n  * ignore greetings and farewells (such as waving hello or goodbye)\n  * not respond when you play peek-a-boo or other games\n  * not do much pretend play or 'make believe' (talking on the phone or looking after a doll)\n  * not involve other people in what they're doing (such as not bringing toys or objects to share)\n  * not invite other people to look at what they're doing.\n\n\n####    \nCommunicating\nA young child might:\n  * find it hard to communicate what they want\n  * have talking or listening skills that are behind other children of their age\n  * appear to not understand what people want or say\n  * use language in an unusual way (such as repeating words or songs)\n  * not respond to their name\n  * refer to themselves as 'you' or 'she/he' rather than 'I'\n  * not point to things or not show interest when others point to things\n  * sometimes appear not to hear\n  * lead someone by the hand to show what they want\n  * may not seek help when they need it\n  * have difficulty following directions.\n\n\n####    \nDifferences in interests and behaviours\nA young child may:\n  * have a narrow range of interests\n  * need things to be done in a particular way\n  * get very upset at changes in routine\n  * play with toys in a repetitive way (might line things up or put things in a certain order)\n  * seem to get stuck doing the same thing over and over\n  * make unusual movements with their body (eg, hand flapping or walking on toes)\n  * play with toys in unusual ways (eg, spinning the wheels on a car)\n  * not like make-believe play (such as pretending to make or do things)\n  * like to hold and keep unusual objects (eg, a key ring or piece of string)\n  * not like loud noises (may put hands over ears)\n  * really like or dislike certain sounds, smells, tastes or the way things look or feel\n  * either cope unusually well with pain or find even a little pain very difficult.\n\n\n####    \nWhat are the definite signs that my young child needs assessment for autism?\n  * No babbling or pointing or other gesture by 12 months of age.\n  * No single words by 16 months.\n  * No 2-word phrases by 24 months.\n  * Any loss of any language or social skills at any age.\n\n\n####  What are the signs of possible autism in a child (4 to 8 years of age)? \nYou may have noticed some of the signs described for a young child. An older child may also have some or all of the following challenges.\n####    \nRelating to others and playing\nA child may:\n  * prefer to spend time alone\n  * have difficulty joining in with other children's play\n  * use eye contact less\n  * not know if someone is joking, or not understand jokes\n  * not understand the usual social rules for behaviour\n  * have difficulty taking part in a two-way conversation\n  * show strong reactions to others coming too close to them\n  * find it harder to role play or joke around\n  * not be able to develop and keep friendships in the same way as other children\n  * sometimes say or do things that are tactless\n  * be overwhelmed by some situations.\n\n\n####    \nCommunicating\nA child may:\n  * find it hard to communicate what they want\n  * use a voice with an unusual tone or pitch or accent\n  * use unusual words (can be very adult in their language)\n  * not use language so much for social interaction\n  * talk without an awareness of whether the listener is interested\n  * show a tendency to talk only about specific topics\n  * appear to not understand what people want or say\n  * refer to themselves as 'you' or 'she/he' rather than 'I'\n  * find it difficult to understand facial expression, body language or gesture\n  * take information or instructions 'literally'\n  * have difficulty with new instructions or settings.\n\n\n####    \nDifferences in interests and behaviours\nA child may:\n  * have a narrow range of interests\n  * need things to be done in a particular way\n  * get very upset at changes in routine\n  * struggle with make-believe play\n  * have intense interests which they like to talk about and which take up a lot of time\n  * struggle to cope with change or unstructured situations (eg, school trips, relieving teachers)\n  * repeat facts about their particular interest without consideration for the listener\n  * have poor coordination\n  * make unusual movements with their body\n  * really like or dislike certain sounds, smells, tastes or the way things look or feel\n  * either cope unusually well with pain or find even a little pain very difficult.\n\n\n####  What are the signs of autism in an older child or teenager? \nSigns of autism may not be quite as obvious in this age group. Older children and teens with autism have difficulty thinking in an abstract way. They often develop a growing awareness of their social difficulties as relationships become more complex. Without the right support and understanding, they may be bullied or develop anxiety or depression, particularly at times of stress or change (eg, exams or leaving school).\n####  How is autism diagnosed? \n  * You may be one of the first to notice signs of autism in your child\n  * Your child's teachers, Well Child nurse or healthcare provider may also raise concerns about your child's development\n  * If you're worried and you haven't seen your healthcare provider, make an appointment to talk to them – it really helps to give them as much information as possible.\n  * If your child needs an assessment for autism-takiwātanga, your healthcare provider can arrange this.\n  * It can take many months to get an assessment – waiting times vary across Aotearoa New Zealand.\n  * There are some things you can do in the meantime.\n\n\nRead more on KidsHealth about [autism diagnosis(external link)](https://www.kidshealth.org.nz/autism-takiw%C4%81tanga-diagnosis \"Open external link\").\n####  Support following a diagnosis of autism (+ APPS) \nParents and whānau can have a range of responses to a diagnosis of autism in their child. Some parents and whānau are relieved to understand differences in their child's development. Others may find the diagnosis difficult.\nIf your child does have autism, there are services available to support your child, you and your whānau.\nGetting information about autism is important. But, parents and whānau will have their own needs about this. Some want as much information as possible early on. Others find a lot of information, early on, overwhelming. There are resources, information and support available for you to check in your own time, when you need them.\nRead more on KidsHealth about the [support available for your child(external link)](https://www.kidshealth.org.nz/autism-takiwatanga-asd/autism-takiwatanga-diagnosis \"Open external link\"). \n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [Autism apps](https://healthify.nz/apps/a/autism-apps).\n####  How common is autism? \nOverseas figures vary from about 1 in 59 to 1 in 100. ",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:38.177022+00:00",
    "source": "healthify"
  }
}
