{
  "url": "https://healthify.nz/health-a-z/a/amenorrhoea/",
  "title": "Amenorrhoea",
  "content": "Applicator tampons come with a cardboard tube to help you get your tampon into the right place. Read more about [tampons and how to use them safely](https://healthify.nz/hauora-wellbeing/t/tampons).\n  * **Menstrual sponges** (period sponges or soft tampons) are natural or artificial sea sponges used inside your vagina. They are like a reusable tampon but without a string. They need to be changed every 4 to 6 hours and washed thoroughly after use.\n  * **Menstrual cups** are soft rubber or silicon cups that are put into your vagina to catch the blood flow. You empty the cup every 8 to 12 hours, rinse it under water, and put it back in.\n  * **Period underwear** looks and feels like your usual underwear but is very absorbent. It can be used instead of pads or tampons when you have a light flow, or as a back-up to a tampon when you have a heavy blood flow. \n\n\nRead more about [period products(external link)](https://sexualwellbeing.org.nz/adv/periods/period-products/ \"Open external link\").\n####  What self-care can I do during my period? (+ APPS) \nThere are things you can do to help you manage your period.\n  * Keep a record of the first day of your period, eg, on a calendar or in a period app. After a few months you should be able to work out how long your cycle is. This can help you predict when you’ll get your next period, or know if your period is early or late.\n  * You may want to track your periods like this for a variety of reasons, including: \n    * knowing when to expect your period so you can be prepared\n    * understanding your body's reactions to different phases of your cycle\n    * planning a pregnancy\n    * having informed conversations with healthcare providers (who often ask when your last period was). \n  * Read about [period tracking apps](https://healthify.nz/apps/p/period-menstrual-cycle-tracking-apps).\n  * Read about [what you can do to look after yourself if you have premenstrual syndrome](https://healthify.nz/health-a-z/p/premenstrual-syndrome-pms#self-care-with-pms). \n  * During your period you can try the following things to help manage any symptoms: \n    * gentle exercise\n    * relaxation techniques\n    * making time for enough sleep\n    * moving decisions or tasks that can wait to another time in your cycle\n    * using a wheat pack or hot water bottle on your tummy or breasts\n    * using pain relief medicines such as paracetamol or ibuprofen\n    * reducing smoking and alcohol use.\n\n\n####    \nDo I have to have a period?\nIt’s not necessary for your health to have a period every month. ",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.246959+00:00",
    "source": "healthify"
  }
}
