{
  "url": "https://healthify.nz/health-a-z/a/allergic-conjunctivitis/",
  "title": "Allergic Conjunctivitis",
  "content": "# Allergic conjunctivitis\n## Also known as allergic eye\n### Key points about allergic conjunctivitis\n  * Allergic conjunctivitis is inflammation of the white part of your eye and the inside lining of your eyelids due to allergies.\n  * It can be seasonal, occurring at certain times of the year (when due to pollen or grasses) or ongoing (when caused by dust mite or pets).\n  * Allergic conjunctivitis can't be spread from person to person.\n  * It usually affects both eyes.\n  * Symptoms can include red, itchy, watery, gritty eyes, puffy eyelids and a sore or burning sensation in your eyes.\n  * Treatment includes avoiding allergens and taking medicines to relieve your symptoms.\n\n\n![Woman outdoors rubbing itchy, sore eyes](https://healthify.nz/assets/Health-A-Z/Eye-topics/Itchy-eyes-canva-950x690.jpg)\n####  What is allergic conjunctivitis? \nAllergic conjunctivitis is when the white part of your eye and the inside lining of your eyelids becomes inflamed (irritated and swollen) because of allergies.\nIt can be seasonal, happening at certain times of the year if it's due to pollen or grasses. It can also be ongoing if it's caused by dust mite or pets. It usually affects both eyes.\n####  What are the symptoms of allergic conjunctivitis? \n![Woman outdoors with itchy eyes rubbing them](https://healthify.nz/assets/Legacy/17516/woman-with-itchy-eyes-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\nImage credit: Canva\nAllergic conjunctivitis usually affects both eyes. Symptoms can include: \n  * itchy, watery eyes\n  * puffy eyelids and swelling of your eyelids\n  * the white of your eyes looking red or pink\n  * sore or burning, gritty, irritated eyes\n  * other allergic symptoms such as the suddenly getting a blocked or runny nose\n  * in severe cases, your conjunctiva (the tissue that covers the surface of your eyeball) may swell, which is known as chemosis.\n\n\nYour vision isn't usually affected by allergic conjunctivitis. However, if you are constantly exposed to an allergen and have long-term allergic conjunctivitis, your vision may become reduced. You may also develop large red bumps in the inner lining of your upper eyelid, known as papillae, and your cornea may be damaged by long-term inflammation.\n####  What can I do if I have allergic conjunctivitis? \nThere are several things you can do to improve your symptoms, including:\n  * not rubbing your eyes\n  * washing your eyes with cold water\n  * using cold packs or cold compresses on your eyes to soothe symptoms\n  * not wearing contact lens until your symptoms have cleared up\n  * using eye drops\n  * consider taking antihistamines if you have[hay fever.](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\")\n\n\n#### Identify and remove the cause\nIf you have worked out what allergen or irritant is causing your symptoms, you need to minimise your risk of exposure to it, and where possible, remove it. For example, removing carpet, using barrier encasing of your pillows and mattress, or washing bedding in hot water to remove house dust mites. Read more about[specific section on the allergies page](https://healthify.nz/health-a-z/a/allergies).\n#### Bathe your eyes with cold water, or apply cold-water compress \nMild symptoms can be managed with bathing your eyes with cold water, or applying cold-water compress to the eye. The cold restricts circulation and will help calm down the inflammation that is associated with eye allergies.\n  * You can make a cold compress by dipping a flannel (face towel) in cold water, gently squeezing out some of the water and applying the cool flannel over your eyes. Repeatedly re-soak the towel to keep it cool or cold, until you get relief (10 to 20 minutes).\n  * If you apply a homemade compress using as a bag of ice, wrap the ice in a small towel or cloth. Don’t apply ice directly to the skin. It can cause frostbite.\n\n\n**How to wash your eyes**\n  * Before touching your eyes, wash your hands with soap and warm water.\n  * Dry hands with a clean or disposable towel.\n  ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:23.790526+00:00",
    "source": "healthify"
  }
}
