{
  "url": "https://healthify.nz/health-a-z/a/adrenal-insufficiency/",
  "title": "Adrenal Insufficiency",
  "content": "# Adrenal insufficiency\n## Also known as Addison's disease\n### Key points about adrenal insufficiency\n  * Adrenal insufficiency occurs when your body doesn't produce enough of certain hormones. \n  * You can take medicine to replace the missing hormones and live a normal, active life.\n  * Adrenal insufficiency can affect people of any age or gender.\n  * It is caused by either damage to your adrenal glands (Addison's disease or primary adrenal insufficiency), or when your pituitary gland doesn't produce enough of a specific hormone (secondary adrenal insufficiency).\n  * You also need to carry a corticosteroid injection with you at all times in case you have an adrenal crisis.\n\n\n![Tired woman at gym](https://healthify.nz/assets/Healthy-Living/Exercise/Tired-woman-at-gym-canva-950x690.jpg)\n####  What is adrenal insufficiency? \nAdrenal insufficiency is an endocrine, or hormonal, disorder that occurs when your adrenal glands don't produce enough of certain hormones. Your adrenal glands are located just above your kidneys. They produce important hormones including cortisol, aldosterone, adrenaline and androgens. \nAdrenal insufficiency can be primary (about 1 in 4 cases) or secondary (about 3 in 4 cases):\n  * **Primary adrenal insufficiency is also known as Addison's disease** , named after the doctor who described this condition. Addison’s disease is rare. It affects 110–144 of every 1 million people in developed countries. It occurs when your adrenal glands are damaged (from infection, injury or autoimmune problems) and can't produce enough of the adrenal hormones cortisol and sometimes aldosterone.\n  * **Secondary adrenal insufficiency** is more common and occurs when your pituitary gland (a pea-sized gland at the base of your brain) doesn't produce enough adrenocorticotropin (ACTH). This hormone stimulates your adrenal glands to produce the hormone cortisol. Without enough ACTH your adrenal glands can shrink over time. \n\n\n####  What are the symptoms of adrenal insufficiency? \nThe symptoms of adrenal insufficiency are non-specific. They often come on gradually, first appearing during times of stress and then more often over weeks to months. Such symptoms include:\n  * abdominal pain\n  * [fatigue](https://healthify.nz/health-a-z/f/fatigue \"Tiredness & fatigue\")\n  * muscle weakness  \n\n  * low blood pressure that drops further you stand up, causing dizziness or fainting\n  * diarrhoea (runny poos) or constipation (hard to poo)\n  * [nausea (feeling sick) and/or vomiting (being sick)](https://healthify.nz/health-a-z/n/nausea-vomiting-adults \"Nausea & vomiting – adults\")\n  * weight loss\n  * joint and muscle aches\n  * [headache](https://healthify.nz/health-a-z/h/headache \"Headache\")\n  * hypoglycaemia (low blood sugar)\n  * sweating\n  * hyperpigmentation (only in Addison’s disease) – dark patches or skin discolouration, especially in the folds of your skin or around areas such as your nipples, lips and rectum (bottom)  \n\n  * dehydration (only in Addison’s disease)  \n\n  * salt craving (only in Addison’s disease)\n  * irritability and depression\n  * irregular or absent menstrual periods\n  * in women, loss of interest in sex.\n\n\n####  What are the causes of adrenal insufficiency? \n#### Addison's disease (primary adrenal insufficiency)\nAddison’s disease is usually caused by an autoimmune disorder (in 8 out of 10 cases). ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:21.434288+00:00",
    "source": "healthify"
  }
}
