{
  "url": "https://healthify.nz/health-a-z/a/amyloidosis/",
  "title": "Amyloidosis",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Helen Kenealy, Geriatrician and General Physician, Counties Manukau DHB\nLast reviewed: 19 Jul 2021\nPage last updated: 15 Dec 2022\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/amyloidosis \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Amyloidosis\n## Sounds like 'am-uh-loi-DO-sis'\n### Key points about amyloidosis\n  * Amyloidosis is a rare condition that occurs when an abnormal protein, called amyloid, builds up in your organs and affects their normal function.\n  * Amyloidosis can occur throughout your body or in one tissue or organ, most often your heart, kidney, gastrointestinal tract (gut), nervous system or skin.\n  * Symptoms are quite varied, and usually affecting more than one system in your body.\n  * Although there is no cure, treatment can help manage symptoms and limit more amyloid protein being produced, therefore limiting further damage to the affected organ.\n  * There is support available for people with this condition and their carers.\n\n\n![Walkers on the beach](https://healthify.nz/assets/NZ-outdoors/Walkers-on-the-beach-HN-950x690.png)\nQR Code Print\n####  What is amyloidosis? \n![close portait of tired bearded man ](https://healthify.nz/assets/Card-Images/tired_man_665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: 123rf_\nAmyloidosis is the term used for a group of conditions whereinsoluble proteins (amyloid) collect in one or more body organs and affect how they function. This may happen throughout your body or in one tissue or organ. Organs often affected include your heart, kidney, gastrointestinal tract (gut), nervous system or skin. \n####  Who is most at risk of getting amyloidosis? \nAmyloidosis generally affects people who are middle-aged and older, although it can occur in people from their thirties.Amyloidosis occurs more commonly in men.  \n  \nOther health conditions can increase the risk of amyloidosis. About 10–15% of people with multiple myeloma develop amyloidosis. Long-term kidney dialysis may increase the risk of dialysis-associated amyloidosis.\n####  What are the types of amyloidosis? (+ VIDEO) \n#### Video: Amyloidosis; AA, AL, TTRwt (wild type) and TTR hereditary\nThis video may take a few moments to load.\nThere are many different types of amyloidosis, but there are 3 main types.\n  \n(New Zealand Amyloidosis Patients Association, 2021)\n#### Primary amyloidosis (AL amyloidosis)\nPrimary amyloidosis is a disorder of protein metabolism that begins in your bone marrow. It is sometimes associated with multiple myeloma. Primary amyloidosis affects your heart, kidneys, liver, gastrointestinal tract (gut), central nervous system and skin. \n#### Secondary systemic amyloidosis (AA amyloidosis)\nSecondary systemic amyloidosis occurs as a complication of many chronic inflammatory diseases such as[rheumatoid arthritis](https://healthify.nz/health-a-z/r/rheumatoid-arthritis \"Rheumatoid arthritis\"),[tuberculosis (TB)](https://healthify.nz/health-a-z/t/tuberculosis \"Tuberculosis\")AA amyloidosis may improve with treatment of the underlying condition.\n#### Familial (hereditary) amyloidosis\nFamilial amyloidosis is a rare form of amyloidosis that is inherited. It most commonly causes cardiomyopathy (a condition that makes it harder for your heart muscle to pump blood to the rest of your body)\n####  What are the symptoms of amyloidosis? \nYou may not experience symptoms of amyloidosis until the condition is advanced. When you do have symptoms, they depend on the organ or system affected.   \n  \nThey may include:\n  * [extreme tiredness (fatigue)](https://healthify.nz/health-a-z/f/fatigue \"Tiredness & fatigue\")\n  * weight loss\n  * easy bruising\n  * [breathlessness](https://healthify.nz/health-a-z/b/breathlessness \"Breathlessness\")\n  * swelling of your ankles and legs\n  * numbness, tingling or pain in your hands or feet, especially pain in your wrist ([carpal tunnel syndrome](https://healthify.nz/health-a-z/c/carpal-tunnel-syndrome \"Carpal tunnel syndrome\"))\n  * skin changes, such as thickening or easy bruising, and purplish patches around your eyes\n  * an enlarged tongue, which sometimes looks rippled around its edge\n  * runny poo ([diarrhoea](https://healthify.nz/health-a-z/d/diarrhoea \"Diarrhoea\")), possibly with blood in the poo, or[constipation](https://healthify.nz/health-a-z/c/constipation-in-adults \"Constipation\") (hard poo).\n\n\n####  How is amyloidosis diagnosed? \nIf you have the above symptoms see your doctor. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.525750+00:00",
    "source": "healthify"
  }
}