{
  "url": "https://healthify.nz/health-a-z/a/angiography/",
  "title": "Angiography",
  "content": "* You may be given a sedative tablet to help you relax, but you'll still be able to follow the doctor's instructions.\n\n\n####  Where is the procedure carried out? \nCoronary angiography is done in a cardiac catheterisation laboratory, usually called a cath lab. You will be taken there from the ward on a movable bed.\nOnce you are in the laboratory you will be moved onto an examination table. You will be lying directly under an X-ray camera through which the angiography procedure can be viewed. The procedure takes about 30 minutes. It will be longer if anything else is done at the same time.\n####  What does the procedure involve? (+ VIDEO) \nTo access the coronary arteries, a long thin flexible plastic tube called a catheter is inserted into one of your arteries in your wrist or groin. Once the best option is decided, the area is cleaned and covered with sterile sheets. The doctor will inject local anaesthetic into this area. When the skin is numb, an introducing sheath (narrow tube) is inserted into your artery. A thin, flexible plastic tube called a catheter is then threaded through the sheath.\nThe catheter is guided through the artery until it reaches the part of the aorta, immediately outside the heart, where the coronary arteries begin. This should not cause any discomfort. The catheter's movement is monitored by x-rays which your doctor can see on a television screen. You may be able to watch this too if you are interested.\nThe coronary arteries do not show up on normal x-rays, so a special contrast fluid (dye) is used. Once the catheter is in place, the contrast fluid is injected through the catheter to highlight the blood in the coronary arteries. This will show any narrowings.\nSometimes other tests or procedures are done at the same time such as:\n  * measuring the blood pressure within your heart chambers\n  * checking the functioning of your heart valves and how well your\n  * [angioplasty](https://healthify.nz/health-a-z/a/angioplasty)\n\n\nHere is a short video of what to expect when you have a coronary angiography produced by Waikato hospital. You can\n#### Video: Coronary Angiography procedure\nThis video may take a few moments to load.\n(Health New Zealand | Te Whatu Ora Waikato, 2018)\n####  Will it hurt? \nMost people find having an angiogram is easier than they expect. Any pain or discomfort you feel will be closely monitored by the team looking after you throughout the procedure. Common feelings include:\n  * slight pressure as the catheter is inserted, but not when it's inside your blood vessels\n  * an occasional missed heartbeat – your heart rate and rhythm will be closely monitored\n  * wanting to pass urine and feeling flushed as the contrast fluid is given\n  * mild chest pain – if this happens, tell the doctor or nurse.\n\n\nVery rarely, an allergic reaction to the X-ray contrast fluid can happen, so it's important to know if you have had a previous reaction. If you develop itching, a rash or welts, medicines are given to stop the reaction immediately.\n####  What happens afterwards? \n",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.596519+00:00",
    "source": "healthify"
  }
}
