{
  "url": "https://healthify.nz/health-a-z/a/abdominal-pain-in-children-chronic/",
  "title": "Abdominal Pain In Children Chronic",
  "content": "* Being very thirsty, peeing a lot or having pain when peeing.\n  * Delayed puberty.\n  * Family history of[peptic ulcers](https://healthify.nz/health-a-z/p/peptic-ulcer \"Peptic ulcer\")[inflammatory bowel disease](https://healthify.nz/health-a-z/i/inflammatory-bowel-disease \"Inflammatory bowel disease\").\n\n\n####  What are the causes of tummy pain in children? \nOften, a cause for your child’s tummy pain isn’t found, but this doesn’t mean that their pain isn’t real.\n####    \nCommon causes of chronic tummy pain in children include:\n  * [constipation](https://healthify.nz/health-a-z/c/constipation-in-children \"Constipation in children\") – hard poo that's difficult to get out and passing poo less often than usual\n  * recurrent abdominal pain of childhood – tummy pain without an underlying physical cause\n  * [irritable bowel syndrome](https://healthify.nz/health-a-z/i/irritable-bowel-syndrome \"Irritable bowel syndrome\") – tummy pain with diarrhoea (runny poo) or constipation\n  * [indigestion](https://healthify.nz/health-a-z/i/indigestion) or [gastro-oesophageal reflux](https://healthify.nz/health-a-z/g/gastro-oesophageal-reflux).\n\n\n####    \nLess common causes include:\n  * abdominal migraine – tummy pain with nausea/vomiting, loss of appetite and pale skin\n  * recurrent [urinary tract infections](https://healthify.nz/health-a-z/u/urinary-tract-infection-uti-in-children)\n  * [inflammatory bowel disease](https://healthify.nz/health-a-z/i/inflammatory-bowel-disease \"Inflammatory bowel disease\") –[Crohn's disease](https://healthify.nz/health-a-z/c/crohns-disease \"Crohn's disease\")[ulcerative colitis](https://healthify.nz/health-a-z/u/ulcerative-colitis \"Ulcerative colitis\")\n  * [coeliac disease](https://healthify.nz/health-a-z/c/coeliac-disease \"Coeliac disease\")\n  * gut infection, such as [giardia](https://healthify.nz/health-a-z/g/giardia)\n  * food hypersensitivity, such as [lactose intolerance.](https://healthify.nz/health-a-z/l/lactose-intolerance)\n\n\n  \nThere are parts of the brain that receive pain signals from damaged parts of the body, but they can also receive messages from the thinking and emotional parts of the brain. We know that these parts of the brain affect how we feel pain or even create it.\nThings that can increase the chance of your child having chronic tummy pain where there is no underlying physical damage include:\n  * a family history of similar disorders, eg, irritable bowel syndrome\n  * stress and anxiety, which can make the pain worse\n  * depression\n  * food allergies or intolerances, which might trigger symptoms in some children.\n\n\nThere are many other causes of abdominal pain in tamariki which are rare. Your healthcare provider will discuss them with your whānau if they seem possible. \n####  How is chronic tummy pain in children diagnosed? \nYour healthcare provider will explore your child’s symptoms to rule out all serious causes of tummy pain that seem possible.\nThey will ask you and your child about the tummy pain, including questions about where the pain is, what it feels like, what makes it better or worse, and whether there are any other symptoms. Read about [how to describe the type of pain](https://healthify.nz/health-a-z/p/pain-describing-your-pain \"Pain – describing your pain\") and [describing where pain is](https://healthify.nz/health-a-z/p/pain-location). They will also ask if there’s a family history of illnesses such as irritable bowel syndrome or inflammatory bowel disease.\nYour healthcare provider will also want to know about how your child has been at school and at home, including their behaviour and mental well-being. Children with recurrent tummy pain are sometimes worried (anxious), sad or depressed.\nThey’ll examine your child's tummy and measure their growth. Your healthcare provider will also ask for some tests, such as blood tests, a stool (poo) sample, a urine (pee) test or an abdominal [ultrasound](https://healthify.nz/health-a-z/u/ultrasound). These are done to rule out different causes depending on what your healthcare provider thinks is causing the pain. If underlying conditions are ruled out, your child may be diagnosed with functional or recurrent abdominal pain.\n####  How is chronic tummy pain in children treated? \nIf there’s an underlying condition causing your child’s tummy pain, your child will be treated for this. If no underlying condition is found, your healthcare provider will be able to reassure you and your child that even though your child’s pain is real, it’s not caused by a serious disease and it won’t cause long-term damage. \nThere are many things you can do to help manage your child’s chronic tummy pain. Medicines aren’t usually needed, unless the pain is caused by an underlying condition.\n[Cognitive behavioural therapy](https://healthify.nz/health-a-z/c/cognitive-behavioural-therapy) or counselling from a psychologist can be helpful, for example if your child is anxious, sad or depressed or is experiencing stress related to their home or school life. \n####  How can I manage my child's chronic tummy pain at home? (+ APPS) \nThere are things you can do to help manage your child’s chronic tummy pain:\n  * Encourage healthy behaviours such as a [balanced diet](https://healthify.nz/hauora-wellbeing/h/healthy-eating-basics) (with enough fibre, fruit and vegetables) and [physical activity](https://healthify.nz/hauora-wellbeing/a/active-children).\n  * Make sure your child drinks enough water so they don’t get dehydrated.\n  * Avoid reinforcing pain behaviour by giving it your attention. ",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:17.791070+00:00",
    "source": "healthify"
  }
}
