{
  "url": "https://healthify.nz/health-a-z/a/allergies-food/",
  "title": "Allergies Food",
  "content": "On discharge, the doctor will refer the infant or child back to their healthcare provider for follow up. This may include arranging tests and a referral to the paediatric service at your local hospital.\nYour doctor or nurse practitioner should also provide parents/carers with a signed **ASCIA Allergy (green)** or **Anaphylaxis (red) Action Plan** and if a particular allergen (or food) is suspected to have caused the reaction, they should give advice about how to avoid it.\nIf you think you or your child has a food allergy, the first step is to see your healthcare provider. It's important to get a reliable diagnosis of food allergy before restricting a particular food in your or your child’s diet as this can affect their growth and development.\nAn experienced GP, nurse practitioner, paediatrician or allergy dietitian will take a history of reactions, do an examination and possibly arrange for allergy tests.\nA diagnosis will be based on clinical history, such as:\n  * the food eaten\n  * whether this has previously been tolerated\n  * what sort of symptoms (eg, a rash or sore tummy) have happened, and\n  * how long after the food was eaten the symptoms developed.\n\n\nIf necessary, your healthcare provider may refer you for skin prick testing or order blood tests for allergen specific Immunoglobulin E (antibodies) to help to identify or exclude potential food allergy triggers. Sometimes a medically supervised food allergen challenge is done to confirm or exclude food allergy.\n####  How is food allergy treated? \nCurrently, there's no cure for food allergy – avoiding the food is the only way to prevent a reaction. This can be challenging, especially when some foods may contain small amounts of the allergen. Your doctor, nurse or allergy dietitian can provide advice about avoiding food allergens.  \n  \nAdrenaline is used to treat severe allergic reactions (anaphylaxis). It can be administered with an auto-injector such as an [EpiPen(external link)](http://www.allergy.org.au/health-professionals/anaphylaxis-resources/how-to-give-epipen \"Open external link\") to slow down or stop a severe allergic reaction. If you have a food allergy and are thought to be at higher risk of developing anaphylaxis, your doctor, pharmacist or nurse can teach you how to inject adrenaline using an EpiPen. You will also need to have an anaphylaxis action plan that documents what to do if you have anaphylaxis and when to call for help. Read more about [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\").\nIf you have a mild or moderate allergic reaction, treatment aims to relieve your symptoms. Antihistamines are the most commonly used medicines. Antihistamines relieve itching or hives on your skin and may need to be taken for a few weeks to reduce the build-up of histamine in the body. Examples include cetirizine and loratadine. You will also need to have an action plan that outlines what to do when you have an allergic reaction. Read more about [antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines).\n####    \nGradual introduction of cooked allergenic foods\nResearchers continue to explore new ways of more effectively treating food allergies. Treatment of milk and egg allergies now includes recommendations on introducing milk and egg in baked products, following a ‘ladder’, until the raw version of the food can be eaten safely. This has been shown to promote earlier tolerance. The allergen containing food (eg, milk or egg) is reintroduced in a stepwise approach. However, it's important that any reintroduction of foods is always led by a specialist or allergy dietitian. \n####    \nOral immunotherapy\nOral immunotherapy treatment (OIT) is a potential treatment for food allergy. It involves giving tiny and increasing amounts of the food protein to ‘desensitise’ the immune system to that food. Results from preliminary research into immunotherapy look promising. However, more research is needed to understand the safety, benefits, cost-effectiveness, impact on quality of life and long-term outcomes. This kind of treatment should only be provided under the supervision of a clinical immunology or allergy specialist. Read more about [oral immunotherapy treatment(external link)](https://www.allergy.org.au/patients/allergy-treatments/oral-immunotherapy-for-food-allergy \"Open external link\").\n####  How can I prevent allergic reactions? \nTo prevent the symptoms of food allergy you need to completely avoid the allergen. After you have identified the allergen/s you (or your child) react to, you must remove them from your (or your child’s) diet.\nHere are some of the ways to minimise the risk of being exposed to a particular food allergen:\n  * Tell others, such as restaurant staff, about the food allergy when eating away from home.\n  * Don't share or swap food or utensils with others.\n  * Ask about food ingredients when offered food by others.\n  * Be aware of cross-contamination of food allergens when preparing food.\n  * Wash hands and surfaces to prevent cross-contamination.\n  * Know how to identify your food allergen and check food product labels – see the section below.\n  * Have a travel plan for any trips away from home – read more about [travelling with food allergies](https://healthify.nz/health-a-z/f/food-allergies-travel).\n  * If the allergy is to egg, know which vaccines to avoid, eg, the yellow fever vaccine, Q fever vaccine and the Rabipur brand of rabies vaccine. Your doctor, nurse or pharmacist can provide advice and more details about these vaccines.\n\n\n####  Reading and checking food labels (+ VIDEO link) \nThe Australia and New Zealand Food Standards Code requires common food allergens to be declared on a food label if the allergen is contained in the food as an ingredient, part of an ingredient, a food additive or a processing aid. Allergen information must be declared in a specific format which is known as Plain English Allergen Labelling (PEAL).\nThe PEAL regulations require:\n  * The same consistent names to be used for the common food allergens which include egg, fish, lupin, milk, mollusc, crustacea, peanut, sesame, soy, wheat, gluten and all the individual tree nuts (cashew, almond, Brazil nut etc).\n  * A ‘summary statement’, beginning with the word ‘contains’, that lists the allergens in the food.\n  * The summary statement must be located next to the ingredient list – it can be above, below or on either side of it.\n\n\nFor more information see the [Food Standards(external link)](https://www.foodstandards.govt.nz/consumer/labelling/allergen-labelling \"Open external link\") Australia New Zealand website or [Allergy New Zealand food allergen labelling(external link)](https://www.allergy.org.nz/managing-allergies/managing-food-allergy/allergen-labelling/ \"Open external link\").\n####    \nVideos\nYou can watch 2 videos about reading food labels for food allergens on this [Food Allergy Aware webpage(external link)](https://foodallergyaware.org.au/everyone/reading-food-labels-for-food-allergens \"Open external link\").\n####  How can I care for myself with food allergy? \nDespite your best efforts to avoid particular foods, you may be exposed to a food allergen accidentally.\nBe prepared for this:\n  * Have an [allergy action plan(external link)](https://www.allergy.org.au/hp/anaphylaxis/ascia-action-plan-for-anaphylaxis \"Open external link\") (see below).\n  * Carry your adrenaline autoinjector with you at all times if you're at risk of anaphylaxis.\n  * Wear a medical alert bracelet or necklace so medical staff know what to do in a medical emergency.\n  * Learn [the signs and symptoms of mild to moderate and severe allergic reactions (anaphylaxis)](https://healthify.nz/health-a-z/f/food-allergies#food-allergy-symptoms) and know what to do when a reaction occurs.\n\n\n####    \nAllergy action plans\nAn action plan documents and outlines the steps to follow if you have an allergic reaction, whether it's mild or serious. If you are thought to be at risk of anaphylaxis and have been prescribed an adrenaline autoinjector you need an [action plan for anaphylaxis.(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2023/ASCIA_Action_Plan_Allergic_Reactions_Green_2023.pdf \"Open external link\") If you're not thought to be at high risk of anaphylaxis and haven't been prescribed an adrenaline autoinjector, you need an [action plan for allergic reactions.(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2023/ASCIA_Action_Plan_Allergic_Reactions_Green_2023.pdf \"Open external link\")\nYour healthcare provider can discuss these plans with you and you can complete them together. Find out more about the [ASCIA action plans(external link)](https://www.allergy.org.au/hp/anaphylaxis/ascia-action-plan-for-anaphylaxis \"Open external link\"). \n####    \nSupport\n  * [Allergy NZ(external link)](http://www.allergy.org.nz/ \"Open external link\") provides information, education and support for people with allergy, parents of children with allergy, teachers and healthcare providers. \n  * [Allergy Today (external link)](https://prod.allergynz.cl.pxlfsn.co/about-us/allergy-today/ \"Open external link\")is a bi-monthly e-newsletter sharing the latest news and expert advice for managing allergies.\n  * [Free Allergy NZ membership(external link)](https://www.allergy.org.nz/about-us/join-us/ \"Open external link\") is available.\n\n\n####  Advice for parents of children with food allergy \nHere are some tips to help you support your child with a food allergy:\n  * Prevent contamination by washing your hands, and your child's hands, with soap and water before touching food.\n  * Prepare and serve foods with clean utensils and other kitchen items and on clean surfaces.\n  ",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.501194+00:00",
    "source": "healthify"
  }
}
