{
  "url": "https://healthify.nz/health-a-z/a/asthma-exercise/",
  "title": "Asthma Exercise",
  "content": "# Asthma during exercise\n## Asthma triggered by exercise, also called exercise-induced asthma or exercise-induced bronchoconstriction.\n### Key points about exercise-induced asthma (EIA)\n  * People with asthma often have more symptoms when they are physically active, especially if the air is cold and dry, or they're unfit.\n  * For some people, it's the only time they experience asthma symptoms. This is called exercise-induced asthma (EIA). It may be worse if you have allergies such as hay fever, and exercise when the pollen count is high.\n  * Don't stop exercising – exercise helps asthma by improving lung function and blood flow, and it has an overall calming effect.\n  * Things that can help manage EIA include nasal breathing, having an asthma plan and making sure your medicines are up-to-date and regularly reviewed. \n\n\n![Tired man taking a break while exercising](https://healthify.nz/assets/Healthy-Living/Exercise/Tired-man-taking-a-break-while-exercising-Canva-950x690.jpg)\n####  What is exercise-induced asthma? \nPeople with a diagnosis of asthma often experience symptoms when they exercise. For some this may be the only time they're aware of symptoms of wheezing, chest tightness, cough and/or breathlessness. This is called exercise-induced asthma (EIA) or exercise-induced bronchoconstriction.. \nIf you find that you cough, wheeze, have a tight feeling in your chest or get breathless when you exercise you may have EIA. \nEIA may get worse by cold, dry conditions and if you are unfit. If you have an allergy response (eg, hay fever or eczema) affecting your asthma, exercising when there's a high pollen count may worsen your symptoms. Air pollution may make this worse.  \n  \n\n![Young woman using an asthma inhaler during a bike ride](https://healthify.nz/assets/Health-A-Z/Respiratory/Young-woman-using-asthma-inhaler-during-bike-ride-canva-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Canva_\n####  Do I have exercise-induced asthma? \nIf you experience any of the following symptoms during physical activity, and/or your [peak flow](https://healthify.nz/health-a-z/p/peak-flow-meter-asthma \"Peak flow meter \\(asthma\\)\") drops 20% after exercise, your asthma may be exercise induced. You should see your healthcare provider if you:\n  * have a tight feeling in your chest\n  * You're wheezy (have noisy breathing)\n  * are breathless\n  * are coughing.\n\n\n####  What are the causes of exercise-induced asthma? \nThere are 2 theories about the cause of exercise-induced asthma:\n  * **Water-loss theory:** Some researchers believe that the cool air you breathe in when you exercise dries the lining of your airways. This triggers your airways to spasm and become tight.\n  * **Heat-exchange theory:** Another theory is that increased breathing during activity cools your airways. When activity stops, the blood vessels dilate to heat the lining of your airways. The airways narrow and cause shortness of breath and wheezing.\n\n\n####  Why is it important to keep exercising? \nDon't let EIA slow you down. Have your asthma treatment reviewed and updated. Have fun and stay active. We all know that physical activity is good for us. This is particularly the case if you have asthma. Being active:\n  * improves lung function\n  * increases blood flow\n  * improves the way your body uses oxygen\n  * has an overall calming effect.\n\n\nActive people usually find they have fewer asthma symptoms and better control over their asthma. Sport and Recreation New Zealand (SPARC) recommends just 30 minutes of brisk walking, or something equivalent, on most days of the week. This can be in 10-minute bites if squeezing in 30 minutes a day is difficult. Being somewhat out of breath isn't harmful as long as you are in control.   \n  \nThere are just as many world-class athletes with asthma as there are without. They take part in all types of sport, including running, and don't let having asthma get in the way of achieving their goals. They control their asthma – not the other way around.\n####  How can I manage exercise-induced asthma? (+ APPS) \nThere are several things you can do to help manage EIA.\n####    \nControl your day-to-day asthma\n  * If you have symptoms of asthma more than 3 times a week, your asthma is not well controlled.\n  * See your healthcare provider to review your medicines and ask for an [asthma self-management plan(external link)](https://www.asthmafoundation.org.nz/resources/topic/asthma-action-plans \"Open external link\"). Make sure you know how to use your inhalers as well and effectively as possible. \n  * Ask whether you need a breathing test (called [spirometry](https://healthify.nz/health-a-z/s/spirometry)). \n  * Make sure your inhalers (puffers) are prescribed according to the latest guidelines. This should include a steroid, asthma preventer – possibly in a single combined reliever/preventer device. You may also benefit from a tablet therapy, such as [montelukast](https://healthify.nz/medicines-a-z/m/montelukast). Talk to your healthcare provider about the best treatment for you. \n  * Try to avoid exercising on days when you are experiencing much more severe asthma symptoms than usual, eg, when you are getting a cold. You may still be able to do scaled down exercise. \n  * If you have hay fever and asthma during the pollen season try to monitor pollen counts and consider choosing indoor activities on days when they're high. Talk to your healthcare provider about the best possible treatment for your [hay fever](https://healthify.nz/health-a-z/h/hay-fever). \n\n\n####    \nDo more asthma-friendly activities\nActivities involving stopping and starting or a warm moist environment are less likely to cause EIA. For example, try walking, tramping, tennis, yoga, martial arts, T'ai chi, aerobics or team sports. However, there's no reason why you shouldn't try more intensive activities if you are doing well with less intensive ones. \n####    \nRemember to warm-up\nStretching and a few minutes of brisk walking or skipping before exercise:\n  * helps prevent EIA\n  * protects you from sprains and strains\n  * gets you in the mood to move.\n\n\n####    \nCheck weather conditions\n  * If you have a choice, exercise inside on cooler, dryer days.\n  ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:35.562793+00:00",
    "source": "healthify"
  }
}
