{
  "url": "https://healthify.nz/health-a-z/a/aphthous-ulcer/",
  "title": "Aphthous Ulcer",
  "content": "# Mouth ulcers\n## Also known as aphthous ulcers\n### Key points about mouth ulcers\n  * Mouth ulcers are common and usually heal in a week or two by themselves. They are rarely a sign of any serious problem.\n  * Mouth ulcers are breaks in the inside surface of your mouth. Ulcers are painful because nerves are close to the surface in your mouth.\n  * You can treat most ulcers at home with mouthwashes and pain relief.\n  * See your pharmacist if you have an ulcer that is painful or not healing as quickly as you think it should – medicated sprays, creams and mouthwashes may help.\n  * See your doctor if the ulcers are very painful, are slow to heal, you have them often or they appear on other parts of your body. A mouth ulcer that does not heal within 3 weeks could be a sign of mouth cancer and needs to be checked.\n\n\n![Woman with toothache touches side of cheek in pain](https://healthify.nz/assets/Health-A-Z/Oral-health/Woman-with-toothache-Canva-950x690.jpg)\n![](https://healthify.nz/health-a-z/m/mouth-ulcers)\n####  What are mouth ulcers? \nMouth ulcers are breaks in the moist inside surfaces (mucosal membrane) of your mouth. Although usually small, they can be large and measure up to several centimetres wide. They look like a shallow crater, and are usually grey or yellow to white. Some have a raised border. Ulcers are painful because nerves are close to the surface in your mouth. This can make eating, drinking and oral care (cleaning your teeth) very uncomfortable. Unlike cold sores. they are not contagious (catching).\n![](https://healthify.nz/assets/woman-suffering-from-aphtha-on-mouth-450x300-123rf.jpg)\n  \n_Image: 123rf_\n####  What causes mouth ulcers? \nSingle mouth ulcers are mostly caused by:\n  * accidentally biting your tongue or inside of your cheek\n  * bumping the inside of your mouth with your toothbrush\n  * burning the inside of your mouth with a hot drink\n  * ill-fitting dentures or a rough edge on a tooth\n  * a food intolerance or allergy\n  * a virus, such as herpes simplex ([cold sore](https://healthify.nz/health-a-z/c/cold-sores)) or varicella zoster (which causes [chickenpox](https://healthify.nz/health-a-z/c/chickenpox) and [shingles](https://healthify.nz/health-a-z/s/shingles)).\n\n\nYou may be more prone to ulcers:\n  * at times of [stress](https://healthify.nz/health-a-z/s/stress)\n  * if you are taking certain medicines\n  * if you use an abrasive toothpaste\n  * if you have a nutrient deficiency, such as vitamin B12, iron or folic acid\n  * with hormonal changes (eg, at a particular time in a woman’s menstrual cycle or during pregnancy)\n  * if you have intestinal conditions such as [Crohn’s disease](https://healthify.nz/health-a-z/c/crohns-disease) or [coeliac disease](https://healthify.nz/health-a-z/c/coeliac-disease)\n  * when you are [quitting smoking](https://healthify.nz/support/s/smoking-quitting-support)\n  * if you have had radiotherapy to your head and neck area. \n\n\nRarely, ulcers can be a sign of something more serious, such as mouth cancer. Ulcers that last for longer than 3 weeks should be checked by a doctor. \n####  What is the treatment for mouth ulcers? \nMost mouth ulcers get better on their own within 1 to 2 weeks. Until your ulcer heals:\n  * use a soft toothbrush to reduce further damage\n  * rinse your mouth with a warm salt-water mouthwash (see below)\n  * avoid foods that make the pain worse, such as spicy or acidic food\n  * avoid chewing gum\n  * choose softer foods that are less likely to make the ulcer feel worse\n  * use a straw to drink cool (not hot) liquids so they don’t touch ulcers in the front of your mouth\n  * take paracetamol for pain relief.\n\n\nA salt-water mouthwash can be made by dissolving half a teaspoon of salt in a glass of warm water. Using warm water helps the salt to dissolve. Rinse your mouth with the solution then spit it out, don't swallow it. You can do this as often as you like. \n#### Medicines for mouth ulcers\nIf your mouth ulcer is causing a lot of pain or not healing, there are medicines that can help relieve pain, protect the ulcerated area, reduce inflammation or prevent further infection. The choice of medicine will depend on how much discomfort you are experiencing and the cause of the ulcer. Talk to a pharmacist about the following options:\n  * **Antiseptic mouthwashes** ­(such as chlorhexidine) are used to prevent infection by stopping the build-up of bacteria\n  * **Protective pastes** (such as Orabase®) act as a protective covering when applied to the ulcer\n  * **Steroid-containing pastes** (such as Kenalog in Orabase® and Oracort®) help to relieve pain, inflammation (redness), discomfort and speed up healing\n  * **Local analgesics**(pain relievers applied to the area) come in the form of a mouthwash, spray, gel or ointment and offer pain relief to the area, in and around the ulcer\n  * **Antiviral creams** are available if your mouth ulcer is caused by the herpes simplex virus (also called [cold sores](https://healthify.nz/health-a-z/c/cold-sores \"Cold sores\") or fever blisters).\n\n\nYour GP may prescribe stronger medication to treat severe, recurrent or infected mouth ulcers.\nRead more about [medicines for mouth ulcers](https://healthify.nz/medicines-a-z/m/mouth-ulcer-medicines).\n####  When to see a healthcare provider \nSee your healthcare provider if your ulcers:\n  * Are very painful – they may be caused by a viral infection, also your doctor can prescribe stronger [pain relief medication.](https://healthify.nz/medicines-a-z/p/pain-relief-medicines-for-short-term-pain)\n  * Occur often – this may indicate a nutrient deficiency or underlying condition such as [coeliac disease](https://healthify.nz/health-a-z/c/coeliac-disease \"Coeliac disease\") or [Crohn’s disease.](https://healthify.nz/health-a-z/c/crohns-disease \"Crohn's disease\")\n  * Appear on other parts of your body – these can be caused by conditions such as [hand, foot and mouth disease](https://healthify.nz/health-a-z/h/hand-foot-and-mouth-disease) or a [sexually transmitted infection.](https://healthify.nz/health-a-z/s/sexual-health)\n  * Do not heal after 3 weeks and have an unusual appearance. Rarely, this may be a sign of mouth cancer. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:33.477742+00:00",
    "source": "healthify"
  }
}