{
  "url": "https://healthify.nz/health-a-z/a/alzheimers-disease/",
  "title": "Alzheimers Disease",
  "content": "Symptoms of dementia include problems with memory, thinking, behaviour and being able to do daily tasks. Dementia is not a normal part of ageing.\nIn Alzheimer’s disease there are physical changes in your cerebral cortex, which is the greyish-pink outer layer of your brain. Abnormal proteins (beta amyloid plaques and tau tangles) build up in your brain. Your brain cells make less of the neurotransmitter acetylcholine, which sends messages around your brain. The abnormal proteins lead to the death of brain cells, and your brain shrinks. Over about 10 years your brain works less and less well and symptoms start to show up.\nAlzheimer's is a progressive disease, which means that gradually over time, more parts of your brain are damaged. As this happens, the symptoms get more severe.\nIt affects about 70,000 people in Aotearoa New Zealand, that’s about 1.4% of the population. It’s getting more common as we live longer.\nDementia affects about 1 in 20 people over the age of 65 and 1 in 5 over the age of 80. About two-thirds of these will have dementia caused by Alzheimer's disease. It’s very common to have both Alzheimer’s disease and the second most common type, vascular dementia. This is called mixed dementia.\n####  What causes Alzheimer’s disease? (+ VIDEO) \nWe don’t know exactly what causes Alzheimer’s disease. It's probably a combination of things, including age, genes and environmental factors. \n**Age:** This is the greatest risk factor for dementia. However, younger people can also get early-onset dementia, about half of early onset dementia is caused by Alzheimer's disease. \n**Genetic inheritance:** A number of genes have been found that increase the risk of developing the condition. The chance of developing Alzheimer's disease is greater if you have a parent or brother or sister with it. However, very few families have a direct inheritance of the condition from one generation to the next, and where they do, it usually appears early in life.\n**Environmental factors:** People with an increased risk of developing Alzheimer's disease include those who:\n  * are smokers\n  * have [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high)\n  * have [diabetes](https://healthify.nz/health-a-z/d/diabetes-overview)\n  * have [high cholesterol levels](https://healthify.nz/health-a-z/c/cholesterol-high)\n  * have had a serious [head injury](https://healthify.nz/health-a-z/h/head-injury)\n  * have Caucasian ethnicity (this is different to vascular dementia, which is more common if you have Māori or Pacific ancestry)\n  * have [Down syndrome](https://healthify.nz/health-a-z/d/down-syndrome) or [Parkinson’s disease.](https://healthify.nz/health-a-z/p/parkinsons)\n\n\nRead more about risk factors for[dementia](https://healthify.nz/health-a-z/d/dementia).\n####    \nVideo: The genetics of Alzheimer's\n(About Alzheimer's, US, 2010)\n####  What are the symptoms of Alzheimer’s disease? \nWhile there are some common symptoms of Alzheimer's disease, everyone is unique. ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:26.512430+00:00",
    "source": "healthify"
  }
}
