{
  "url": "https://healthify.nz/health-a-z/a/anal-fissure/",
  "title": "Anal Fissure",
  "content": "Learn more about [bulk forming laxatives.](https://healthify.nz/medicines-a-z/b/bulk-forming-laxatives)\nIt's also important to drink at least 1.5 litres of fluid (ideally water) every day, unless your doctor advises you differently, eg, if you're elderly, or have kidney or heart failure. Using laxatives called stool softeners may also help to soften the poos. Read more about how to [ease and prevent constipation](https://healthify.nz/health-a-z/c/constipation-in-adults). \n#### Avoid straining during bowel movements\nYou can place your legs on a short stool while on the toilet to help relax the muscles around the anus. You can also take regular sitz baths (sitting in warm water up to the hips) to ease the pain and relax these muscles.\n#### Maintain good hygiene\nIt's important to keep your anal area clean by washing gently with water after passing a bowel motion. Make sure to wipe gently after going to the toilet.\n#### Creams or ointments\n**Pain relief:** To relieve pain and discomfort when passing poos, your healthcare provider may prescribe a local anaesthetic cream or ointment. Using this before going to the toilet can make it more comfortable to go.\nIf the above measures don't help, your doctor may prescribe a cream or ointment to help relax your anal muscles. They also allow more blood flow into the skin to enable the fissure to heal. It's important to continue treatment daily for 4 to 6 weeks to allow the fissure to heal adequately.\n  * **Glyceryl trinitrate****cream (Rectogesic)** : This is usually the first option. This is funded by Pharmac if the fissure has been present for more than 6 weeks. Read more about [Rectogesic.](https://healthify.nz/medicines-a-z/g/glyceryl-trinitrate-rectal)\n  * **Diltiazem cream** : This is another cream that could be prescribed. There's a charge for this as it isn't subsidised by the government.\n\n\n#### Botox and surgery\nYour surgeon could either give you an injection of Botox (botulinum toxin) or offer surgery. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.198829+00:00",
    "source": "healthify"
  }
}