{
  "url": "https://healthify.nz/health-a-z/a/assisted-dying/",
  "title": "Assisted Dying",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Jane Greville, Palliative Care Specialist, Auckland \nLast reviewed: 01 Nov 2024\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/assisted-dying \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Assisted dying\n### Key points about assisted dying\n  * _**This is a sensitive topic. If you are upset by reading this and would like somebody to talk to about it, you can call or text 1737 to speak to a trained counsellor for free.**_\n  * Assisted dying involves a person taking or being given medication to end their life.\n  * There are clear guidelines around who will be able to ask for and receive assisted dying.\n  * Only the person themselves can make the decision about ending their life. They can talk towhānau about it, but nobody else can make that decision for them. \n  * Even if a person starts the process to request assisted dying, they can stop it at any time right up to the time it is about to be administered.\n\n\n![Looking through the trees at Motueka golf course New Zealand](https://healthify.nz/assets/NZ-outdoors/Light-through-trees-Motueka-golfcourse-HN-950x690.jpg)\n####  What is assisted dying? \nAssisted dying is when a person who meets specific criteria under the End of Life Choice Act 2019 is helped to end their own life by taking or being given certain medication. This is done by, or in the presence of, a doctor or a Nurse Practitioner (a specialised nurse). \n",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.708057+00:00",
    "source": "healthify"
  }
}
