{
  "url": "https://healthify.nz/health-a-z/a/asthma-adults/",
  "title": "Asthma Adults",
  "content": "Asthma is thought to be caused by a combination of genetic and environmental factors.\n####    \nGenetic factors\nAsthma and allergies are closely linked. It's been estimated that about 70 to 80% of asthma in Aotearoa New Zealand is associated with allergies. Often people with asthma also have [eczema](https://healthify.nz/health-a-z/e/eczema \"Eczema\") (allergic skin rash) or [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\"), or have close family members who have asthma, eczema or hay fever. The tendency for these 3 conditions to occur together is known as atopy. If you are atopic, allergies can be a trigger for your asthma. \n####    \nEnvironmental factors\nCertain things in our environment thought to have a role in causing asthma include:\n  * allergens\n  * air pollution (including tobacco smoke and petrol fumes)\n  * workplace chemicals. \n\n\n####  What are the symptoms of asthma? \nAsthma is ongoing and your symptoms may come and go.\n#### Common symptoms of asthma include:\n  * difficulty breathing, feeling out of breath or as though you can't get enough air out of your lungs\n  * a tight feeling in your chest like something is squeezing or sitting on your chest\n  * wheezing (a whistling, musical or squeaky noise in your chest)\n  * a cough, which can be worse at night or in the morning.\n\n\nIf you have any of these symptoms, see your healthcare provider so they can assess if this is due to asthma or something else. \nIf you are using a [peak flow meter](https://healthify.nz/health-a-z/p/peak-flow-meter-asthma), a more than 20% day-to-day change in your recordings is a sign of asthma, or that your existing asthma needs better care.   \n  \n\n#### Severe asthma symptoms\nFrom time to time, your symptoms may get gradually, or suddenly, worse – these are called flare ups or exacerbations. Seek urgent medical help if you have any of these severe symptoms:\n  * it's difficult to talk\n  * your lips and/or fingernails have a bluish tinge\n  * your nostrils flare when you breathe\n  * the skin around your neck and/or ribs pulls in when you breathe\n  * your heart is racing\n  * it's hard to walk\n  * your peak flow recordings are muck lower than usual.\n\n**For severe asthma symptoms, you should use your reliever inhaler immediately and call an ambulance on 111 or go to your nearest Accident & Emergency clinic.**  \n---  \n####  What triggers asthma symptoms? \nLearning what triggers your asthma and finding ways to avoid or reduce the effects is an important part of managing your asthma. \nCommon asthma triggers include:\n  * house[dust mite](https://healthify.nz/health-a-z/a/allergy-dust-mites)\n  * [infections of your airways](https://healthify.nz/health-a-z/r/respiratory-tract-infection-topics \"Respiratory infections\"), such as colds and flu \n  * pollen\n  * mould\n  * pets\n  * cigarette smoke\n  * weather, such as change in temperature, cold weather or humid weather\n  * exercise\n  * stress and high emotion\n  * chemicals that irritate the airways, such as sprays, perfumes, cleaning fluids\n  * some medications (read more about[medications that may trigger asthma](https://healthify.nz/medicines-a-z/a/medicines-that-may-trigger-asthma-symptoms \"Medicines that may trigger asthma symptoms\")).\n\n\n####  How is asthma diagnosed? \nAsthma can generally be diagnosed from:\n  * a description of your asthma symptoms now and in the past\n  * listening to your breathing with a stethoscope\n  * checking how your lungs are working with breathing tests, such as a peak flow meter (a device that measures changes in your breathing over the day)\n  * a spirometry test (with a machine that measures lung function) – this may be available at your healthcare provider's practice or you may need to go to your local hospital.\n\n\nMore detailed testing may be required, such as:\n  * a blood test (blood eosinophils and IgE level)\n  * a skin-prick test to test for allergens\n  * [a chest X-ray](https://healthify.nz/health-a-z/x/x-ray#chest-x-ray) to rule out other conditions.\n\n\nOther lung function tests such as an exhaled nitric oxide test (FeNO) or airway challenging testing may be required. If these lung function tests are needed, you'll be referred to a specialist clinic. \nOnce a diagnosis is made, your healthcare provider will prescribe the type of medicines you need to take and should set up an[asthma action plan(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Open external link\"). This plan reminds you how to manage your asthma every day and how to recognise and manage your asthma when your symptoms get worse. Regular peak flow monitoring may help you achieve good control and peak flow reading targets may be included in your asthma action plan. \n####  How is asthma treated? \n#### Aims of treatment\nWhile asthma can't be cured, the correct use of medicine combined with other self-care measures means that symptoms can be well controlled for most people.\n",
  "chunkIndex": 10,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:35.731496+00:00",
    "source": "healthify"
  }
}
