{
  "url": "https://healthify.nz/health-a-z/a/anal-cancer/",
  "title": "Anal Cancer",
  "content": "The most common type of anal cancer (more than 90%) arises from the cells lining the anal canal and is called squamous cell carcinoma.\n![Infographic showing the components of the digestive system](https://healthify.nz/assets/Health-A-Z/Gastrointestinal/Digestive-system-BruceBlausen-wikimedia-commons-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: BruceBlausen Wikimedia Commons_\nThere are some rarer types of anal cancer arising from the cells lining the rectum called adenocarcinomas and occasionally melanomas may occur.\n####  Who is at risk of anal cancer? \nAnything that can increase your risk is called a risk factor. Having one or more of these risk factors doesn’t mean you will develop anal cancer.\nRisk factors include:\n  * Previous HPV conditions, eg, cervical treatment for cervical intraepithelial neoplasia (CIN), abnormal cervical smears.\n  * HIV infection\n  * Immune-modifying drugs such as those for organ transplantation\n  * Cigarette smoking\n\n\nEven if you have no risk factors you can still develop anal cancer, most people who develop anal cancer have none of these risk factors.\n####  What are the signs and symptoms of anal cancer? \nThe symptoms include:\n  * an itchy anus\n  * bleeding from your anus\n  * a lump on your anus which may be uncomfortable\n  * a mucous discharge from your anus\n  * loss of bowel control (bowel incontinence).\n\n\n####  How is anal cancer diagnosed? \nIf you have these symptoms, many of which are similar to those of[haemorrhoids (piles)](https://healthify.nz/health-a-z/h/haemorrhoids), talk to your healthcare provider. They will look at your anus and will take a biopsy (small sample) of any tissue that looks suspicious. If the biopsy confirms a cancer, a number of scans and tests are performed to determine how big the cancer is and to see if it’s spread anywhere else.\n####  How is anal cancer treated? \nMost people with anal cancer are treated with a combination of chemotherapy and radiation given at the same time. . The treatment lasts around 6 weeks and then there’s a recovery period of weeks to months afterwards. The prognosis (likely outcome) of anal cancer is reasonable provided the cancer is confined to the anal area. In this situation more than 80% of people (8 out of 10) will be alive in 5 years.\nSurgery is usually reserved for those whose cancer doesn’t fully disappear after the chemotherapy and radiation. The surgery performed is a big operation called an anterior posterior resection and involves the removal of the anus and rectum. As a result a permanent colostomy is made. Read more about[colostomy.(external link)](https://www.nhs.uk/conditions/colostomy/ \"Open external link\")\n####  How can I prevent anal cancer? \nBecause anal cancer is mostly caused by the human papilloma virus (HPV), the best prevention is getting the HPV vaccination. In Aotearoa New Zealand this is available free to all tamariki and rangitahi up to the age of 26 years. Ideally, vaccination should be done at least 5 years before you become sexually active. Read more about HPV and HPV[vaccination](https://healthify.nz/medicines-a-z/h/hpv-vaccine).\nAs smoking is a risk factor, quitting will reduce your risk.\nRead more about things you can do to[prevent anal cancer(external link)](https://www.analcancerfoundation.org/what-is-anal-cancer/prevention/ \"Open external link\").\n####  More information \nThe following links may provide you with more information about anal cancer:  \n  \n[Anal Cancer(external link)](http://analcancer.co.nz/ \"Open external link\") Anal Cancer Support Services Aotearoa (ACSSA), NZ  \n  \n[Anal Cancer Foundation(external link)](https://www.analcancerfoundation.org/ \"Open external link\")  \n[Anal cancer(external link)](https://www.cancer.org/cancer/anal-cancer.html \"Open external link\") American Cancer Society  \n[Questions to ask your doctor after an anal cancer diagnosis(external link)](https://www.analcancerfoundation.org/wp-content/uploads/2015/04/anal-cancer-questions-9_print1.pdf \"Open external link\") Anal Cancer Foundation\n#### References\n[Anal cancer and anal canal cancer(external link)](https://dermnetnz.org/topics/anal-cancer-and-anal-canal-cancer \"Open external link\") DermNet, NZ  \n[Anal cancer(external link)](https://bowelcancernz.org.nz/about-bowel-cancer/what-is-bowel-cancer/anal-cancer/ \"Open external link\") Bowel Cancer NZ\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[!",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:28.904751+00:00",
    "source": "healthify"
  }
}
