{
  "url": "https://healthify.nz/health-a-z/a/addiction/",
  "title": "Addiction",
  "content": "(Maudsley NHS, UK, 2012)\n  \nThere are lots of reasons why addictions begin, including environmental, social, psychological, biological and inherited factors. Addiction can also be associated with other mental health problems. \nIn the beginning, certain behaviours may seem harmless but over time, harmful patterns of use may develop. \nIt is thought that the biological processes that cause addiction involve the reward centres in your brain. When your brain finds something pleasurable, it creates a positive memory and affects its neurotransmitters (chemicals). This leads to mental and physical changes that increase your motivation to experience that pleasure again.\nIf you’re addicted, these changes in your brain create an urge so powerful that you feel driven to recreate the enjoyable high and/or to escape an unpleasant comedown, no matter what the consequences.\nOften, you will need more and more to achieve the same effect (known as tolerance), causing the addiction to spiral out of control. Running out of the substance can lead to unpleasant effects such as anxiety, insomnia, sweats and other physical symptoms (known as withdrawals) . \nHowever, addiction can also happen without tolerance or withdrawal, and the presence of tolerance or withdrawal doesn't necessarily mean addiction.\n####  What are the signs of addiction? \nOne sign of addiction is a problematic pattern of use that has a negative impact on day to day life. \nChoosing to behave, or use a substance, in a way that limits or damages other parts of your life is a sign of addiction.\nAddictions are often associated with the following feelings and behaviours: \n  * craving and fixation\n  * not being able to stop\n  * secrecy or denial\n  * loss of control over the use or behaviour\n  * increased or excessive use\n  * withdrawal symptoms\n  * sacrificing other commitments so you can continue your addiction\n  * continuing use even though there are negative consequences.\n\n\nThe strain of managing an addiction can seriously damage your work life and relationships.\n####  Check your drug and alcohol use \nFind out the level of harm you may be at risk of if you:\n  * take drugs: [How to reflect on your drug use(external link)](https://thelevel.org.nz/support-and-advice/reflecting \"Open external link\") The Level, NZ\n  * drink alcohol: [Is your drinking okay?(external link)](https://cdn.shopify.com/s/files/1/0897/7910/files/11.0_AL591_Is_Your_Drinking_OK_Feb_2025.pdf?v=1742505941 \"Open external link\") Health New Zealand | Te Whatu Ora, NZ\n\n\n####  What are the risk factors for addiction? \nAddiction is a complicated condition that affects people of all ages, backgrounds and ethnicities. It’s not completely understood what causes some people to be more prone to addiction than others. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.260799+00:00",
    "source": "healthify"
  }
}