{
  "url": "https://healthify.nz/health-a-z/a/amniocentesis/",
  "title": "Amniocentesis",
  "content": "# Amniocentesis\n### Key points about amniocentesis\n  * Amniocentesis is a procedure during pregnancy where a small amount of the fluid (known as amniotic fluid) surrounding the foetus is taken by needle from the womb (uterus) under ultrasound guidance.\n  * The purpose of amniocentesis is to examine the amniotic fluid to check if your baby may have: \n    * a genetic (inherited) condition such as\n    * a medial condition affecting the brain or spinal cord, eg,\n  * The results will also determine the sex of your baby.\n\n\n![Doctor with pregnant woman starting amniocentesis](https://healthify.nz/assets/Health-A-Z/Womens-health/Amniocentesis-woman-with-doctor-Canva-950x690.jpg)\nQR Code Print\n####  What is an amniocentesis? \nAn amniocentesis is a procedure carried out when you're hapū (pregnant) to see if your baby may have a genetic (inherited) condition.\nIt involves taking a small sample of amniotic fluid (the fluid surrounding the fetus) from the womb. It's removed with a needle guided by ultrasound. \nConditions it can be used to check for include:\n  * [Down syndrome](https://healthify.nz/health-a-z/d/down-syndrome)\n  * a blood condition such as [sickle cell anaemia](https://healthify.nz/health-a-z/a/anaemia-sickle-cell)\n  * a medical condition affecting the brain or spinal cord, eg, [spina bifida](https://healthify.nz/health-a-z/s/spina-bifida).\n\n\nThe results will also find out the sex of your baby.\n####  When is an amniocentesis performed? \nWhen needed, an amniocentesis is usually performed around the 15th week of pregnancy. However, if there isn’t enough fluid at that time, it could be put off for a week or two.\nThe test can be recommended by your healthcare provider if you:\n  * have had an abnormal ultrasound, or maternal serum screening test with a result suggesting there is a higher risk of your baby having a genetic condition\n  * have a family history of certain genetic conditions, eg,[cystic fibrosis](https://healthify.nz/health-a-z/c/cystic-fibrosis)\n  * have already had a child/pregnancy with a genetic condition\n  * are aged 35 years or over when your baby is due.\n\n\n####  Is there any preparation needed before the test? \nYou don’t need to change the way you eat or drink before the procedure. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.096740+00:00",
    "source": "healthify"
  }
}