{
  "url": "https://healthify.nz/health-a-z/a/ankylosing-spondylitis/",
  "title": "Ankylosing Spondylitis",
  "content": "This fusing can cause loss of movement of the spine and occasionally can result in a hunched-over posture. For a small number of people, the condition is severe enough for them to stop work or change their employment.\n![ankylosing spondylitis graphic showing joint inflammation](https://healthify.nz/assets/Legacy/4724/ankylosing-spondylitis-diagram-665x443__ResizedImageWzYwMCw0MDBd.jpg)\n_Image credit: 123rf_\n  \nThe name ankylosing spondylitis comes from a combination of Greek words:_ankylos_ _spondylos_ _itis_\nA team of health professionals, including your usual healthcare provider, rheumatologist and physiotherapist, may be involved in your care.\n####  What are the symptoms of AS? (+ VIDEO) \nThe most common symptoms are pain and stiffness in the buttocks, back and neck – often causing you to wake up at night. The stiffness tends to improve once you get moving.\nSymptoms include:\n  * Pain in your buttocks–\n  * Pain in your back or neck – may have a gradual onset but doesn’t go away.\n  * Stiffness or pain in the morning that improves once you start moving.\n  * Feeling better after exercise or a warm shower, and worse after rest.\n  * Sleeplessness – especially in the second half of the night.\n  * Sometimes joints (eg, your knee) and tendons – especially around the ankle – can also be inflamed.\n  * Some people can get inflammation in other places such as the eye, causing a red, painful eye.\n\n\nIf these symptoms last for more than 3 months see your healthcare provider to get them checked. If it's ankylosing spondylitis, getting a management plan can help.\n#### Video: Ankylosing spondylitis symptoms\n(Arthritis New Zealand, 2011)\n####  Who is at risk of getting ankylosing spondylitis? \nThere's a strong tendency for AS to run in families, especially if you have a close relative with it. About half this risk is related to a single gene called HLA-B27. Other risk factors for AS include:\n  * **[Crohn’s disease](https://healthify.nz/health-a-z/c/crohns-disease \"Crohn's Disease\"):** There's a genetic overlap between AS and inflammation of the bowel.\n  * **Being between the ages of 15 and 35:** Symptoms usually develop within this age range – it's rare for people older than 40 years of age to develop it.\n  * **Being male:** Men are generally more severely affected than women – the reasons for this are unknown.\n  * **Smoking:** This tends to make AS worse so stopping smoking may be helpful.\n\n\n####  How is ankylosing spondylitis diagnosed? \nEarly diagnosis of ankylosing spondylitis is important because how its impact on you and your mobility can be reduced with correct management. Although there's currently no cure or prevention for AS, the treatment options have widened in recent years so the condition can be well managed.\nIf you have symptoms of AS, your healthcare provider will refer you to a rheumatologist (A doctor who specialises in inflammatory diseases of the joints and soft tissues).\nThe diagnosis of AS is made from:\n  * an assessment of your symptoms\n  * a physical examination\n  * [blood tests](https://healthify.nz/health-a-z/b/blood-tests)\n  * [X-rays](https://healthify.nz/health-a-z/x/x-ray) or [MRI scans](https://healthify.nz/health-a-z/m/mri-scan).\n\n\nYour rheumatologist will explain the result of each test.\n####  How is AS treated? (+ VIDEO) \nTreatment of AS is provided by a team of health professionals such as:\n  * your GP or nurse practitioner\n  * a rheumatologist\n  * a physiotherapist\n  * an occupational therapist\n  * an orthotist (a healthcare provider who makes and fits braces or splints) when required\n  * a podiatrist (foot doctor) when required.\n\n\n  \nTreatment usually involves medicine to reduce inflammation, together with lifestyle measures.\n#### Video: Managing your ankylosing spondylitis\n####    \nMedicines\nMedicines will decrease inflammation and prevent joint damage. They fall into the following categories.  \n  \n\n**NSAIDs (non-steroidal anti-inflammatory drugs)**\n  * Examples include [ibuprofen](https://healthify.nz/medicines-a-z/i/ibuprofen \"Ibuprofen\"), [diclofenac](https://healthify.nz/medicines-a-z/d/diclofenac \"Diclofenac\") and [naproxen](https://healthify.nz/medicines-a-z/n/naproxen \"Naproxen\").\n  * These are usually the first medicines prescribed in the treatment of AS. NSAIDs can lessen pain and stiffness by reducing inflammation.\n  * For most people, taking NSAIDs is safe. However, extra care is needed if you have stomach ulcers or kidney problems. Read more about[NSAIDs](https://healthify.nz/medicines-a-z/n/non-steroidal-anti-inflammatories-nsaids \"Non-steroidal anti-inflammatories \\(NSAIDs\\)\").\n\n\n**Pain relievers**\n  * Pain relievers such as [paracetamol](https://healthify.nz/medicines-a-z/p/paracetamol \"Paracetamol\")\n\n\n**Corticosteroids (also called steroids)**\n  * These are used to reduce the pain and inflammation usually while waiting for other medication to take effect. They may also be used to treat sudden flare-ups but are not usually needed after the flare-up has settled.\n  * Steroids may be given as tablets, such as prednisone, or as injections directly into the joint itself or into the muscle or vein.\n\n\n**Biologic medicines (also called biologics)**\n  * These are the latest disease-modifying medicines used for treating severe AS and can be very effective for people who are severely affected. They're given by injection.\n  * The biologics that can be used for AS include [adalimumab](https://healthify.nz/medicines-a-z/a/adalimumab), [etanercept](https://healthify.nz/medicines-a-z/e/etanercept) and [infliximab](https://healthify.nz/medicines-a-z/i/infliximab). They are also called TNF inhibitors.\n  * Other kinds of biologics are used to treat AS but they're not currently available in Aotearoa New Zealand. \n\n\n####  Self-care (+ APPS) \nLifestyle measures are also helpful in AS. \n####    \nMaintain a good posture\nTry to maintain an upright posture when standing and sitting. People with AS have a tendency to bend forwards and stoop and this may impact negatively on your spine’s function.\n  * When standing, keep your body weight balanced and even on both feet with shoulders relaxed, back and down.\n  * Keep the back of your neck long, allowing your chin to drop slightly forwards.\n  * Don't stand still for too long and when moving, try to maintain this tall, relaxed posture.\n\n\nSpecially designed chairs and supportive cushions are available to help maintain correct posture while driving or sitting at a desk and simple devices are available to make gardening easier.\n####    \nKeep moving\nMake a habit of [being physically active](https://healthify.nz/hauora-wellbeing/p/physical-activity \"Physical activity\"). Performing exercises that are designed to stretch tight muscles and ligaments encourages full mobility and strengthens postural muscles.\n  ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:31.257149+00:00",
    "source": "healthify"
  }
}