{
  "url": "https://healthify.nz/health-a-z/a/arthritis-and-exercise/",
  "title": "Arthritis And Exercise",
  "content": "You need access to classes. \n####  How to get started \nIf you are starting out with exercise or are beginning after an injury, illness or flare up, our advice is start low, make it slow and keep it short. For example if you start with a 15 minute walk, doubling it to do 30 next time is too much – 20 minutes would be more appropriate. By building up the intensity and duration in small increments you'll be much less likely to have pain and discomfort.\n  * **Start low:** This relates to the the weight or loading that you use. If you're using weights, start with something that after 10 to 12 repeats is beginning to feel challenging but not impossible.\n  * **Make it slow:** Perform your exercises or stretches slowly and with control to ensure your technique is correct.\n  * **Keep it short:** This relates to the activity duration whether it's taking a walk, swimming or lifting weights. Start with a time that doesn't leave you too tired and build up by no more than 10 to 20% a time.\n  * **Keep a record:** This can be really helpful to track progress, see patterns that you can learn from and provide you with motivation when you see how you've improved over time.\n\n\nHere's Arhtritis New Zealand's range of exercise videos on the [Arthritis New Zealand YouTube channel(external link)](https://www.youtube.com/playlist?list=PLR0yEdIFdDkfCuJ63XvvGRfQTgcYmXB8R \"Open external link\").\n####  How to stay motivated and keep going (+ APPS) \n#### Here are some motivational tips and tricks that have helped others living with arthritis:\n  * **List why you should exercise****want** to. Take a piece of paper and make 2 columns. In one column list all the reasons you should exercise and in the other all the reasons you want to exercise. ",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.102436+00:00",
    "source": "healthify"
  }
}
