{
  "url": "https://healthify.nz/health-a-z/a/addiction/",
  "title": "Addiction",
  "content": "Your treatment plan will depend on the type of addiction.\nIn general, addiction treatment options include:\n  * talk therapy\n  * inpatient rehabilitation\n  * outpatient treatment programmes\n  * medication\n  * support groups\n  * self-help programs\n  * lifestyle changes\n  * therapeutic community living.\n\n\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps), [problem gambling apps](https://healthify.nz/health-a-z/a/addiction), and [quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps). There's also a Just a Thought course to help you think about [changing your drug and alcohol use](https://healthify.nz/apps/a/alcohol-and-drug-support-thinking-about-change). \n####  What can I do to support my recovery from addiction? \nRecovery means different things to different people. There is no one definition and, like most things, one size doesn’t fit all. It can be helpful to think of recovery as a process of change as people improve their health (hauora) and wellbeing and work towards reaching their full potential. \nImproving your health involves\n  * physical (taha tinana)\n  * mental and emotional (taha hinengaro)\n  * spiritual (taha wairoa)\n  * and family/social (taha whānau).\n\n\n####    \nKey things that have been shown to be important\nAn experienced addiction specialist, Dr Stephen Melemis has identified 5 key 'rules of recovery'. Here's a summary.\n  * **Change your life** – as well as stopping using, it's important to create a new way of life that provides support, and makes it easier for you not to use. It might mean avoiding certain places, people or things associated with using. Think of it as an opportunity for change and being happier than you were before. \n  * **Be honest** – with yourself and others close to you. It’s common for people to hide their use and the consequences of that use from others. Being open and truthful about your substance use can be difficult but with a network or circle of people you can trust (eg, your whānau, healthcare provider, counsellor, support-group, sponsor) you can start to be honest about what is happening for you. It’s also important to be selective about who you tell and what you tell as some people may not have your best interests at heart. Over time you will find the people you can truly trust to be honest with. Most importantly, be honest with yourself.\n  * **Ask for help** – recovery is more likely to be successful if you have the right sort of support along the way. Taking part in a substance abuse programme and joining a self-help group is an effective combination. Actively taking part in a self-help group, such as [Alcoholics Anonymous (AA)(external link)](https://aa.org.nz/ \"Open external link\") or [Narcotics Anonymous (NA)(external link)](https://nzna.org/ \"Open external link\") can provide several benefits, it can help you: \n    * know you're not alone\n    * hear what the voice of addiction sounds like when other people talk about it\n    * find out what other people have tried and what coping skills work for them\n    * know there's a safe place to be where you won't be judged.\n  * **Practice self-care** – addiction often comes from the need to escape, relax or reward yourself. It helps to be able to acknowledge this and look for healthier ways to do those things. Guilt about addiction can make you think you don't deserve good things but self-care and being good to yourself is a necessary part of being good to others. It's not selfish to take what you need to care for yourself. \n  * **Self-care (mind-body relaxation)** – taking time to learn and practice mind-body relaxation techniques (eg, yoga, progressive muscle relaxation, structured breathing and visualisation) helps to release stress and let go of negative thinking – both of which can lead to substance use. Finding time to relax is an important part of ongoing self-care. \n\n\n  \nThe following may help you in your recovery:\n  * Attend your medical and therapeutic appointments.\n  * Create a network of people who can support you while you overcome addiction, including self-help groups.\n  * Learn about the addiction and its treatment.\n  * Take any medicines as prescribed and talk to your prescriber before stopping them..\n  * Healthy diet and exercise.\n  * Reducing life stressors and learning how to cope with stress to avoid relapse.\n  * Getting additional addiction treatment help when you need it.\n\n\n####  VIDEOS: Recovery stories \n#### Video: Broken bad – 11 years of meth addiction  \n  \n\n(RNZ, 2018)\n#### Video: Addiction and trust: Marc Lewis at TEDxRadboudU\nA former drug addict himself, Lewis now researches addiction. In order to get over one's addiction, he explains, self-trust is necessary.   \n  \n\n(Tedx Talks, 2013)\n  \nYou can watch a video called [Memo to Self(external link)](https://vimeo.com/347596435/deaf56bbea \"Open external link\") where Dr. Kevin McCauley re-lives his own early sobriety.\n####  Support \nAddiction is a treatable condition. You don’t have to deal with addiction on your own – there are resources, helplines, support groups, websites and counsellors available.\n",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.260799+00:00",
    "source": "healthify"
  }
}
