{
  "url": "https://healthify.nz/health-a-z/a/anaemia-sickle-cell/",
  "title": "Anaemia Sickle Cell",
  "content": "Haemoglobin is in your red blood cells and it carries oxygen around the body. Normal red blood cells are flexible and disc-shaped, but in sickle cell disease they can become rigid and shaped like a crescent or sickle. These cells also don't live as long as normal red blood cells. \nThese changes means that your haemoglobin cannot carry as much oxygen. This can cause symptoms of [anaemia](https://healthify.nz/health-a-z/a/anaemia \"Anaemia\") as your body cannot get the oxygen it needs. This is known as sickle cell anaemia. \n![Normal and sickle cell red blood cells](https://healthify.nz/assets/Health-A-Z/Anatomy-other/Sickle-cell-anaemia-Wikimedia-Commons-Bruce-Blaus-800x800__ResizedImageWzYwMCw2MDBd.png)\n_Image credit: Bruce Blaus via[Wikimedia Commons(external link)](https://commons.wikimedia.org/wiki/File:Sickle_Cell_Anemia.png \"Open external link\")_\n####    \nHow common is sickle cell anaemia?\nNearly all people with sickle cell disease have anaemia. Sometimes the anaemia can be severe and then it is life-threatening as it can cause serious problems if left untreated.\n####  What are the symptoms of sickle cell anaemia? \nSymptoms of sickle cell anaemia can be seen at different stages of the disease. They include:\n  * feeling tired or having little energy (lethargy)\n  * feeling faint and dizzy\n  * looking pale, having pale skin\n  * being short of breath or feeling breathless\n  * headaches\n  * faster heart rate or a thumping heart (palpitations)\n  * cold hands or feet\n  * lack of concentration\n  * slow growth\n  * delayed puberty\n  * heart failure.\n\n**Seek urgent medical help if:**  \n---  \nYou have symptoms of severe anaemia such:\n  * being short of breath or feeling breathless\n  * feeling faint and dizzy\n  * looking pale, having pale skin.\n\nCall Healthline 0800 611 116 if you are unsure about what to do.  \nSickle cell anaemia can get worse when you have another infection such as[slapped cheek disease](https://healthify.nz/health-a-z/s/slapped-cheek-disease \"Slapped cheek disease\") (parvovirus) or if you are pregnant.\n####  What is the treatment for sickle cell anaemia? \nThe treatment for the anaemia depends on how severe it is. It can include:\n  * [Folic acid supplements](https://healthify.nz/medicines-a-z/f/folic-acid \"Folic acid\") – to help the body make new red blood cells. It can be useful if you have a restricted diet such as a vegetarian or vegan diet.\n  * [Blood transfusions](https://healthify.nz/health-a-z/b/blood-transfusion \"Blood transfusion\")\n  * [Hydroxycarbamide](https://healthify.nz/medicines-a-z/h/hydroxyurea \"Hydroxycarbamide\") – this medicine stops red blood cells from changing to a sickle shape. \n\n\nAnaemia caused by sickle cell disease is not the same as[iron deficiency anaemia](https://healthify.nz/health-a-z/i/iron-deficiency \"Iron deficiency\") and is not caused by having too little iron in your blood. Do not take iron supplements without speaking to your doctor. Extra iron in your body can damage your organs.\n####  How is sickle cell anaemia monitored and possible complications \n#### How is sickle cell anaemia monitored?\nYour doctor will monitor your blood levels regularly. Your blood tests can also measure how many red blood cells you have and how well they are working.\n####  Possible complications\nIf anaemia is left untreated it can damage organs in your body because your blood can't get enough oxygen to them. \n####  Self-care \n#### Avoid infections\nYou are at extra risk of infections when you have sickle cell disease, so it is important to be up to date with all of your vaccinations, practice [good hand cleaning hygiene](https://healthify.nz/hauora-wellbeing/h/hand-washing \"Hand washing\") and [good food hygiene.](https://healthify.nz/hauora-wellbeing/f/food-safety \"Food safety\") If you are travelling to an area where malaria is found, it's important to take antimalarial medication as well as extra food and water precautions.\n#### Avoid situations that can trigger a crisis\nAnaemia can lead to a [sickle cell crisis](https://healthify.nz/health-a-z/s/sickle-cell-disease) which can happen when sickle cells block the flow of blood causing symptoms such as pain, tiredness, jaundice, dizziness, headache and fever. Avoid triggers of a crisis which may include cold, dehydration, and tiredness.\n#### Seek help and support  \n\nYou are not alone. It is important to seek help and support for your condition. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:28.030651+00:00",
    "source": "healthify"
  }
}