{
  "url": "https://healthify.nz/health-a-z/a/amenorrhoea/",
  "title": "Amenorrhoea",
  "content": "Your period is the time when the blood, cells from the lining of your uterus and mucus are coming out.\n####    \nWhat is the menstrual cycle?\nYour menstrual cycle is the changes in hormones, and changes in your uterus and ovaries, that make pregnancy possible. Your cycle goes from the first day of your period (the first day you wake with bleeding) to the first day of your next period.\n####    \nVideo: Menstruation – what to expect   \n  \n\n(AMAZE, US, 2018)\n####  What should I expect when I get my period? \nEverybody's menstrual cycle is a bit different. The range of what's normal is wide, but there are some common features.\n####    \nStarting age (menarche)\n  * Periods generally start between 9 and 14 years of age. This is often about 2 years after your breasts first start to develop and about a year after you start to grow pubic hair.\n  * You often start your period at a similar age to others in your family – if you can, find out when your mother, sister or grandmother started.\n\n\n####    \nMenstrual cycle pattern\n  * Periods are often not regular when they first start, but generally settle into a regular pattern after about 3 years.\n  * Some people never have a regular cycle.\n  * Periods occur anything from every 21 to every 35 days.\n  * The commonly quoted cycle of 28 days only happens for about 1 woman in 10.\n  * The first day you wake up with bleeding is counted as day 1 of your menstrual cycle. \n  * Your period comes 14 days after you ovulate (release an egg from one of your ovaries).\n  * If you have a 28 day cycle, you ovulate around day 14 and have a period 14 days later (if you're not [pregnant](https://healthify.nz/hauora-wellbeing/p/pregnancy \"Pregnancy\")).\n  * If your cycle is 35 days long, then you are likely to ovulate around day 21. If your cycle is 21 days long, then you probably ovulate around day 7, close to the end of your period.\n  * If you want to prevent a pregnancy, you need to use [contraception](https://healthify.nz/health-a-z/c/contraception \"Contraception\") throughout your cycle. This is because the timing of ovulation can be unpredictable which means you can become pregnant at unexpected times.  \n  \n  \n\n\n\n![Graphic showing the stages of the menstrual cycle](https://healthify.nz/assets/Health-A-Z/Womens-health/Stages-of-menstrual-cycle-Depositphotos-800x800__ResizedImageWzYwMCw2MDBd.png)\n  \n_Image credit: Depositphotos_\n####    \nBlood loss\n  * During each period you lose 30 to 40 mL of blood and fluid (about 2 to 3 tablespoons), but it can look like more. \n  * Bleeding can last anywhere from 3 to 7 days – 5 days is the average.\n  * Bleeding is generally heaviest for the first day or two then lighter over the next day or two and your period may finish with a day or so of spotting (very light bleeding)\n  * The blood and fluid are often red when your flow is heaviest, and brown or black when flow is light, which can be at the beginning or particularly the end of your period.\n  * Some people do bleed more heavily, read more about [heavy periods for young people](https://healthify.nz/health-a-z/h/heavy-periods-young-people) and in [adults](https://healthify.nz/health-a-z/p/periods-heavy-bleeding).\n\n\n####    \nTissue loss\nThe blood you lose doesn't usually clot, but small amounts of tissue shedding from the lining of your uterus can look a bit like clots and this is normal. Clots are dark red and are generally passed when your bleeding is heavy. Tissue from your uterus is lighter coloured. Another way to tell the difference is if you squeeze them between bits of toilet paper, clots will break up and bits of tissue won't. \n####    \nOther symptoms\nPainful periods are common, especially for younger women. This often feels like cramping in your lower abdomen (tummy) or pelvis (the area between your hip bones). For most women the pain is mild.\nYou may also have 1 or more of the following:\n  * abdominal bloating\n  * lower back pain\n  * sore breasts\n  * food cravings\n  * mood swings and irritability\n  * [headache](https://healthify.nz/health-a-z/h/headache \"Headache\") and [fatigue](https://healthify.nz/health-a-z/f/fatigue \"Tiredness and fatigue\").\n\n\nRead about [premenstrual syndrome](https://healthify.nz/health-a-z/p/premenstrual-syndrome-pms) which can occur in the days leading up to your period.\n####    \nApproaching menopause\n  * Menopause is the time when your body stops preparing for a pregnancy each month and your periods stop.\n  * As you approach menopause (a time called perimenopause), your periods may become more irregular again.\n  * Periods tend to finish between the ages of 45 and 55. However they can stop earlier, for no apparent reason, or due to some medicines or surgery. If your periods stop between the ages of 40 and 45 it's called early menopause and if they stop before the age of 40 it's called premature menopause. \n\n\nRead more about [menopause](https://healthify.nz/hauora-wellbeing/m/menopause) and [early menopause](https://healthify.nz/hauora-wellbeing/m/menopause-early).\n####  What if I have a period problem? \nSee your healthcare provider or visit a [Sexual Wellbeing Aotearoa clinic(external link)](https://sexualwellbeing.org.nz/find-a-clinic/ \"Open external link\") if you have any of the following period problems.\n####    \nPeriods starting before 8 years of age\nIf your child shows signs of puberty or gets a period before the age of 8 make an appointment to see your GP or nurse practitioner. Early puberty can have serious health and social effects.\n####    \nNo periods\nIf you have a uterus, it's normal not to have periods:\n  * before you reach puberty\n  * when you're pregnant\n  * if you're breastfeeding (however, breastfeeding doesn't necessarily prevent pregnancy)\n  * if you've reached menopause\n  * if you take the combined oral contraceptive hormone pills every day (missing the 7 non-hormonal pills in the packet and going straight on to the next set of hormone pills from a new packet).\n\n\nHowever, if you're not having periods and you don't fit into any of the groups listed above, it's known as amenorrhoea. There are 2 categories of amenorrhoea:\n  * primary amenorrhoea –\n  * secondary amenorrhoea\n\n\nAmenorrhoea may be caused by:\n  * strenuous exercise\n  * [stress](https://healthify.nz/health-a-z/s/stress \"Stress\")\n  * some medicines, including the oral contraceptive pill (it can take 3 to 6 months to start having normal periods again after stopping the pill)\n  * chronic illness\n  * problems with your ovaries\n  * hormonal imbalances such as [polycystic ovarian syndrome (PCOS)](https://healthify.nz/health-a-z/p/polycystic-ovary-syndrome \"Polycystic Ovary Syndrome\"), or problems with your thyroid gland, hypothalamus (the part of your brain that helps regulate your menstrual cycle) or pituitary gland\n  * anatomical problems with your uterus, cervix or vagina\n  * the absence of puberty\n  * [depression](https://healthify.nz/health-a-z/d/depression-overview \"Depression\") and some other forms of mental illness\n  * low body weight, eg, due to an eating disorder..\n\n\nIf your lack of periods (amenorrhoea) is because you're not ovulating (releasing an egg from one of your ovaries each menstrual cycle), you may find it difficult to get pregnant. You may also be at risk of [osteoporosis](https://healthify.nz/health-a-z/o/osteoporosis \"Osteoporosis\") (weak bones).   \n  \nSee your healthcare provider if you're not having periods (except for the normal reasons listed above). There are different treatment options available, depending on the cause of your amenorrhea. \n####    \nBleeding between periods\nIt’s not normal to bleed between your periods or after sexual intercourse, so see a healthcare provider if you experience either of these. Read about [abnormal vaginal bleeding](https://healthify.nz/health-a-z/v/vaginal-bleeding-abnormal).\n####    \nLate or irregular periods\nA late period is when you have more than 35 days between periods, and an early period is one that comes less than 21 days after the start of your last period.\nPregnancy is one reason why your period might be late. ",
  "chunkIndex": 10,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.246959+00:00",
    "source": "healthify"
  }
}
