{
  "url": "https://healthify.nz/health-a-z/a/angiography/",
  "title": "Angiography",
  "content": "# Coronary angiography\n### Key points about coronary angiography\n  * A coronary angiography is an X-ray procedure or test to examine the arteries of your heart.\n  * An angiography provides information on any narrowing in the coronary arteries (how much and where).\n  * The X-ray images are called coronary angiograms.\n  * Sometimes other tests or procedures are done at the same time, eg, measuring blood pressure inside your heart, checking its functioning, or angioplasty to place a stent in a narrowed artery.\n\n\n![Older man having heart checked with stethoscope](https://healthify.nz/assets/Health-A-Z/Healthcare/Older-man-having-heart-checked-canva-950x690.jpg)\nQR Code Print\n####  What is coronary angiography? \nA coronary angiography is an X-ray procedure or test to examine your coronary arteries. It provides information on any narrowing in your these arteries, such as how much narrowing there is and where it is.\n#### What are the coronary arteries?\nThe coronary arteries supply your heart muscle with vital blood and oxygen so that your heart can pump blood around the body. The results of the angiography will help your doctor decide what treatments, if any, are best for you.\n####  How will I be prepared for the angiography? \nYou will usually be seen at a pre-admission clinic some days or weeks beforehand. This allows baseline tests such as blood tests, an [electrocardiogram](https://healthify.nz/health-a-z/e/electrocardiograph-ecg) (ECG), and a [chest X-ray](https://healthify.nz/health-a-z/x/x-ray#chest-x-ray) (if needed) to be done.\nMake sure you know what food and drink you can have the night before and on the day of the angiography.\nAlso double check what medications to take, and if you need to withhold any for the procedure. Make sure you bring all your medications with you into hospital.\n####  Will I be admitted to hospital? \nWhen having a coronary angiography, you will usually be admitted to hospital for the day. If you go on to have a procedure such as [angioplasty](https://healthify.nz/health-a-z/a/angioplasty), you may need to stay in hospital overnight.\n  * The doctor or nurse will explain the procedure and any risks, and will answer any questions.\n  * They will ask about your medical history and note your allergies and medications.\n  ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.596519+00:00",
    "source": "healthify"
  }
}
