{
  "url": "https://healthify.nz/health-a-z/a/abdominal-pain-in-children-chronic/",
  "title": "Abdominal Pain In Children Chronic",
  "content": "Use distraction instead.\n  * Let your child know that their pain will improve and encourage them to continue their normal activities.\n  * Encourage your child to go to school. Chronic tummy pain usually happens in the morning and lasts less than an hour, so take your child to school when the pain starts to settle.\n  * Encourage good sleep habits as poor sleep can make symptoms worse. Read about [sleep and relaxation tips(external link)](https://thesleepcharity.org.uk/information-support/children/relaxation-tips/ \"Open external link\") for children.\n  * Talk to your child’s teachers and discuss a plan to manage your child’s tummy pain in school. \n  * If you can, talk to your child to see if there’s anything that’s causing them to feel worried or stressed. Common things that cause stress in children include how they’re doing at school, [bullying](https://healthify.nz/hauora-wellbeing/b/bullying-children-teens), friendships, worries/changes at home, their appearance, or a family illness. If your child has any worries that are causing them to feel stressed, talk with them or with their healthcare provider or teachers to find ways to help them overcome these.  \n  \n\n\n\n![Wahine playing withy tamariki](https://healthify.nz/assets/Maori-and-Pasifika-people-/Maori-wahine-with-two-tamariki-canva-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Canva_\nYour healthcare provider will also ask you and your child to come to regular follow-up appointments to make sure that your child's pain is settling. If your child's pain gets worse or new symptoms appear, tell your healthcare provider as this may mean that there’s an underlying condition causing your child’s tummy pain. \n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [pain management apps](https://healthify.nz/apps/p/pain-management-apps).\n####  What is the outlook for a child with chronic tummy pain? \nChronic tummy pain is common in children. ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:17.791070+00:00",
    "source": "healthify"
  }
}