{
  "url": "https://healthify.nz/health-a-z/a/arthritis-children/",
  "title": "Arthritis Children",
  "content": "The symptoms of JIA vary from person to person and can come and go from day to day and week to week. Symptoms will be worse during occasional ‘flares’; at other times the condition seems to disappear for a time.\nJoints are sore and swollen because in JIA, the immune system attacks the synovium, the thin membrane that lines the joints and makes a fluid that helps them move smoothly. If inflammation is not treated, it can damage, joints, cartilage and bones and weaken muscles around the joint.\nThe image below shows a joint with the synovial lining, tendon and cartilage labelled.\n![Labelled joint showing location of tendon, cartilage and synovial lining](https://healthify.nz/assets/Health-A-Z/Musculoskeletal/Joint-with-labels-Madhero88-wikimedia-commons-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Madhero88 via[Wikimedia Commons(external link)](https://creativecommons.org/licenses/by-sa/3.0 \"Open external link\")_\n####    \nVideo: What is juvenile idiopathic arthritis?  \n  \n\n(Arthritis NZ, 2021)\n####  Who gets JIA and why? \nJIA is more common in girls than boys and can occur at any age under 16. The exact causes are not known – current research indicates that genetic factors may play a part and infection or viruses may trigger the condition.\n####  Warning signs and symptoms of JIA \nJIA usually affects the knees, hips, hands and feet, although other joints may be involved as well.\nSymptoms include:\n  * joint pain, swelling, tenderness, stiffness, redness and warmth\n  * fatigue, fevers, loss of appetite or weight, and generally feeling unwell\n  * skin rashes\n  * swelling in lymph glands\n  * inflammation of the eyes ([uveitis](https://healthify.nz/health-a-z/u/uveitis)) and other organs of the body.\n\n\n####  What are the types of juvenile idiopathic arthritis? \n####  Most common types of JIA   \n  \n\n  * **Oligoarthritis** (from ‘oligo’ meaning few) occurs when up to 4 joints are affected, usually the knees and ankles. Children may also develop eye inflammation (iritis or [uveitis](https://healthify.nz/health-a-z/u/uveitis)).\n  * **Polyarticular** (from ‘poly’ meaning many). This type involves 5 or more joints, with the same joints on each side of the body affected, including fingers, toes, wrists, ankles, hips, knees, neck and jaw.\n\n\n####  Other, less common, types of JIA   \n\n  * **Systemic onset JIA** (also known as Still’s disease). This usually includes fevers and rashes, and may cause inflammation of the internal organs. Symptoms may be confused with other childhood diseases, eg, [measles](https://healthify.nz/health-a-z/m/measles) or [glandular fever](https://healthify.nz/health-a-z/g/glandular-fever).\n  * **Enthesitis-related arthritis****(ERA)** describes inflammation of the ligaments and tendons around the joints. It most commonly affects the spine, heel, hips, knees and ankles.\n  * **Psoriatic arthritis** can affect any number of joints and is usually associated with [psoriasis](https://healthify.nz/health-a-z/p/psoriasis), a scaly skin rash that may also affect the nails.\n\n\n",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.192046+00:00",
    "source": "healthify"
  }
}
