{
  "url": "https://healthify.nz/health-a-z/a/allergy-dust-mites/",
  "title": "Allergy Dust Mites",
  "content": "Managing the dust mite allergy will often reduce the frequency and severity of asthma symptoms.\nOther complications include:\n  * sleep disturbance\n  * fatigue and tiredness\n  * poor concentration\n  * poor memory\n  * irritability\n  * missed days of work or school. \n\n\n####  How is an allergy to dust mite diagnosed? \nThe symptoms of dust mite allergy can be similar to other conditions that might affect your nose, such as the common cold or nasal polyps. See your doctor to confirm whether your symptoms are due to dust mite allergy or some other condition.\nYour doctor will ask you about your symptoms, and their relation to any common allergens. They will also examine your eyes, nose and throat for signs of irritation and congestion. \nIf you think you may be allergic to dust, or dust mite, ask your doctor for a skin prick test to help find out what is triggering your allergy. The skin prick test is done by applying drops of different allergens (such as dust mite extract) onto your forearm skin.\n  * These are numbered so the tester knows which is which.\n  * Then a tiny prick is made within each drop of extract.\n  * You then need to wait for 15 minutes – if you are allergic an itchy red bump (like an insect bite) will appear at the site.\n\n\n####  How is an allergy to dust mite treated? (+ APPS) \nThe best treatment for dust mite allergy is antihistamines and nasal sprays and desensitisation. Total avoidance of dust mite is impossible, but here are a few tips on how to reduce house dust mite populations:\n#### Ventilation\n  * Dust mites thrive in a moist environment. Keep household moisture levels low with a dehumidifier or ventilation system.\n  * Keep bedroom windows open where possible (in spring those with pollens allergies will want them closed).\n  ",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.693314+00:00",
    "source": "healthify"
  }
}