{
  "url": "https://healthify.nz/health-a-z/a/acne/",
  "title": "Acne",
  "content": "In acne, the glands produce too much oil (sebum) which mixes with dead skin cells or bacteria to form a plug in the follicle.\nNormally harmless bacteria that live on your skin can contaminate and infect the blocked follicles, causing pimples, pustules, nodules or cysts.\n![Different stages of acne](https://healthify.nz/assets/Health-A-Z/Skin-topics/Stages-of-acne-brgfx-freepix-665x443__ResizedImageWzYwMCw0MDBd.jpg)\n_Image credit: brgfx on Freepik (amended)_\nAcne is usually caused by hormonal changes that occur during puberty, but it can start at any age.\n####    \nWhat else can cause acne?\n  * If you menstruate (have periods), or are undergoing menopause, you may notice your acne flares up just before your period, due to changes in sex hormones (eg, oestrogen).\n  * Hormonal changes related to pregnancy, stopping or starting oral contraceptives and conditions like polycystic ovary syndrome can also cause adult acne for some people.\n  * Acne can run in families. If your parents had problems with acne, it's more likely you will too.\n  * Acne can be made worse by some medicines, eg, steroids, lithium (used to treat depression and bipolar disorder), some forms of contraceptives (eg, Mini-Pill, Jadelle, Depo Provera), and some anti-epileptic medicines.\n  * Some cosmetic products might cause acne to flare up, although it’s less common with ‘non-comedogenic’ products – products designed so that so they don’t cause spots.\n  * Pressure from headbands and chinstraps (used by violin and viola players).\n  * Smoking might contribute to acne in older people.\n  * Diets with a high glycaemic index. Acne is reported to be less common in people with a lower glycaemic index diet.\n  * Eating a lot of dairy products, meat protein and sugars can make acne worse for some people.\n  * There's some evidence that stress and depression can make acne worse.\n\n\n####    \nWhat doesn't cause acne?\n  * While there’s not enough evidence about chocolate’s role in acne, eating too much of it can lead to weight gain – a known risk factor for acne.\n  * Acne is not infectious – you can’t pass it on to other people.\n  * Having sex or masturbating will not make acne better or worse.\n  * Having dirty skin and poor hygiene doesn’t cause acne – most of the biological reactions that trigger acne occur beneath your skin.\n\n\n####  How bad is my acne? \nYour healthcare provider can diagnose acne by looking at your skin. How bad (severe) it is, will determine what treatment you might have.\n  * Mild – mostly whiteheads and blackheads, with a few pustules.\n  * Moderate – more widespread whiteheads and blackheads, with many pustules and some cysts.\n  * Severe – lots of large, painful pustules and deep cysts; you might also have some scarring.\n\n\n####  How is acne treated? (+ APPS) \nEveryone wants to get rid of acne as quickly as possible, but it might take several months of treatment before your acne improves. However, with the right treatment, you should see results along the way.\n**Tip:** Talk to your healthcare provider or pharmacist first, to get professional advice. Using the wrong acne products or skincare range (or following the advice of a celebrity in an advertisement) might make your acne worse.\n  * For mild acne, over-the-counter creams, pimple patches or gels from your pharmacist might be a good place to start.\n  * Talk to your pharmacist about a simple, acne-friendly skincare range (eg, Cetaphil). For some people with mild acne, a cleanser with salicylic acid might be all you need.\n  * If using these products or getting help from your pharmacy doesn’t work, your healthcare provider might give you prescription medicine, eg: \n    * topical retinoids\n    * topical antibiotics\n    * antibiotic tablets (oral antibiotics)\n    * for women, the combined oral contraceptive pill\n    * Spironolactone\n    * [Isotretinoin](https://healthify.nz/medicines-a-z/i/isotretinoin)\n\n\nRead more about [medicines used to treat acne](https://healthify.nz/medicines-a-z/a/acne-treatment).\nYour healthcare provider might also refer you to a skin specialist or dermatologist.\nOther non-pharmaceutical treatments for acne are:\n  * Photodynamic therapy where light is applied to the skin to improve acne (eg, laser).\n  * Chemical peels where a solution is applied to your face causing the skin to peel off.\n\n\nResults vary, so always consult with your healthcare provider first.\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [skin check apps](https://healthify.nz/apps/s/skin-check-apps).\n####  Acne skin care tips \n  * Keep your skin clean with a gentle, non-abrasive cleanser.\n  * Don’t scrub your skin but use your fingertips to gently wash your face once or twice a day.\n  ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:19.050657+00:00",
    "source": "healthify"
  }
}
