{
  "url": "https://healthify.nz/health-a-z/a/allergies/",
  "title": "Allergies",
  "content": "####  What causes allergies? \nWhile you don’t inherit an allergy directly, you may inherit a tendency to be allergic and develop allergic diseases. This tendency is called being atopic. Allergies start only if you are exposed to an allergen. Once you develop a sensitivity to an allergen, an allergic response is set off every time you're exposed to the allergens that affect you. \n####  What are the common allergens? \nSubstances in the environment that can cause an allergic reaction are called allergens. Common allergens include:\n  * the droppings of house dust mites \n  * pollen, particularly from grass, trees and weeds\n  * animal dander (skin, scales or flakes from animals)\n  * metals, such as nickel in watch bands, earrings or belt buckles\n  * latex in rubber products\n  * some moulds\n  * insect bites and stings\n  * household chemicals such as those in hair dyes and detergents\n  * medicines\n  * foods such as peanuts, dairy, eggs and seafood.\n\n\nTrue[food allergies](https://healthify.nz/health-a-z/f/food-allergies \"Food allergies\")[the difference between food allergies and food intolerance](https://healthify.nz/health-a-z/f/food-allergy-or-intolerance).\nCigarette smoke is often thought to cause allergies, but it's actually an irritant rather than an allergen. That means it doesn’t cause an allergy, but makes an existing allergy worse.\n####  What are the types of allergic conditions? \nDepending on the type of allergens and where allergens enter your body, they can cause different allergic reactions and conditions. These include:\n  * allergic rhinitis ([hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\"))\n  * allergic contact[dermatitis](https://healthify.nz/health-a-z/d/dermatitis \"Dermatitis\") ([eczema](https://healthify.nz/health-a-z/e/eczema))\n  * [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\")\n  * [asthma](https://healthify.nz/health-a-z/a/asthma-topics \"Asthma\")\n  * [food allergies](https://healthify.nz/health-a-z/f/food-allergies \"Food allergies\")\n  * [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")\n\n\n####  What are the symptoms of an allergic reaction? \nSymptoms depend on where allergens enter your body and which part of your body is affected. They can range from mild to severe. Typically, symptoms happen within minutes to an hour after you are exposed to a particular allergen.\n  * [Hay fever](https://healthify.nz/health-a-z/h/hay-fever) (also known as allergic rhinitis) affects your eyes and nose when you inhale allergens. Symptoms include sneezing, runny nose, watery and itchy eyes, irritated and itchy throat and, sometimes, a stuffy, blocked nose.\n  * Allergic contact[dermatitis](https://healthify.nz/health-a-z/d/dermatitis \"Dermatitis\")\n  * Allergies to some foods, insect bites or stings can cause[hives (urticaria)](https://healthify.nz/health-a-z/h/hives \"Hives\"), which are raised red, itchy patches on your skin. Food allergies can also cause nausea or vomiting, swelling around your lips, face and eyes, diarrhoea (runny poo) or sneezing.\n  * Anaphylaxis is a severe allergic reaction. It can involve your whole body and is a life-threatening condition. ",
  "chunkIndex": 13,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.120341+00:00",
    "source": "healthify"
  }
}
