{
  "url": "https://healthify.nz/health-a-z/a/allergies-food/",
  "title": "Allergies Food",
  "content": "* **Know where allergens are likely found:** Educate your child about common foods that may contain their allergen, such as certain nuts, dairy, eggs, gluten, or shellfish. Talk about hidden sources of allergens in processed foods, sauces, or snacks.\n  * **Not to share food and drinks:** Encourage your child to never share food or drinks with others, especially in environments such as school, parties, or social gatherings. Sharing food can unknowingly lead to cross-contamination.\n  * **Ask questions:** Teach your child to always ask an adult (or a trusted teacher or caregiver) whether a food contains their allergen before eating it. Emphasise the importance of being cautious, even if the food looks safe.\n  * **Avoid eating foods they're not sure about:** Remind your child that if they're ever uncertain whether a food contains their allergen, it's safest to avoid it and ask an adult for clarification.\n  * **Handle situations at parties, school, or camp:** Prepare your child for social settings where food may be shared. Provide them with safe snacks to bring along and let them know it's okay to politely refuse food from others. Teach them how to explain their allergy to friends or caregivers and encourage them to speak up if they feel uncomfortable.\n\n\nBy teaching your child these skills, you'll help empower them to make safe choices and build confidence in managing their allergies independently.\n####  Related topics on Healthify \n[Anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")  \n[Reducing food allergies in infants](https://healthify.nz/hauora-wellbeing/r/reducing-food-allergies-in-infants \"Reducing food allergies in infants\")  \n[Allergy tips for school children](https://healthify.nz/health-a-z/a/allergies-tips-for-children-starting-school \"Allergy tips for school children\")  \n[Food allergies – travel](https://healthify.nz/health-a-z/f/food-allergies-travel)  \n[Food allergy or food intolerance?",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.501194+00:00",
    "source": "healthify"
  }
}
