{
  "url": "https://healthify.nz/health-a-z/a/athletes-foot/",
  "title": "Athletes Foot",
  "content": "# Athlete’s foot\n### Key points about athlete’s foot\n  * Athlete’s foot (also known as tinea pedis) is a common fungal skin infection. You can often treat it with cream from your pharmacy.\n  * Symptoms include include raw, cracked or scaly skin, redness and itching. Usually the symptoms involve the skin between your toes.\n  * Treatment includes keeping your feet clean and dry and using antifungal cream or tablets.\n  * You can help prevent athlete’s foot by drying your feet well after washing and changing your socks every day and not going barefoot in public changing rooms.\n\n\n![View of woman's feet in a hot tub](https://healthify.nz/assets/Healthy-Living/Women/toes-in-the-water-Canva.jpg)\nQR Code Print\n####  What causes athlete’s foot? \nAthlete’s foot is caused by tinea (a ringworm fungus). It can be easily caught through touching an area of fungal skin infection on another person or animal. You can also catch it from an object or surface that has been touched by the infected skin of a person or animal. Common places you can catch athlete’s foot from include bathroom or shower floors, bathmats, towels and swimming pool or gym changing rooms.\nYou are more likely to get the infection if you:\n  * have wet or sweaty feet\n  * have damaged skin on your feet \n  * walk barefoot in public places\n  * have diabetes or other conditions that weaken your immune system, eg, you are on chemotherapy\n  * are on medicines such as steroids or immunosuppressive medicines.\n\n\n####  What are the symptoms of athlete’s foot? \nSymptoms of athlete's foot can include:\n  * redness or itching, often between your toes\n  * itchy white patches between your toes\n  * burning or stinging\n  * a rash that may form [blisters](https://healthify.nz/health-a-z/b/blisters) or pustules\n  * raw, inflamed, cracked or scaly skin\n  * if severe, weeping or oozing areas of skin.\n\n\n![](https://healthify.nz/assets/Legacy/17961/athletes-foot-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Canva_\n####  Is athlete’s foot serious? \nAthlete's foot is not usually serious. The fungal infection can sometimes spread to other body parts such as your groin skin or toenails, but it does not usually spread deeper than your skin or nail. Treatment usually works well.   \n  \nOccasionally athlete’s foot can lead to other skin infections, such as [cellulitis](https://healthify.nz/health-a-z/c/cellulitis), because bacteria can get in through broken skin. This means it's good to get athlete’s foot treated properly.\n####  How is athlete’s foot diagnosed? (+ APPS) \nUsually athlete’s foot can be diagnosed by your doctor examining your foot and asking you questions. Your doctor may check other parts of your body to find out whether other areas also have a fungal infection, such as your groin, toenails or leg. If the cause for your symptoms is not clear, a small scraping of your skin may need to be sent to the laboratory for analysis. You may also be referred to a dermatologist (a skin specialist doctor).\n#### Apps reviewed by Healthify\nYou may find it useful to look at the [DermDiag app](https://healthify.nz/apps/d/dermdiag).\n####  How is athlete’s foot treated? \nYou can often treat athlete's foot at home with cream you can buy from a pharmacy. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:36.904290+00:00",
    "source": "healthify"
  }
}
