{
  "url": "https://healthify.nz/health-a-z/a/adhd-children/",
  "title": "Adhd Children",
  "content": "[Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# ADHD in children | Aroreretini\n## Also known as attention deficit hyperactivity disorder\n### Key points about ADHD – children\n  * Attention deficit hyperactivity disorder or ADHD-_Aroreretini is a developmental problem.\n  * Tamariki with ADHD–Aroreretini may have poor concentration, poor control of impulses and can be overactive.\n  * Tamariki with ADHD–Aroreretini need support and understanding from whānau, teachers and the community.\n  * Not all tamariki who are inattentive, impulsive and overactive have ADHD–Aroreretini.\n  * Medicine, positive parenting strategies and school support can help tamariki with ADHD–Aroreretini and their whānau.\n  * The content on this page comes from [KidsHealth(external link)](https://www.kidshealth.org.nz/adhd-aroreretini \"Open external link\").\n\n\n![3 happy kids give thumbs-up at the skatepark](https://healthify.nz/assets/Healthy-Living/Children/Happy-kids-at-the-skatepark-Canva.jpg)\nQR Code Print\n####  What are the names for ADHD? \n![Two young boys having fun playing outdoors](https://healthify.nz/assets/Legacy/15063/two-young-boys-having-fun-in-the-park-pixabay-665x443__ResizedImageWzYwMCw0MDBd.jpg)\n_Image credit: Pixabay_\n  * ADHD stands for attention deficit hyperactivity disorder.\n  * The Māori word for ADHD is aroreretini – attention goes to many things.\n  * Some people say ADD – attention deficit disorder.\n\n\n####  What is ADHD? \nADHD is a developmental problem. Children and young people with ADHD may have poor concentration, poor control of impulses and can be overactive. This interferes with their ability to learn and socialise and can affect family functioning.\nChildren with ADHD may be labelled as naughty but this is not true. Children with ADHD need support and understanding from whānau, teachers and the community.\n####  How common is ADHD? \nAt least 5 of every 100 children have ADHD. It's more common in boys than girls. Girls with ADHD show more inattention and are less disruptive. They are less likely to be diagnosed or may be diagnosed later.\nIt might seem like there are more children with ADHD now than in the past. This is probably because of better recognition of ADHD.\nADHD occurs in children and adults. ADHD symptoms usually improve with age. But a significant number of children with ADHD will continue to have symptoms as adults. They may need ongoing help.\n####  What causes ADHD? \nNo one knows the exact cause of ADHD but it is likely to be a combination of factors. These include genetics – children with ADHD are more likely to have a whānau member with ADHD.\nADHD can also be associated with:\n  * alcohol, smoking or drug exposure in pregnancy\n  * being born prematurely or having a low birth weight.\n\n\nThere is no good evidence that ADHD is caused by children eating too much sugar or food additives, although this is a commonly held view.\n####  What are the signs and symptoms of ADHD? \nChildren with ADHD have 3 types of main difficulties. ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.903908+00:00",
    "source": "healthify"
  }
}