{
  "url": "https://healthify.nz/health-a-z/a/allergic-rhinitis/",
  "title": "Allergic Rhinitis",
  "content": "If the cause of your symptoms isn't clear, your healthcare provider may order blood tests or skin-prick testing to find out what you're allergic to. They may also refer you to an allergy specialist for further testing if your symptoms are severe.\n####    \nSkin prick testing\n  * This involves placing a drop of an allergen on your skin and then scratching your skin through the drop. This is usually done on the skin of your arm, but can be done on your legs or body.\n  * If you're allergic to the allergen, your skin will become red and swollen at the site within 15 minutes.\n  * Skin tests alone aren't used to diagnose hay fever – the results need to be considered along with your history and symptoms.\n\n\nThe image below shows a skin prick test being done.  \n  \n\n![Skin test for allergy being done](https://healthify.nz/assets/Health-A-Z/Skin-topics/Allergy-skin-testing-Depositphotos-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Depositphotos_\n####  What self-care can I do if I have hay fever? \nYou can’t cure hay fever, but there are things you can do to help manage your symptoms.\nAvoiding the allergens that trigger your symptoms is the most important part of managing your hay fever. It might be hard to completely avoid an allergen but there are ways you can reduce your exposure to the things that trigger your hay fever.\n####    \nPollens\n  * Consider staying inside when the [pollen count forecast(external link)](https://www.metservice.com \"Open external link\") is high on windy days and during or after thunderstorms. \n  * Keep windows and doors shut when you can. \n  * Choose plants for your garden that are pollinated by birds or insects, rather than plants that release pollen into the air.\n  * Don’t keep fresh flowers in your house.\n  * Don’t dry clothes outside as they can catch pollen.\n  * Wear wrap-around glasses, a mask or a wide-brimmed hat to stop pollen getting into your nose or eyes.\n  * Avoid mowing the lawn, raking leaves or having an open compost heap. Splash your eyes with cold water or shower or change your clothes after outdoor activities that expose you to a lot of pollen.\n  * Rub petroleum jelly (eg, Vaseline) inside your nose to stop the pollen from coming into contact with the lining of your nose.\n  * Get a pollen filter for the air vents in your car.\n\n\n####    \nPet dander\n  * Ideally, don't have a pet.\n  ",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:24.384743+00:00",
    "source": "healthify"
  }
}
