{
  "url": "https://healthify.nz/health-a-z/a/alzheimers-disease/",
  "title": "Alzheimers Disease",
  "content": "Read more about [medicines for dementia](https://healthify.nz/medicines-a-z/d/dementia-medications).\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [dementia apps](https://healthify.nz/apps/d/dementia-apps). \n####  Planning for the future with Alzheimer's disease \nThere are some things you can do to plan ahead if you have Alzheimer's disease. These things will help you and your whānau prepare for the future.\n#### Care planning meeting\nPlan ahead so that you have more say in your future. Arrange a meeting (or get someone else to do it) with all the people involved in your care. This may include your carer, family/whānau members, or your practice nurse or GP.\nAgree on a care plan to support you to stay as well as possible for as long as possible. This might include:\n  * having a driving assessment\n  * arranging enduring power of attorney\n  * writing or updating your will\n  * developing an advance care plan\n  * accessing services to help you stay independent for as long as possible\n  * learning about your condition.\n\n\nRead more about all of these [things you can do to care for yourself with dementia or Alzheimer's](https://healthify.nz/health-a-z/d/dementia#self-care-for-dementia). \n####  VIDEO: Personal stories \nThese personal stories reveal the challenges that come with Alzheimer's disease, not just for you but for your family too.\n####    \nVideo: Living well with dementia – Rita's story\n  \n(Alzheimers NZ, 2018)\n####    \nVideo: Together apart\nFilmmaker, Suzi Jowsey, bravely follows her own family’s tough journey of caring for their mum who has Alzheimer’s.  \n  \n\n####    \nVideo: A message for patients and their families\nThis video talks about getting support and things you should consider if you or a family member are diagnosed with Alzheimer's disease.  \n  \n\n####  What's the outlook for Alzheimer's disease? \nMany people live satisfying lives with Alzheimer’s disease for years. Some people live for up to 20 years after diagnosis, but the usual time is 7 to 10 years.\nBecause it’s a progressive condition it gets worse over time. Your memory for people and events in your life will likely be lost. ",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:26.512430+00:00",
    "source": "healthify"
  }
}
