{
  "url": "https://healthify.nz/health-a-z/a/adrenal-insufficiency-hcps/",
  "title": "Adrenal Insufficiency Hcps",
  "content": "Autoimmune disorders occur when your immune system attacks your own cells and organs. In autoimmune Addison’s, your immune system gradually destroys the outer layer of your adrenal glands, known as the adrenal cortex. This is most common in middle-aged women.\nOther causes include:\n  * infections – viral (cytomegalovirus), bacterial (tuberculosis,  _Neisseria meningitidis_) and fungal \n  * tumours\n  * medicines\n  * genetic defects\n  * amyloidosis.\n\n\n#### Secondary adrenal insufficiency\nAnything that affects your pituitary gland can result in fewer pituitary hormones reaching your adrenal glands to tell them to produce hormones. This can include pituitary tumours, surgical removal or damage to your pituitary gland, damage to the blood supply and certain medicines.\nA temporary form of secondary adrenal insufficiency can occur when someone has been on corticosteroids, such as [Prednisone](https://healthify.nz/medicines-a-z/p/prednisone \"Prednisone\"), for weeks or months to treat inflammatory illnesses such as rheumatoid arthritis, asthma and ulcerative colitis.  \n  \nTaking corticosteroids for a long time means your adrenal glands produce fewer hormones. When the corticosteroid medicines are stopped, your adrenal glands may be slow to restart. Prescription corticosteroid doses are reduced gradually over a period of weeks or months to prevent this happening.\n####  How is adrenal insufficiency diagnosed? \nIt can be hard to diagnose adrenal insufficiency, especially when the disease is still in its early stages. Your doctor may suspect it after examining your symptoms and medical history.  \n  \nDiagnosis is confirmed through urine (pee) and blood tests. The results of these tests to show whether your levels of cortisol are too low. Next, your doctor will want to work out whether you have primary or secondary adrenal insufficiency and what the underlying cause is. You may need a scan of your pituitary and adrenal glands.   \n  \nRead more about [lab tests for adrenal insufficiency and Addison's disease(external link)(external link)](https://pathologytestsexplained.org.au/ptests-pro.php?q=Adrenal+insufficiency \"Open external link\") (Lab Tests Online, Australia)\n####  What is the treatment for adrenal insufficiency? \nAdrenal insufficiency is treated using medicines that aim to replace the missing hormones. Depending on the cause, you may need to take these medicines for the rest of your life. With treatment, it is possible to largely control the symptoms of the disorder and live a full and active life. \n####  What is an adrenal crisis? \nTaking too much or too little adrenal hormone replacement can lead to problems. The most dangerous problem an adrenal crisis (or an Addisonian crisis).\nAn adrenal crisis can occur when your body is not able to produce enough stress hormones to cope with a stressful event such as infection, injury or surgery. It can cause death if not treated.\nSymptoms of an adrenal crisis include:\n  * sudden, severe pain in your lower back, abdomen or head\n  * vomiting and diarrhoea\n  * dehydration\n  * low blood pressure, dizziness\n  * fever\n  * confusion or loss of consciousness.\n\n\nIf not treated, an adrenal crisis can cause death. \nIf you have been diagnosed with adrenal insufficiency, you will be given emergency medicine to take during stressful events. Intravenous corticosteroids are given during and after surgery. \n#### When to seek medical help\nContact your healthcare provider if: \n  * your ankles start swelling\n  * you can’t keep your medication down as a result of vomiting\n  * you notice new symptoms\n  * your weight changes without reason\n  * you have stress like infection, trauma, injury or dehydration (see your doctor straight away).\n\n\n####  Self-care – managing an adrenal crisis \nThe most important thing you can do is to make sure you understand what an adrenal crisis is and know what to do if you have one.\nAn adrenal crisis can happen when cortisol levels in your body fall significantly, resulting in sudden, severe symptoms. It is normally treated using adrenal hormones and you will be given corticosteroid tablets to have on hand at all times.\nYou also need to carry a corticosteroid injection with you at all times and ensure that family/whānau and workmates know how and when to give you this, if you are too sick to give it to yourself.   \n  \nYou should also carry a card in your wallet and a MedicAlert bracelet or necklace stating you have adrenal insufficiency.  \n  \nRead more about[managing an adrenal crisis(external link)(external link)](https://adrenal-insufficiency.nz/adrenal-crisis/ \"Open external link\") Adrenal Insufficiency NZ\n####  Support\n[Adrenal Insufficiency NZ(external link)(external link)](https://adrenal-insufficiency.nz/ \"Open external link\") Information and support for people living with adrenal insufficiency\n####  Related topics on Healthify \n[Steroid creams and ointments](https://healthify.nz/medicines-a-z/s/steroid-creams-and-ointments)  \n[Taking steroids long term](https://healthify.nz/medicines-a-z/s/steroids-long-term \"Taking steroids long term\")\n####  More information \n[Addison's disease(external link)(external link)](http://www.nhs.uk/conditions/addisons-disease/Pages/Introduction.aspx \"Open external link\") NHS, UK  \n[Addison's disease leaflet(external link)(external link)](http://patient.info/health/addisons-disease-leaflet \"Open external link\") Patient Info, UK\n#### Resources\n[Adrenal Insufficiency(external link)(external link)](https://www.endocrinology.org/media/1767/16-04_adrenal-insufficiency.pdf \"Open external link\") Society for Endocrinology, UK, 2015\n#### References\n  1. Betterle C, Morlin L.[Autoimmune Addison’s disease.(external link)(external link)](http://www.niddk.nih.gov/health-information/health-topics/endocrine/adrenal-insufficiency-addisons-disease/Pages/fact-sheet.aspx \"Open external link\") In Ghizzoni L, Cappa M, Chrousos G, Loche S, Maghnie M, eds. Pediatric Adrenal Diseases. Endocrine Development. ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:21.914327+00:00",
    "source": "healthify"
  }
}
