{
  "url": "https://healthify.nz/health-a-z/a/allergies-tips-for-children-starting-school/",
  "title": "Allergies Tips For Children Starting School",
  "content": "It's important to communicate with, and educate, everyone who will be involved with your child.\n\n\n![Three affectionate siblings sitting closely together outside](https://healthify.nz/assets/Healthy-Living/Children/Three-siblings-sitting-closely-together-canva-950x690.jpg)\n####  What you can do before your child starts school \nCheck your medicines and [action plans](https://healthify.nz/health-a-z/a/anaphylaxis#Be-prepared-with-an-anaphylaxis-action-plan) are up to date and take time to visit the school before your child starts.\n![Parent walking 3 children into school](https://healthify.nz/assets/Legacy/17456/Woman-taking-children-with-backpacks-to-school-canva-665x443__ResizedImageWzYwMCw0MDBd.jpg)\nImage credit: Canva\n#### Communicate with the school\n  * Tell the school about your child's allergy as early as possible. Be clear about which foods or other allergens may trigger an allergic reaction. \n  * Visit the school and ask about potential risks. For example: \n    * Are children exposed to food allergens during cooking and craft lessons?\n    * Is there a school policy about children sharing food?\n    * How do they make sure that relieving teachers, tuck shop staff and before/after school carers are familiar with student's needs?\n  * Provide the school with an up-to-date [action plan](https://healthify.nz/health-a-z/a/anaphylaxis#Be-prepared-with-an-anaphylaxis-action-plan) from your healthcare provider. This should include: \n    * details of prescribed medicines, such as adrenaline or antihistamines\n    * a recent photograph of your child.\n  * Make sure appropriate staff members are trained, and confident to administer medicines at the first sign of an allergic reaction.\n  * For anaphylactic reactions, Allergy New Zealand provide free trainer EpiPens® for anyone to practice with or schools can sign up to [MyEpiPen®(external link)](https://epiclub.co.nz/ \"Open external link\") to request a trainer pen.\n\n\n####    \nPrepare your child to start school\nYou can prepare your child to start school by teaching them how to recognise what they are allergic to, not to swap or share food, to keep their hands out of their mouth and what to do if they have a reaction.\n  * Teach your child not to put their hands in their mouth, and to wash their hands with soap and water if they get food on their skin.\n  * Provide a lunchbox that is clearly labelled with their name. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:24.808270+00:00",
    "source": "healthify"
  }
}
