{
  "url": "https://healthify.nz/health-a-z/a/assisted-dying/",
  "title": "Assisted Dying",
  "content": "Assisted dying is different from when people choose beforehand not to receive treatment, eg, when someone chooses not to be resuscitated if something like a heart attack occurs. Choosing to not receive medical treatment ahead of time is covered by an advance directive. You cannot choose to receive assisted dying in an advance directive and nor can anyone who holds an enduring power of attorney for you or who is a welfare guardian make this decision for you.\n  \n![Close up of drip in a person's. hand](https://healthify.nz/assets/Health-A-Z/Medicines/drip-in-hand-pexels__ResizedImageWzYwMCw0MDBd.jpg)\n_Image credit: Pexels_\n####  How do I get started if I want to make a request for assisted dying? \nThe first step is to talk to your own doctor about it. Doctors are not allowed to suggest assisted dying as an option for somebody who is terminally ill, so you have to raise the topic yourself. Nobody else can raise it with your doctor either, it must come from you.   \n  \nIf your doctor objects to assisting people to die (they are lawfully allowed to object and not provide this service to you), they musttell you this and advise you how to contact a doctor who will help. A list of health practitioners who are willing to provide assisted dying services has been set up. The Assisted Dying Service has a list of practitioners who provide this service and will help you contact them. Read more about [how to contact them(external link)](https://www.tewhatuora.govt.nz/health-services-and-programmes/assisted-dying-service/contact-the-assisted-dying-service#seeking-a-practitioner-who-provides-assisted-dying-services \"Open external link\"), or your doctor can tell you how to get in touch.\nIf, after you have made a request, your doctor is prepared to talk to you about assisted dying or you have been provided with an alternative doctor from the Assisted Dying Service who will provide the service, then there is certain information the doctor must give you. This includes information about your illness and other end-of-life options that may be available to you. They need to encourage you to speak to your family and friends, or a counsellor, but they must also let you know that you don’t have to do this.\n####  How do I know if I meet the criteria for assisted dying? \nTo be eligible to request assisted dying you must be:\n  * aged 18 years or older\n  * a New Zealand citizen or permanent resident\n  * suffering from a terminal illness that is likely to end your life within 6 months\n  * experiencing a serious decline in physical capability that cannot be reversed\n  * experiencing unbearable suffering that cannot be relieved in a way you can tolerate\n  * competent to make an informed decision about assisted dying.\n\n\nAll of these conditions must be met. You are not eligible just because you are very old, or because you have dementia, a mental illness or a disability.\n####  Who would decide that I meet the criteria for assisted dying? \nThe decision about whether or not you would meet the criteria for assisted dying must be made by 2 medical practitioners (doctors). If either or both of the doctors are unsure about whether you are competent to make a decision to end your life (the last bullet point above), a psychiatrist must be asked for their opinion on whether you are competent to make the decision. The request will only be moved forward if the psychiatrist decides that you are competent to make an informed decision about assisted dying.\n####  How will they be able to decide if I am competent or not? \nThe doctors and, if necessary, a psychiatrist need to be sure you really understand the decision you are making. They will do this by asking you questions to see if you:\n  * are able to understand the information about what assisted dying means\n  * are able to remember and consider that information in the decision-making process\n  * can communicate that decision in some way.\n\n\n####  I've been found eligible to receive assisted dying. What will happen next? \nYour doctor will talk to you about the progress of your illness and the likely timing to receive the medication. There are forms to fill out and Health New Zealand | Te Whatu Ora has to check that everything under the law has been complied with.\n####  Can somebody else make the decision for me? \nNo, it has to be your decision and nobody else’s. Your doctor cannot make the decision for you and neither can a member of your whānau – even if they have[power of attorney.](https://healthify.nz/hauora-wellbeing/e/enduring-power-of-attorney \"Enduring power of attorney\")\nYour doctor also needs to be sure that you are not under pressure from anyone else to make this decision. This may involve the doctor talking to other health professionals who are in regular contact with you. It may also involve the doctor talking to members of your family/whānau who you agree beforehand the doctor can talk to. \n####  What if I change my mind about assisted dying? \nYou are free to change your mind at any point in the process right up to when you are about to be given the medication. You can choose to delay the time of assisted dying for up to 6 months or cancel the request altogether.\n####  Can I set the process up now in case I can’t decide for myself in the future? \nNo. ",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.708057+00:00",
    "source": "healthify"
  }
}
