{
  "url": "https://healthify.nz/health-a-z/a/adhd-adults/",
  "title": "Adhd Adults",
  "content": "You may be able to concentrate when you really enjoy something but lose track when you get bored.\n####  **  \n**Hyperactivity (being unusually active)\nHyperactivity may be:\n  * feeling agitated or nervous\n  * being unable to sit still and concentrate\n  * talking non-stop with little awareness of your surroundings\n  * rapid thoughts or being unable to stop thinking\n  * having sleep problems.\n\n\n####  **  \n**Impulsivity\nSymptoms of impulsivity can be:\n  * starting things and not finishing them\n  * not considering the consequences of your actions\n  * interrupting other people\n  * taking over what someone else is doing\n  * having problems with money\n  * changing jobs frequently\n  * using drugs or alcohol\n  * getting speeding tickets or having car accidents\n  * having a hot temper or being irritable.\n\n\nADHD symptoms can be different in adults than they are in children. Inattention may be the biggest problem. Hyperactivity may be more a feeling of restlessness or fidgeting rather than moving around the room. Impulsivity can be more verbal, such as interrupting conversations, rather than the physical impulsivity children have. \nAdults with ADHD often have other symptoms too, which are not part of the official diagnosis, such as:\n  * **Executive dysfunction:** Executive function is the mental processing needed to choose goals and make plans, take action and keep moving towards those goals. With ADHD you may struggle with working memory, changing between different tasks and thoughts, monitoring yourself, starting things, and self-inhibition (stopping some things that, thinking back, would have been better not done or said). Executive dysfunction also contributes to inattention problems.  \n  \n\n  * **Emotional dysregulation:** This is difficulty in managing uncomfortable emotions when necessary, and behaving appropriately when distressed. Emotional dysregulation can show up as mood swings, angry outbursts, low motivation, irritability and difficulty putting up with frustration.  \n  \n\n  * **Time agnosia:** This is difficulty judging the passing of time, estimating how long things will take or remembering the order things happen in. This can show up as lateness and losing track of time. ",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.549680+00:00",
    "source": "healthify"
  }
}