{
  "url": "https://healthify.nz/health-a-z/a/anaesthesia/",
  "title": "Anaesthesia",
  "content": "Anaesthetics can be used to numb a small area of skin, to block a nerve (and its pathway) or as general anaesthesia to make you unconscious for an operation.\n####    \nVideo: What is anaesthesia?\nThis video may take a few moments to load.\n  \n(ANZCA, 2018)\n####  How do anaesthetics work? (+ VIDEO) \nAnaesthetics temporarily block nerve signals from reaching your brain. This means procedures can be done without you feeling anything. After the anaesthetic wears off, the nerve signals reach your brain and feeling will return to the affected part of your body.\n####    \nVideo: How does anesthesia work? \n####  What are the different types of anaesthesia? (+ VIDEO) \nThere are 3 main types of anaesthesia – local, regional and general.anaesthesia to help relax you or make you feel sleepy.\nThe type of anaesthesia used will depend on the type of procedure or surgery, your health (eg, whether you have heart disease or diabetes) and the results of tests, such as blood tests or an electrocardiogram (ECG).\n#### 1. Local anaesthesia\nLocal anaesthesia is used to numb a small part of your body while you're awake. It's used for minor procedures like getting stitches for a cut. This anaesthetic can be given as an injection or as a spray, cream or gel that's put on the area. Read more about [numbing creams and gels](https://healthify.nz/medicines-a-z/p/pain-relief-creams-gels-and-rubs#Numbing-gel-or-cream). \n####    \nVideo: Numb and numb-er – A child’s guide to local anaesthetics  \n  \n\n####    \n2. Regional anaesthesia\nRegional anaesthesia is used to numb a larger part of your body.This anaesthetic isegional anaesthesia allows you to stay awake. There are 2 types of regional anaesthesia:\n  * **peripheral nerve block**\n  * **epidural and spinal anaesthesia** is given near your spinal cord and the nerves that connect to it. It blocks pain from an entire region of your body, such as your belly, hips, or legs. It can be used for pain relief during labour and childbirth, bladder operations and hip replacement surgery. \n\n\n####    \n3. General anaesthesia \nGeneral anaesthesia is used to keep you unconscious during surgery, so you will feel nothing and have no memory of what happens during your surgery. Your awareness will return when the effects of the anaesthesia wares off. General anaesthesia is given as both a gas that you breathe into your lungs (inhalational anaesthesia) and as an injection through a vein (intravenous anaesthesia). It's used for many operations such as surgery on your heart, lungs, and abdomen (tummy).\n####    \nWhat is sedation?\nSedation involves using small amounts of intravenous anaesthetic medicine to make you relaxed and sleepy, but not unconscious. Many people having local or regional anaesthesia don't want to be awake for the surgery so they choose to have sedation as well. If you have sedation, you will remember little or nothing of the operation. It doesn't always mean you will have no memory of the operation. Only a general anaesthetic can do that.\nSome types of inhaled anaesthetic medicine are used for pain relief but don't make you fully unconscious. They're used for dental procedures, emergencies or when you're in labour, eg, [nitrous oxide](https://healthify.nz/medicines-a-z/n/nitrous-oxide) (laughing gas) and[ methoxyflurane](https://healthify.nz/medicines-a-z/m/methoxyflurane).\n####  Who is an anaesthetist? \nAnaesthetists are doctors who have specialist training in anaesthesia. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:28.659418+00:00",
    "source": "healthify"
  }
}