{
  "url": "https://healthify.nz/health-a-z/a/aids-hiv/",
  "title": "Aids Hiv",
  "content": "Knowing your status is important because it helps you make healthy decisions to prevent getting or transmitting HIV. If HIV virus is found in your blood, you are said to be HIV positive.  \n  \nHow often you should get tested (the frequency of testing) depends on who you have sex with and what type of sex you have. Use the ['Testing frequency calculator'(external link)](https://www.burnettfoundation.org.nz/tools/how-often-should-i-test-for-hiv/ \"Open external link\") (Burnett Foundation Aotearoa) to get a recommendation on how often you should be tested.   \n  \nIf you think you may have been exposed to HIV, you can use the '[Been exposed tool(external link)](https://www.nzaf.org.nz/awareness-and-prevention/been-exposed/ \"Open external link\")' (Burnett Foundation Aotearoa) to find out the likely risk of a specific event or encounter. If you were at risk of HIV exposure you will also get a recommendation for next steps.   \n\n  * If you think you may have been exposed to HIV, there are several organisations who can arrange a blood test for you – your healthcare provider, Sexual Wellbeing Aotearoa clinic, sexual health clinic, Burnett Foundation Aotearoa, Body Positive, Positive Women and Toitu Te Ao. The result is confidential.\n  * If your first test suggests you have HIV, a further blood test will needed to confirm the result.\n  * If this is positive, you'll be referred to a specialist HIV clinic for some more tests and a discussion about your treatment options. \n  * There is a short period just after being infected with HIV when the virus can't be detected. If you have been exposed to HIV, you may need a follow-up test later. \n  * **Note:** HIV is a notifiable disease which means that it is a legal responsibility for your healthcare provider to notify public health authorities of a HIV positive result. In the notification, you will not identified by name or address (it is anonymous). \n\n\n####  How is HIV treated? \nWhile there's no cure for HIV, it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). These work by stopping the virus replicating (spreading) in your body, allowing your immune system to repair itself and preventing further damage. Taking these medicines can reduce the amount of virus in your body and help you stay healthy, and can also help prevent you passing the virus on to others.  \n  \nYou will also be encouraged to have regular exercise, eat a healthy diet, avoid smoking and keep up-to-date with vaccines to lessen the risk of getting serious illnesses. Without treatment, your immune system will become severely damaged and life-threatening illnesses (eg, cancer and severe infections) can occur. Read more about [antiretroviral therapy](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy).\n####  How can I prevent HIV infection? \nThere are a few things you can do to protect yourself from HIV.\n  * **Practice safe sex:** Using condoms and water-based lubricant correctly every time you have vaginal or anal sex reduces the risk of getting HIV by around 95%. In Aotearoa New Zealand, HIV is most commonly caught by having unprotected sex with a person living with HIV. \n  * **Don't share needles:** If you inject yourself with drugs, it’s important to use new needles and syringes. Blood is left on syringes and needles every time they’re used. If you share injecting equipment, you can catch HIV from another person’s blood if they are living with HIV.\n  * **Have HIV antenatal screening:** Women with HIV can pass it on to their babies during pregnancy, birth and while breastfeeding. If you’re pregnant, you’ll be offered a screening test for HIV at the same time as you have your other blood tests, as a routine part of your antenatal care. The screening programme is run by the National Screening Unit. If you’re found to have HIV, you’ll be offered treatment that reduces the chance of your baby becoming infected from about 25% to less than 1%.\n  * **Use pre-exposure prophylaxis (PrEP):** This is an HIV prevention method for people who don't have HIV but who are at higher risk. By taking this medicine you can reduce your risk of becoming infected with HIV by up to 99%. Read more about [PrEP](https://healthify.nz/medicines-a-z/p/pre-exposure-prophylaxis-prep).\n  * **Use post-exposure prophylaxis (PEP):** This is an emergency medicine for people who may have been exposed to HIV (eg, from a needle-stick injury, unprotected sex, or sexual assault). Read more about [PEP](https://healthify.nz/medicines-a-z/p/post-exposure-prophylaxis). \n\n\nIf you are HIV positive, you can take precautions to avoid spreading the infection to others.\n  * Take your antivirals. It can suppress your viral load to being undetectable and there is no risk of sexual transmission if your viral load stays undetectable. \n  * Tell your sexual partner or partners about your relevant behaviour and whether you are HIV-positive.\n  * Follow safer sex practices, such as using condoms. ",
  "chunkIndex": 11,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:23.427849+00:00",
    "source": "healthify"
  }
}
