{
  "url": "https://healthify.nz/health-a-z/a/arthritis-and-exercise/",
  "title": "Arthritis And Exercise",
  "content": "**\n#### Cardio exercise\nAlso known as CV (short for cardiovascular) aerobic or endurance exercise, cardio is anything that raises your heart rate and makes you breathe more heavily. You need to engage the muscles in your legs or arms (or both) and you’ll know if you are doing cardio exercise if you are ‘huffing and puffing’ and your body temperature increases.\n**Why is cardio exercise important?**  \nIt strengthens your heart and lungs and improves your metabolism which makes you better able to manage blood glucose for example. Cardio stimulates cognitive function (brain health) and helps with weight loss. It's also known to reduce mental issues like stress, anxiety and depression. Being ‘cardio fit’ means you can climb stairs or hills, play sport or run around with the kids or grandkids.\n![Person cycling along country road](https://healthify.nz/assets/Healthy-Living/Exercise/Bike-rider-in-the-country-canva-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Canva_\n#### Resistance exercise\nAlso known as strength or weight training, this is when you move against a resistance provided by your own body weight and gravity. Bands or weights (eg, dumb bells, barbells, kettlebells, weight bags, plates, etc) can be used and isometric exercise can also be useful as part of a resistance programme.\n**Why is resistance exercise important?**  \nResistance exercise counters the loss of muscle tissue (known as sarcopenia) that occurs with ageing from about the age of 35. Resistance training is also good for bone health as the action of tendons, which are attached to muscles, pulling on bone protects against declines in bone mineral density.\nThe obvious benefit of staying strong is being able to push, pull, carry and lift things. Your posture will improve and you will look more toned. As you get older the risk of falls increases and having the muscle strength and power to recover when you lose balance is crucial. Read more about [falls and how to prevent them](https://healthify.nz/health-a-z/f/falls-and-falls-prevention).\n#### Mobility exercise\nAlso referred to as flexibility or stretching, mobility exercise is all about maintaining a good range-of-motion (ROM) in joints.\n**Why is mobility exercise important?**  \nWhilst it provides temporary relief to keep painful joints bent (and is very easy to do), this becomes a ‘Catch 22’ as doing so for too long can cause further loss of mobility and hinder everyday activities even more. By taking joints through full range-of-motion in a controlled manner you will help to preserve as near normal function as possible.\n#### Balance training\nWe tend to associate specific balance improvement exercises with older people who have had a fall in order to reduce the chance that they will have another. But this is like shutting the stable door once the horse has bolted!\nMost people don't know that there's a complex combination of our visual, vestibular (inner ear) and proprioception systems working together to keep us upright and to move at will. As you get older these systems are more likely to be affected so it's never too late to include balance work as part of regular exercise, but it's also never too early.\n**Why is balance training important?**  \nTo prevent falls and possible injury. A fall can happen at any age but carries increased risk with age, eg, 1 in 3 people over the age of 65 years will have a fall.\n####  Popular forms of exercise \nHere are some popular forms of exercise with information about what they offer but also what you need to consider.\n#### Walking\n**Positives:** Simple and easy to do at any time and it's free. ",
  "chunkIndex": 12,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:34.102436+00:00",
    "source": "healthify"
  }
}
