{
  "url": "https://healthify.nz/health-a-z/a/amenorrhoea/",
  "title": "Amenorrhoea",
  "content": "If you think you might be pregnant, buy a pregnancy test from your pharmacy or see your healthcare provider.\nThere are other lifestyle and medical reasons why your period might be late or irregular. Many of these reasons are the same as those that might cause you to have no periods (eg, stress, exercising too much, eating disorders or hormonal conditions such as [PCOS](https://healthify.nz/health-a-z/p/polycystic-ovary-syndrome)), but other reasons include shift work or travelling between different time zones. Stress is the most common cause of irregular periods.\nIf you’re between the ages of 40 and 55, late or irregular periods might be a sign that you’re starting [menopause](https://healthify.nz/hauora-wellbeing/m/menopause).\n####    \nHeavy periods\nMenorrhagia is the term given to heavy periods. It affects about 20 to 25% of women. With menorrhagia you may have longer periods (lasting longer than 7 days), excessive bleeding with flooding or clots or both.\n  * If you have menorrhagia you may lose 80 mL or more of blood per period, compared to the 30 to 40 mL lost by most women.\n  * If you're needing to change your tampon or sanitary pad more often than every hour, flooding (soaking through your pads/clothing) or becoming [anaemic](https://healthify.nz/health-a-z/a/anaemia \"Anaemia\"), you probably have menorrhagia.\n\n\nMenorrhagia is one of the main reasons for having a hysterectomy (surgical removal of your uterus), although there are other less extreme treatments to try first such as insertion of a Mirena (a type of intrauterine device also used for contraception). Read more about [heavy periods](https://healthify.nz/health-a-z/p/periods-heavy-bleeding \"Periods – heavy bleeding\") and [heavy periods for young people](https://healthify.nz/health-a-z/h/heavy-periods-young-people). If you think your periods are heavy, try filling out the [Healthify heavy period diary [JPG, 111 KB]](https://healthify.nz/assets/Health-A-Z/Womens-health/Heavy-period-diary-HN-image.jpg) and take it along to an appointment with a healthcare provider. \n####    \nPainful periods\nSome people have [painful periods](https://healthify.nz/health-a-z/d/dysmenorrhoea \"Dysmenorrhoea\") (dysmenorrhoea). This may be caused by your period or it may be a sign of an underlying condition, such as [endometriosis](https://healthify.nz/health-a-z/e/endometriosis \"Endometriosis\"). If your periods are very painful, talk to a healthcare provider.\n####    \nBleeding after menopause\nIf it’s been a year since your last period then you start to bleed again, see a healthcare provider. Read more about [post-menopausal bleeding](https://healthify.nz/health-a-z/p/post-menopausal-bleeding).  \n  \n\n####  What should I use to absorb the blood when I have a period? \nThere are a range of options for absorbing the blood flow during your period. \n  * **Pads** are made of absorbent material and stick to your underwear to soak up blood. They come in many different shapes and absorbencies (amount of blood they can soak up) and you throw them away after use.\n  * **Reusable pads** are cloth pads that you can wash and reuse. They’re usually made of absorbent material like cotton or bamboo. It’s recommended that after using the pad, you rinse it, soak it overnight and then wash it before using it again.\n  * **Tampons** are small tubes of absorbent material with a string at one end. You put them into your vagina to soak up your blood, and pull them out using the string. You should change a tampon as needed but at least every 4 to 8 hours. It’s best not to use them overnight. You can choose from a range of sizes, depending on how heavy your period is. ",
  "chunkIndex": 11,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:27.246959+00:00",
    "source": "healthify"
  }
}