{
  "url": "https://healthify.nz/health-a-z/a/avoidant-restrictive-food-intake-disorder-arfid/",
  "title": "Avoidant Restrictive Food Intake Disorder Arfid",
  "content": "Experts are still trying to understand what makes some people more likely to develop it. \nARFID may happen due to a mixture of reasons such as environment, upbringing, health and genetics. Some tamariki may have a medical condition that puts them at risk of ARFID. It can sometimes occur with medical conditions that affect the digestive system or require special diets. \nARFID may also happen after a child has a bad experience with food. This could be something that happened to them or something they saw, such as choking, gagging or vomiting.\n#### Who is at risk?\nARFID is common in tamariki and also occurs in rangatahi. ARFID occurs in both girls and boys but is more common in boys. ARFID most often develops in early childhood and can last into adulthood.\n####  Could my child have ARFID, or are they a picky eater? \nPicky eating is common in tamariki, but it's very different to ARFID. ARFID is more than just [fussy or picky eating](https://healthify.nz/hauora-wellbeing/f/fussy-eaters). Tamariki with ARFID will deeply dislike certain foods or generally lack interest in food or eating. The behaviours in ARFID are ongoing and can cause serious medical problems. \nIt's common for tamariki to dislike certain foods, but most tamariki will gradually eat and explore new foods as they get older. Tamariki with ARFID need a lot of support to try new foods and to eat the right quantity and variety of food to stay healthy.\n####  What are the signs and symptoms of ARFID? \nIt's important to look for certain signs if you are worried about your child’s eating. Tamariki with ARFID may show some of the following signs. \n#### Moods\n  * Anxiety and distress around food and mealtimes.\n  * Afraid or upset when trying new foods.\n  ",
  "chunkIndex": 10,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:39.126097+00:00",
    "source": "healthify"
  }
}
