{
  "url": "https://healthify.nz/health-a-z/a/anxiety/",
  "title": "Anxiety",
  "content": "They will talk with you about your experience and explore possible causes. You may need a blood test to rule out other reasons for your symptoms.\n####  How can I care for myself with anxiety? (+ VIDEO, APPS) \nYou can improve your anxiety with the choices you make every day.\n**Exercise** – you don’t have to wait until you feel like it. Read more about [how to become more active](https://healthify.nz/hauora-wellbeing/e/exercise-how-to-get-moving-more-every-day).\n**Eat well** – try to eat regular meals, a healthy breakfast, more fruit and vegetables and less processed food. Find out more about [healthy eating basics](https://healthify.nz/hauora-wellbeing/h/healthy-eating-basics \"Healthy eating basics\")..\n**Sleep – w** hile anxiety can affect your sleep, not getting enough sleep can also contribute to making you more anxious. Make sleep a priority. Try the [Twenty Winks Sleep Questionnaire](https://healthify.nz/tools/t/twenty-winks-sleep-questionnaire) to see what might be affecting your sleep and get some hints for managing it better.\n**Relaxation –** Taking time each day to relax helps to reduce anxiety. Learn [relaxation(external link)](https://mentalhealth.org.nz/resources/resource/switching-on-your-relaxation-response \"Open external link\") and breathing exercises or try yoga, Pilates or tai chi. Spend time outside in [nature](https://healthify.nz/hauora-wellbeing/l/let-nature-in-strengthen-your-wellbeing). Do things that you enjoy, make you feel comfortable or lift your mood. \n**Breathing –** Box Breathing is a popular and powerful strategy to reduce anxiety.\n#### Video: Box breathing tutorial  \n  \n\n(Dee Jay, India, 2020)\n**Smoking –** has been shown to make anxiety worse. Stopping nicotine needs to be done slowly so your your symptoms don’t get worse so talk with your healthcare provider or ring QuitLine for advice, support and nicotine replacement therapy. Read more about [how to quit smoking](https://healthify.nz/hauora-wellbeing/s/smoking-treatments-for-quitting-smoking).\n**Alcohol –** is often used to lessen anxiety symptoms, especially social anxiety, but it makes anxiety worse the next day and over time. Aim to reduce your drinking to no more than 1 or 2 drinks per day or avoid it completely. \n**Recreational drugs** – including some which are commonly used to reduce anxiety like cannabis, can cause anxiety either directly, or when levels drop. If you have an anxiety disorder, it’s best not to use any.\n**Support –** build your support network – a few people you can go to when things are tough. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:32.177865+00:00",
    "source": "healthify"
  }
}
