{
  "url": "https://healthify.nz/health-a-z/a/anaphylaxis/",
  "title": "Anaphylaxis",
  "content": "Anaesthetics and contrast agents used in imaging tests can also cause anaphylaxis.\n####    \nOther causes\nOther triggers such as latex or exercise-induced anaphylaxis are less common. Occasionally the trigger can't be identified. \n####  How is anaphylaxis diagnosed? \nAnaphylaxis may be diagnosed following a severe reaction for which you went to an emergency department at the hospital. \nYour healthcare provider will ask you questions related to your symptoms, examine you and do some tests to find out your triggers, and/or rule out other conditions that can be similar to anaphylaxis, such as fainting, severe asthma attacks or panic attacks. \nTests that may be done include:\n  * blood test to look for an antibody called IgE or an enzyme called mast cell tryptase\n  * skin prick testing to find out triggers.\n\n\nYou may also be diagnosed as at risk of anaphylaxis because of an allergy you have been diagnosed with e.g. to a food, even though you may only have had mild to moderate reactions to it previously. \nIf you are diagnosed at risk of anaphylaxis, your doctor or nurse specialist will give you an[anaphylaxis action plan(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2025/ASCIA_Action_Plan_Anaphylaxis_EpiPen_2025.pdf \"Open external link\")\n####  How is anaphylaxis managed? \nAnaphylaxis is a preventable and treatable event. Knowing the trigger(s) is the first step in prevention. Everyone at risk needs to know how to avoid food allergens and/or other triggers. \nHowever, because accidental exposure is possible, you and your child need to be able to recognise symptoms of anaphylaxis and be prepared to give adrenaline according to your anaphylaxis action plan.\n#### How to position a child or an adult having a severe allergic reaction (anaphylaxis)\nPlease**click the image below** and scroll down on the new page to play the animation.\n[![](https://healthify.nz/assets/Infographics/anaphylaxis-ASCIA-665x443__ResizedImageWzYwMCw0MDBd.jpg) (external link)(external link)](https://www.allergy.org.au/hp/anaphylaxis/positioning \"Open external link\")\n(Australasian Society of Clinical Immunology and Allergy)\nIf you have had anaphylaxis for the first time, after those immediate steps and then getting emergency medical care, as part of your treatment plan you need to:\n  * see a specialist to find out your triggers \n  * work out an[anaphylaxis action plan(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2025/ASCIA_Action_Plan_Anaphylaxis_EpiPen_2025.pdf \"Open external link\")\n  * attend follow-ups if required by your healthcare provider\n  * get educated on how to avoid triggers and use an adrenaline auto-injector if you are prescribed one\n  * ask your doctor or nurse specialist for an asthma management plan if you or your child also has asthma. \n\n\nThe Australasian Society of Clinical Immunology and Allergy (ASCIA) provides[free online training on anaphylaxis for patients, families and the community.(external link)(external link)](https://www.allergy.org.au/patients/anaphylaxis-e-training-schools-and-childcare \"Open external link\")\n####    \nAdrenaline is the first-line treatment for anaphylaxis\nAdrenaline is the treatment for anaphylaxis. Adrenaline works by quickly reversing the effects of anaphylaxis.\nAdrenaline can be easily given using an auto-injector such as an EpiPen (the only one available in Aotearoa New Zealand). The auto-injector injects a single, pre-measured dose of adrenaline into your muscle. If you're at risk of anaphylaxis, then your healthcare provider might ask you to carry an auto-injector with you. Deaths from anaphylaxis are more common away from home and when adrenaline is either not used or is delayed.\nIf you or your child are prescribed an adrenaline auto-injector, it is important to learn and practise how to use it. You can register your EpiPen with [My EpiPen(external link)](https://www.myepipen.co.nz \"Open external link\")\n####    \nDon't use antihistamines\nDon’t use antihistamines to treat anaphylaxis – giving adrenaline quickly is the only treatment for anaphylaxis. Anaphylaxis is a potentially life threatening, severe allergic reaction and should always be treated as a medical emergency.  \n  \n\n####  How can I prevent anaphylaxis? \n",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.323645+00:00",
    "source": "healthify"
  }
}
