{
  "url": "https://healthify.nz/health-a-z/a/acupuncture/",
  "title": "Acupuncture",
  "markdown": "[Skip to main content](https://healthify.nz/health-a-z/a/acupuncture#main)\n  * [ Healthify on Instagram ](https://www.instagram.com/healthify_hepunawaiora/ \"Follow us on Instagram\")\n  * [ Healthify on Facebook ](https://facebook.com/healthifyhepunawaiora \"Follow us on Facebook\")\n\n\n![logo black](https://healthify.nz/assets/Uploads/logo-black.png)\n[ ![logo orange v2](https://healthify.nz/assets/Uploads/logo-orange-v2.png) ](https://healthify.nz)\nSearch\nSearch this website\n  * [Health A–Z](https://healthify.nz/health-a-z) Show submenu for Health A–Z\n  *     * [A](https://healthify.nz/health-a-z/a)\n    * [B](https://healthify.nz/health-a-z/b)\n    * [C](https://healthify.nz/health-a-z/c)\n    * [D](https://healthify.nz/health-a-z/d)\n    * [E](https://healthify.nz/health-a-z/e)\n    * [F](https://healthify.nz/health-a-z/f)\n    * [G](https://healthify.nz/health-a-z/g)\n    * [H](https://healthify.nz/health-a-z/h)\n    * [I](https://healthify.nz/health-a-z/i)\n    * [J](https://healthify.nz/health-a-z/j)\n    * [K](https://healthify.nz/health-a-z/k)\n    * [L](https://healthify.nz/health-a-z/l)\n    * [M](https://healthify.nz/health-a-z/m)\n    * [N](https://healthify.nz/health-a-z/n)\n    * [O](https://healthify.nz/health-a-z/o)\n    * [P](https://healthify.nz/health-a-z/p)\n    * [Q](https://healthify.nz/health-a-z/q)\n    * [R](https://healthify.nz/health-a-z/r)\n    * [S](https://healthify.nz/health-a-z/s)\n    * [T](https://healthify.nz/health-a-z/t)\n    * [U](https://healthify.nz/health-a-z/u)\n    * [V](https://healthify.nz/health-a-z/v)\n    * [W](https://healthify.nz/health-a-z/w)\n    * [X](https://healthify.nz/health-a-z/x)\n    * [Z](https://healthify.nz/health-a-z/z)\n  * [Medicines A–Z](https://healthify.nz/medicines-a-z) Show submenu for Medicines A–Z\n  *     * [A](https://healthify.nz/medicines-a-z/a)\n    * [B](https://healthify.nz/medicines-a-z/b)\n    * [C](https://healthify.nz/medicines-a-z/c)\n    * [D](https://healthify.nz/medicines-a-z/d)\n    * [E](https://healthify.nz/medicines-a-z/e)\n    * [F](https://healthify.nz/medicines-a-z/f)\n    * [G](https://healthify.nz/medicines-a-z/g)\n    * [H](https://healthify.nz/medicines-a-z/h)\n    * [I](https://healthify.nz/medicines-a-z/i)\n    * [J](https://healthify.nz/medicines-a-z/j)\n    * [K](https://healthify.nz/medicines-a-z/k)\n    * [L](https://healthify.nz/medicines-a-z/l)\n    * [M](https://healthify.nz/medicines-a-z/m)\n    * [N](https://healthify.nz/medicines-a-z/n)\n    * [O](https://healthify.nz/medicines-a-z/o)\n    * [P](https://healthify.nz/medicines-a-z/p)\n    * [Q](https://healthify.nz/medicines-a-z/q)\n    * [R](https://healthify.nz/medicines-a-z/r)\n    * [S](https://healthify.nz/medicines-a-z/s)\n    * [T](https://healthify.nz/medicines-a-z/t)\n    * [U](https://healthify.nz/medicines-a-z/u)\n    * [V](https://healthify.nz/medicines-a-z/v)\n    * [W](https://healthify.nz/medicines-a-z/w)\n    * [X](https://healthify.nz/medicines-a-z/x)\n    * [Y](https://healthify.nz/medicines-a-z/y)\n    * [Z](https://healthify.nz/medicines-a-z/z)\n  * [Hauora Wellbeing](https://healthify.nz/hauora-wellbeing) Show submenu for Hauora Wellbeing\n  *     * [A](https://healthify.nz/hauora-wellbeing/a)\n    * [B](https://healthify.nz/hauora-wellbeing/b)\n    * [C](https://healthify.nz/hauora-wellbeing/c)\n    * [D](https://healthify.nz/hauora-wellbeing/d)\n    * [E](https://healthify.nz/hauora-wellbeing/e)\n    * [F](https://healthify.nz/hauora-wellbeing/f)\n    * [G](https://healthify.nz/hauora-wellbeing/g)\n    * [H](https://healthify.nz/hauora-wellbeing/h)\n    * [I](https://healthify.nz/hauora-wellbeing/i)\n    * [K](https://healthify.nz/hauora-wellbeing/k)\n    * [L](https://healthify.nz/hauora-wellbeing/l)\n    * [M](https://healthify.nz/hauora-wellbeing/m)\n    * [N](https://healthify.nz/hauora-wellbeing/n)\n    * [O](https://healthify.nz/hauora-wellbeing/o)\n    * [P](https://healthify.nz/hauora-wellbeing/p)\n    * [R](https://healthify.nz/hauora-wellbeing/r)\n    * [S](https://healthify.nz/hauora-wellbeing/s)\n    * [T](https://healthify.nz/hauora-wellbeing/t)\n    * [V](https://healthify.nz/hauora-wellbeing/v)\n    * [W](https://healthify.nz/hauora-wellbeing/w)\n    * [Y](https://healthify.nz/hauora-wellbeing/y)\n    * [Z](https://healthify.nz/hauora-wellbeing/z)\n  * [Care & Support](https://healthify.nz/care-and-support)\n  * [App Library](https://healthify.nz/app-library)\n  * [Tools](https://healthify.nz/tools) Show submenu for Tools\n  *     * [A](https://healthify.nz/tools/a)\n    * [B](https://healthify.nz/tools/b)\n    * [C](https://healthify.nz/tools/c)\n    * [D](https://healthify.nz/tools/d)\n    * [E](https://healthify.nz/tools/e)\n    * [F](https://healthify.nz/tools/f)\n    * [G](https://healthify.nz/tools/g)\n    * [H](https://healthify.nz/tools/h)\n    * [I](https://healthify.nz/tools/i)\n    * [J](https://healthify.nz/tools/j)\n    * [K](https://healthify.nz/tools/k)\n    * [L](https://healthify.nz/tools/l)\n    * [M](https://healthify.nz/tools/m)\n    * [N](https://healthify.nz/tools/n)\n    * [O](https://healthify.nz/tools/o)\n    * [P](https://healthify.nz/tools/p)\n    * [R](https://healthify.nz/tools/r)\n    * [S](https://healthify.nz/tools/s)\n    * [T](https://healthify.nz/tools/t)\n    * [W](https://healthify.nz/tools/w)\n  * [Donate](https://healthify.nz/donate)\n\n\nSearch\nSearch this website\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Acupuncture\n### Key points about acupuncture\n  * Acupuncture is the practice of stimulating specific points under your skin using very thin needles.\n  * There are 2 broad types of acupuncture in New Zealand: traditional Chinese acupuncture, and Western medical acupuncture.\n  * Acupuncture is generally safe as long as you see a registered and trained provider who uses sterile needles.\n  * Traditional Chinese acupuncture has been regulated in Aotearoa New Zealand since 2023. \n  * Acupuncture may be mildly effective for a limited number of conditions.\n  * It's not recommended that you have acupuncture as a sole treatment for your health problem.\n\n\n![Acupuncture needle going into right hand](https://healthify.nz/assets/Health-A-Z/Pain/Acupuncture-needle-in-hand-Canva.jpg)\nQR Code\n![](https://healthify.nz/health-a-z/a/acupuncture)\nPrint\nOpen all Close all\n####  What is acupuncture? \n![Practitioner puts acupuncture needles in a stomach](https://healthify.nz/assets/Legacy/17548/acupuncture-stomach-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Canva_\nAcupuncture is a form of [complementary and alternative medicine (CAM)](https://healthify.nz/medicines-a-z/c/complementary-and-alternative-medicine \"Complementary and alternative medicine\") and refers to a therapy used to stimulate certain points on your body, normally with needles.  \n  \nThere are 2 main types of acupuncture practised in New Zealand – traditional Chinese acupuncture and Western medical acupuncture.\n####    \nTraditional Chinese acupuncture\nChinese acupuncture as it is practised now is a highly modified version of an ancient practice. It is based on the belief that a‘life force’  \n  \nThe acupuncturist may say there is an imbalance in these elements, and use a variety of techniques, including acupuncture, to bring your body into balance and harmony. These are not scientific concepts, and the language that acupuncturists use is not compatible with the language of other health practitioners in New Zealand.\nThere are different styles of Chinese acupuncture, and some traditional acupuncturists now also use the modern-day knowledge of anatomy but still use this traditional language. \n####    \nWestern acupuncture\nWestern medical acupuncture is also known as dry needling. This is done for musculoskeletal problems, and the aim is to insert the needle into trigger points in your body to try and improve pain and function. The needle points in Western acupuncture may align with the points of traditional Chinese acupuncture.\n####  What conditions is acupuncture used to treat? \nTraditional Chinese Medicine (TCM) providers may use acupuncture to attempt to treat a wide range of health conditions. Some of the conditions treated are pain, mental health conditions, cancer, infertility, digestive problems, respiratory problems, menstrual problems, erectile dysfunction, alcoholism, diabetes, menopause, high blood pressure, baldness and smoking cessation. \nNon-TCM providers, such as some physiotherapists, may use Western medical acupuncture to treat various pain and injury problems, but not some of the other conditions treated by TCM providers. \nThe use of acupuncture is not always based on scientific evidence. Read about the evidence below at\n####  What happens during acupuncture treatment? \nAcupuncture involves using very thin disposable needles being placed in your skin to stimulate specific sensory nerves under your skin and in your muscles.\nThe insertion of needles in certain points can cause your nervous system to release different pain-relieving molecules and can cause changes in your brain. \nIn a typical session, the acupuncturist discusses your symptoms, examines you and talks you through the treatment options they can offer. \nThe first session can take up to an hour and follow up appointments about 15–30 minutes. You usually have 6–12 treatments, spread over a few months, for each condition. \nDepending on what is being treated, 5–20 needles are gently inserted into your skin. You may feel an aching sensation when they are first placed but it should not be painful. The needles stay in place for 10–20 minutes while you relax. They may be moved or twirled during this time. \nAt times you may experience tingling or aching sensations, but you should not feel pain. Let your acupuncturist know if it becomes too uncomfortable or you feel any pain. \nWhen the needles are removed you may be a bit sore, and sometimes have some bruising and a little bleeding. \nMany traditional Chinese medicine providers offer other CAM treatments such as herbal medicine, cupping, moxibustion (burning artemesia near your skin), skin scraping, electro-acupuncture and tui na (Chinese massage). These other treatments are not discussed on this page.\n####  What are the risks of acupuncture? \nAcupuncture is generally very safe. Rare side effects include puncturing your lungs, puncturing the lining of your abdomen, puncturing an organ, infection, breaking a needle and it staying under your skin, and nerve damage.  \n  \nMore common side effects include short-term pain or bruising in the area (about 1 in 30).   \n  \nSerious side effects are more common with poorly trained and unregistered acupuncturists. Registered acupuncturists are required to use disposable sterile needles. \nTalk to your doctor before having acupuncture if you have a bleeding disorder, use blood thinners, have a pacemaker or are pregnant.\n####  Does acupuncture work? \nMost of the research has been done for pain conditions rather than for other conditions such as infertility, cancer and organ problems. Whether acupuncture works or not is a highly controversial area, and the research is inconclusive and conflicting. Much of the effect, if any, may be due to the placebo effect. Read more about[the placebo effect](https://healthify.nz/medicines-a-z/c/complementary-and-alternative-medicine \"Complementary and alternative medicine\"). \nThere are some important points to note about the research on acupuncture.\n  * The diseases treated by traditional acupuncturists don’t exist in Western medicine. One Western diagnosis can have many Eastern diagnoses, eg, diabetes can be diagnosed as‘lung fire’,‘kidney fire’‘stomach fire’.\n  * The treatments are often individualised, and the results may depend on the experience of the practitioner, the cultural context in which it is performed and the expectations of the patient. \n  * There are many different styles and techniques that are taught and practised, and the acupuncture points chosen by practitioners vary widely.\n  * In high-quality research there should be a second group of patients to compare results with who gets placebo treatment. In acupuncture research this is called‘sham acupuncture’. For various reasons this is difficult to perform.\n  * The research quality is highly variable, and many studies are poor quality. Many of the studies have been done in China, where there is concern about publication of fake data.\n\n\n#### Cochrane reviews\nThe most highly regarded organisation for synthesising research in medicine is called Cochrane. Cochrane carries out systematic reviews of health-related research using methods that minimise bias and provide more reliable findings. There are more than 60 Cochrane reviews on acupuncture for a variety of conditions.  \n  \nOn the whole they have not found support for most of the claims of effectiveness by acupuncturists. They either found insufficient evidence or evidence for a small benefit for the use of acupuncture for a limited number of conditions. The evidence does not align with the claims made by many TCM providers. \n#### ACC report\nA 500-page report commissioned by ACC in 2018 concluded that there was some evidence for small short-term relief of some pain conditions, such as some forms of neck pain, some forms of elbow pain, low back pain, some forms of knee pain, and heel pain. The evidence did not support the use of acupuncture for most of the pain conditions they looked at. \n#### Overall\nOverall, acupuncture may have a mild positive effect for some conditions, but it is unlikely to be useful as a sole treatment. Acupuncture is a very passive treatment, where someone is doing something to you. This is in contrast to active treatment where you take an active part in your own treatment, such as stretching and exercise.  \n  \nActive treatments are probably more effective than passive treatments. But passive treatments like acupuncture may have a role in helping you do those active treatments.  \n  \nIf you are considering acupuncture it is recommended you discuss this with the primary health provider treating your pain, such as your doctor or physiotherapist. \n####  Is there any misleading information I should look out for? \nAcupuncture websites and associated advertising such as billboards often say that acupuncture works for a variety of conditions. Acupuncturists may selectively present evidence that supports their view.  \n  \nThey may point to a 2017 report done by Australian acupuncturists called the Acupuncture Evidence Project. This report concluded that acupuncture could be effective in migraine, tension headache, hay fever, nausea and vomiting after surgery and chemotherapy, pain after surgery, low back pain and knee osteoarthritis.  \n  \nThis research was biased as it was funded by the Australian Acupuncture and Chinese Medicine Association, it did not have any medical reviewers from outside the acupuncture industry and it was not published in a medical journal. \nMany New Zealand acupuncture websites provide misleading or false information about the benefits of acupuncture. There have been many complaints to the Advertising Standards Authority that have been upheld, but the practice continues.  \n  \nFor example, 96% of New Zealand websites falsely claimed acupuncture could be effective for mental disorders, and 85% falsely claimed it could be effective for infertility.  \n  \nThe Acupuncture NZ website in August 2020 still listed acupuncture as a treatment for many conditions not supported by evidence, such as infertility, problems with your lungs, digestion, nerves, menopause, high blood pressure and mental health.\n####  Are all acupuncturists licensed and qualified? \nChinese medicine (including acupuncture, Chinese herbal medicine, and tui na massage therapy) is a regulated health profession under the HPCA Act, 2023. Chinese Medicine Practitioners and Acupuncturists, including those practicing Traditional Chinese acupuncture, are registered with the Chinese Medicine Council of New Zealand (CMCNZ).  \n  \n\n####  Is acupuncture treatment subsidised? \nTo be covered for acupuncture by a TCM provider under ACC, you first need to first see a non-TCM health provider who is authorised under ACC to make a diagnosis and lodge an initial claim (called an ACC45 form).  \n  \nAuthorised health providers include a doctor, nurse, osteopath, physiotherapist, podiatrist or chiropractor. ACC does not allow TCM providers to make diagnoses and lodge initial claims.  \n  \nOnce the claim has been accepted you can visit an acupuncturist with or without a referral. ACC subsidises the treatment for some but not all conditions. The average surcharge above the ACC subsidy is around $60 for a 30–45 minute treatment. If herbal medicine is offered then there is an additional surcharge. \nApart from ACC, a limited number of health insurance plans have acupuncture treatment included. You can also see an acupuncturist privately without any subsidy.\n####  Related topics on Healthify \n[Complementary and alternative medicine](https://healthify.nz/medicines-a-z/c/complementary-and-alternative-medicine \"Complementary and alternative medicine\")\n####  More information \n[Evidence for and against acupuncture(external link)(external link)](http://www.nhs.uk/Conditions/Acupuncture/Pages/Evidence.aspx \"Open external link\") NHS, UK, 2019  \n[Poking holes: ACC, acupuncture and the problem of proof(external link)(external link)](https://thespinoff.co.nz/science/19-06-2020/poking-holes-acc-acupuncture-and-the-problem-of-proof/ \"Open external link\") Jonathon Harper and Daniel Ryan, The Spinoff, NZ, 19 June 2020  \nRyan DJ. [Acupuncture, ACC and the Medicines Act(external link)(external link)](https://assets-global.website-files.com/5e332a62c703f653182faf47/5e332a62c703f615722fcb7b_Ryan%20FINAL.pdf \"Open external link\") NZ Med J. 2017 Dec 1;130(1466).  \n[Acupuncture evidence-based review(external link)(external link)](https://pnz.org.nz/Folder?Action=View%20File&Folder_id=472&File=Acupuncture%20EBR%201%20Page%20Summary.pdf \"Open external link\") ACC, NZ, 2018\n#### References\n  1. Melchart D, Weidenhammer W, Streng A, et al. [Prospective investigation of adverse effects of acupuncture in 97 733 patients(external link)(external link)](https://pubmed.ncbi.nlm.nih.gov/14718331/ \"Open external link\") Arch Intern Med. 2004 Jan 12;164(1):104-5.\n  2. The International Centre for Allied Health Evidence.[Effectiveness and safety of acupuncture interventions for the treatment of musculoskeletal conditions– technical report(external link)(external link)](https://www.acc.co.nz/assets/research/2b0c243f75/acupuncture-musculoskeletal-conditions-review.pdf \"Open external link\") Prepared for ACC, NZ, 2018\n  3. [Chinese clinical trials data 80 percent fabricated– government(external link)(external link)](https://www.rfa.org/english/news/china/clinical-fakes-09272016141438.html \"Open external link\") Radio Free Asia, 2016\n  4. McDonald J, Janz S.[The acupuncture evidence project – a(external link)(external link)](https://www.asacu.org/wp-content/uploads/2017/09/Acupuncture-Evidence-Project-The.pdf \"Open external link\") Australian Acupuncture and Chinese Medicine Association Australia, 2017\n  5. [What can acupuncture help with?(external link)(external link)](https://www.acupuncture.org.nz/what-is-acupuncture/what-conditions-can-be-treated-with-acupuncture/ \"Open external link\") Acupuncture NZ, 2020\n  6. [Treatment we can help pay for(external link)(external link)](https://www.acc.co.nz/im-injured/injuries-we-cover/treatment-we-pay-for/ \"Open external link\") ACC, NZ, 2020\n  7. [Insurance and ACC information(external link)(external link)](https://www.acupuncture.org.nz/what-is-acupuncture/can-acc-pay-for-acupuncture/ \"Open external link\") Acupuncture NZ\n  8. Paley CA, Johnson MI.[Acupuncture for the relief of chronic pain: A synthesis of systematic reviews(external link)(external link)](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7023333/ \"Open external link\") Medicina (Kaunas). 2019 Dec 24;56(1):6. \n\n\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/a/acupuncture)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/a/acupuncture)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Jeremy Steinberg, FRNZCGP\nLast reviewed: 04 Sep 2020\nPage last updated: 01 Nov 2024\n![](https://healthify.nz/health-a-z/a/acupuncture)\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/acupuncture \n![image](https://healthify.nz/assets/Uploads/image.png)\n[![Healthify He Puna Waiora logo in orange](https://healthify.nz/assets/Affiliate-Images/Healthify-Logo-Orange__ResizedImageWzI1MSwxMjRd.png) ](https://healthify.nz/)\n[![](https://healthify.nz/assets/Affiliate-Images/HNCT-logo-for-footer__ResizedImageWzI1MCwyMDBd.png) ](https://www.hnct.nz)\n[Home](https://healthify.nz/)\n[Health A–Z](https://healthify.nz/health-a-z)\n[Medicines A–Z](https://healthify.nz/medicines-a-z)\n[Hauora Wellbeing](https://healthify.nz/hauora-wellbeing)\n[Care & Support](https://healthify.nz/care-and-support)\n[App Library](https://healthify.nz/app-library)\n[Tools](https://healthify.nz/tools)\n[News](https://healthify.nz/news)\n[Newsletters](https://healthify.nz/newsletters-sign-up \"Sign up to our newsletters\")\n[Leave a review](https://socialjuice.io/p/healthify \"Link to provide feedback about our site\")\n[About Healthify](https://healthify.nz/about-healthify)\n[How to use Healthify](https://healthify.nz/about-healthify/how-to-use-healthify \"How to use the Healthify He Puna Waiora website\")\n[About Health Navigator Charitable Trust](https://www.hnct.nz)\n[Volunteer / Work with us](https://healthify.nz/about-healthify/volunteer)\n[Accessibility](https://healthify.nz/about-healthify/our-policies#accessibility)\n[Privacy & Cookies Policy](https://healthify.nz/about-healthify/our-policies#privacy-cookies)\n[Disclaimer](https://healthify.nz/about-healthify/our-policies#disclaimer)\n[Contact](https://healthify.nz/contact)\n[Donate](https://healthify.nz/donate)\n[Use Healthify without data](https://portal.zero.govt.nz/28f2e4000bd5a26366ede8abb548f277 \"Link to Zero Data \")\n[For Healthcare Providers](https://healthify.nz/healthcare-providers)\n[Regional HealthPathways NZ](https://healthify.nz/healthcare-providers/r/regional-healthpathways-links-hcps)\n[Journey to Wellbeing | Huarahi Ora](https://www.journeytowellbeing.nz/)\n[Translations](https://healthify.nz/translations)\n[Medicine Brand Changes, Factsheets & Videos](https://healthify.nz/medicines-a-z/m/medicine-brand-changes-factsheets-and-videos)\n[Te Kete Haerenga](https://healthify.nz/tools/t/te-kete-haerenga-wellness-toolkit)\n[![RNZCGP logo showing endorsement of Healthify](https://healthify.nz/assets/Affiliate-Images/RNZCGP-Endorsed-GUIDANCE-logo-Exp-31-Mar-2027__ResizedImageWzE3MCwxNzBd.png) ](https://healthify.nz/about-healthify/why-you-can-trust-us \"rnzcgp-endorsement\")\nScroll to Top\n[ ![shielded](https://healthify.nz/_resources/themes/catalyst-starter/dist/img/shielded_site_logo.png?m=1736474156) ](https://healthify.nz/health-a-z/a/acupuncture)\n© 2025 Health Navigator Charitable Trust CC36318. All rights reserved. \n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-03T05:57:00.392436Z",
    "letter": "a",
    "slug": "acupuncture"
  }
}