{
  "url": "https://healthify.nz/health-a-z/a/aids-hiv/",
  "title": "Aids Hiv",
  "markdown": "  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [H](https://healthify.nz/health-a-z/h)\n\n\n# HIV and AIDS\n## Human immunodeficiency virus and acquired immunodeficiency syndrome\n### Key points about HIV and AIDS\n  * HIV is a virus that damages your immune system and weakens your ability to fight infection and disease.\n  * It's transmitted via sexual activity and sharing of needles.\n  * Left untreated, HIV can cause AIDS.\n  * A person with AIDS has a severe deficiency of their immune system, which increases their risk of severe infections. \n  * There's no cure for HIV, but it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). \n  * Most people living with HIV who are on ART will never develop AIDS.\n\n\n![Coastal sunrise HN 950x690](https://healthify.nz/assets/NZ-outdoors/Coastal-sunrise-HN-950x690.jpg)\nQR Code Print\nOpen all Close all\n####  Overview \nHIV is the name of the virus that causes an infection that damages your immune system and weakens your ability to fight infection and disease. You can be infected with HIV (a virus) without having AIDS (an illness). Left untreated, HIV can cause AIDS – the most advanced stage of HIV infection. \nA person with AIDS has a severe deficiency of their immune system, which increases their risk of severe infections. Although there's no cure for HIV, it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). Most people living with HIV who are on ART will never develop AIDS.\nHIV is a sexually transmitted infection and can also be spread by sharing needles.  \n  \n\n[![](https://healthify.nz/assets/hiv-and-aids-whats-the-difference__ResizedImageWzM1MiwzNTNd.jpg) (external link)](https://hivinfo.nih.gov/understanding-hiv/infographics/hiv-and-aids-whats-difference \"Open external link\")  \n_Image credit: AIDS Info_\n####  How is HIV spread? \nHIV is found in some of the body fluids of people living with HIV, eg, semen, vaginal and anal fluids, blood and breast milk. It can be spread by having unprotected sex (without a condom) with a person living with HIV, or by sharing infected needles and other injecting equipment. It can also be passed on from mother to baby during pregnancy and delivery.   \n  \nYou can't become infected through ordinary day-to-day contact (eg, kissing, hugging, shaking hands) or from sharing personal objects, food or water. \n####  Who is at risk of HIV? \n#### Behaviours and conditions that put you at greater risk of contracting HIV\n  * Having unprotected anal or vaginal sex.\n  * Having another sexually transmitted infection (STI) such as syphilis, herpes, chlamydia, gonorrhoea or [bacterial vaginosis](https://healthify.nz/health-a-z/b/bacterial-vaginosis \"Bacterial vaginosis\").\n  * Sharing contaminated needles, syringes and other injecting equipment and drug solutions when injecting drugs.\n  * Receiving unsafe injections, blood transfusions and tissue transplantation, and medical procedures that involve unsterile (dirty) cutting or piercing.\n  * Experiencing accidental needle-stick injuries, a risk particularly for healthcare workers.\n\n\nWhile anyone can acquire HIV, men who have sex with men, and their sexual partners, are the most affected group in Aotearoa New Zealand. Read more about [HIV in Aotearoa.(external link)](https://www.burnettfoundation.org.nz/learn/hiv/hiv-in-aotearoa/ \"Open external link\")\n####  What are the stages of HIV? \nIf you get HIV and don’t get treatment, you usually progress through 3 stages of disease. Medicine to treat HIV, known as [antiretroviral therapy (ART)](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy), helps you at all stages of the disease if you take it as prescribed. It can slow or prevent progression of HIV from one stage to the next.   \n  \nIf you take HIV medicine as prescribed and get to and keep an undetectable viral load, you have zero risk of passing on HIV to an HIV-negative partner through sex.\n####    \nStage 1: Acute HIV infection\nWithin 2 to 4 weeks after infection with HIV, you may experience a flu-like illness, which may last for a few weeks. This is your body’s natural response to infection.   \n  \nWhen you have acute HIV infection, you have a large amount of virus in your blood and you are very contagious. But people with acute infection are often unaware of being infected, because you may not feel sick right away or at all.   \n  \nTo know whether you have acute infection, you need to have blood tests. If you think you have been exposed to HIV through sex or drug use and you have flu-like symptoms, see your healthcare provider and ask for an HIV test.\n####    \nStage 2: Clinical latency (HIV inactivity or dormancy)\nThis stage is sometimes called asymptomatic HIV infection or chronic HIV infection.   \n  \nDuring this phase, HIV is still active but reproduces at very low levels. You may not have any symptoms or get sick during this time. If you aren’t taking medicine to treat HIV, this period can last a decade or longer, but you may move through this phase faster. You can still pass on HIV to others during this phase. At the end of Stage 2, your viral load starts to go up and your CD4 cell count begins to go down. You may begin to have symptoms as the virus levels increase in your body and you move into Stage 3.   \n  \nHowever, if you take HIV medicine as prescribed and get to and keep an undetectable viral load (or stay virally suppressed), you have zero risk of transmitting HIV to your HIV-negative sexual partners. If you take ART as prescribed, you may stay in this stage indefinitely and may not progress to Stage 3 of the infection.\n####    \nStage 3: Acquired immunodeficiency syndrome (AIDS)\nAIDS is the most severe phase of HIV infection. People with AIDS have badly damaged immune systems and they get an increasing number of severe illnesses, called opportunistic illnesses (eg, tuberculosis (TB), cryptococcal meningitis and severe bacterial infections).   \n  \nYou're diagnosed with AIDS when your CD4 cell count drops below 200 cells/mm or if you develop opportunistic illnesses. People with AIDS can have a high viral load and be very infectious.  \n  \nWithout treatment, people with AIDS typically live about 3 years. Common symptoms of AIDS include chills, fever, sweats, swollen lymph glands, weakness and weight loss.\n####  How do I know if I have HIV? \nThe only way to know for sure whether you have HIV is to get tested. Knowing your status is important because it helps you make healthy decisions to prevent getting or transmitting HIV. If HIV virus is found in your blood, you are said to be HIV positive.  \n  \nHow often you should get tested (the frequency of testing) depends on who you have sex with and what type of sex you have. Use the ['Testing frequency calculator'(external link)](https://www.burnettfoundation.org.nz/tools/how-often-should-i-test-for-hiv/ \"Open external link\") (Burnett Foundation Aotearoa) to get a recommendation on how often you should be tested.   \n  \nIf you think you may have been exposed to HIV, you can use the '[Been exposed tool(external link)](https://www.nzaf.org.nz/awareness-and-prevention/been-exposed/ \"Open external link\")' (Burnett Foundation Aotearoa) to find out the likely risk of a specific event or encounter. If you were at risk of HIV exposure you will also get a recommendation for next steps.   \n\n  * If you think you may have been exposed to HIV, there are several organisations who can arrange a blood test for you – your healthcare provider, Sexual Wellbeing Aotearoa clinic, sexual health clinic, Burnett Foundation Aotearoa, Body Positive, Positive Women and Toitu Te Ao. The result is confidential.\n  * If your first test suggests you have HIV, a further blood test will needed to confirm the result.\n  * If this is positive, you'll be referred to a specialist HIV clinic for some more tests and a discussion about your treatment options. \n  * There is a short period just after being infected with HIV when the virus can't be detected. If you have been exposed to HIV, you may need a follow-up test later. \n  * **Note:** HIV is a notifiable disease which means that it is a legal responsibility for your healthcare provider to notify public health authorities of a HIV positive result. In the notification, you will not identified by name or address (it is anonymous). \n\n\n####  How is HIV treated? \nWhile there's no cure for HIV, it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). These work by stopping the virus replicating (spreading) in your body, allowing your immune system to repair itself and preventing further damage. Taking these medicines can reduce the amount of virus in your body and help you stay healthy, and can also help prevent you passing the virus on to others.  \n  \nYou will also be encouraged to have regular exercise, eat a healthy diet, avoid smoking and keep up-to-date with vaccines to lessen the risk of getting serious illnesses. Without treatment, your immune system will become severely damaged and life-threatening illnesses (eg, cancer and severe infections) can occur. Read more about [antiretroviral therapy](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy).\n####  How can I prevent HIV infection? \nThere are a few things you can do to protect yourself from HIV.\n  * **Practice safe sex:** Using condoms and water-based lubricant correctly every time you have vaginal or anal sex reduces the risk of getting HIV by around 95%. In Aotearoa New Zealand, HIV is most commonly caught by having unprotected sex with a person living with HIV. \n  * **Don't share needles:** If you inject yourself with drugs, it’s important to use new needles and syringes. Blood is left on syringes and needles every time they’re used. If you share injecting equipment, you can catch HIV from another person’s blood if they are living with HIV.\n  * **Have HIV antenatal screening:** Women with HIV can pass it on to their babies during pregnancy, birth and while breastfeeding. If you’re pregnant, you’ll be offered a screening test for HIV at the same time as you have your other blood tests, as a routine part of your antenatal care. The screening programme is run by the National Screening Unit. If you’re found to have HIV, you’ll be offered treatment that reduces the chance of your baby becoming infected from about 25% to less than 1%.\n  * **Use pre-exposure prophylaxis (PrEP):** This is an HIV prevention method for people who don't have HIV but who are at higher risk. By taking this medicine you can reduce your risk of becoming infected with HIV by up to 99%. Read more about [PrEP](https://healthify.nz/medicines-a-z/p/pre-exposure-prophylaxis-prep).\n  * **Use post-exposure prophylaxis (PEP):** This is an emergency medicine for people who may have been exposed to HIV (eg, from a needle-stick injury, unprotected sex, or sexual assault). Read more about [PEP](https://healthify.nz/medicines-a-z/p/post-exposure-prophylaxis). \n\n\nIf you are HIV positive, you can take precautions to avoid spreading the infection to others.\n  * Take your antivirals. It can suppress your viral load to being undetectable and there is no risk of sexual transmission if your viral load stays undetectable. \n  * Tell your sexual partner or partners about your relevant behaviour and whether you are HIV-positive.\n  * Follow safer sex practices, such as using condoms. Read more about [staying safe(external link)](https://www.burnettfoundation.org.nz/learn/staying-safe/ \"Open external link\"). \n  * Don't donate blood, plasma, semen, body organs or body tissues.\n  * Don't share personal items (eg, toothbrushes, razors or sex toys) that may be contaminated with blood, semen or vaginal fluids.\n\n\n####  VIDEOS: Personal stories \n#### Video: More than HIV - Jewel's Story\nThis video may take a few moments to load.  \n  \n\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: I Am\n  \n  \n[![](https://healthify.nz/assets/hiv-video-665x443__ResizedImageWzY1MCw0MzNd.jpg) (external link)](https://www.tvnz.co.nz/shows/i-am \"Open external link\")  \n(TVNZ, NZ, 2018)\n#### Video: More than HIV - Jan's Story\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: More than HIV - Judith's Story\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: More than HIV - Lance's Story  \n  \n\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: HIV - My Story - Florence | NHS\n  \n(NHS, UK, 2021)\n####    \nVideo: CDC: Chris's story, let's stop HIV together\n  \n(CDC, US, 2014)\n####  Support \n[Body Positive NZ(external link)](https://www.bodypositive.org.nz/ \"Open external link\") is a peer support organisation for all people living with HIV in New Zealand  \n[Toitu te Ao Inc(external link)](https://aucklandregion.communityhealthpathways.org/Resources/ToituteAoflyer.pdf) offers support, advocacy, information and education for Māori   \n[Positive Women NZ(external link)](https://positivewomen.org.nz/ \"Open external link\") support organisation for women and families living with and affected by HIV  \n[Burnett Foundation Aotearoa(external link)](https://www.burnettfoundation.org.nz/ \"Open external link\") provides information and support about sex, HIV and AIDS\n####  Related topics on Healthify \n[Antiretroviral therapy](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy \"Antiretroviral therapy\")  \n[Pre-exposure Prophylaxis (PrEP)](https://healthify.nz/medicines-a-z/p/pre-exposure-prophylaxis-prep \"Pre-exposure Prophylaxis \\(PrEP\\)\")  \n[Post-exposure Prophylaxis (PEP)](https://healthify.nz/medicines-a-z/p/post-exposure-prophylaxis)  \n[Common questions about HIV testing](https://healthify.nz/health-a-z/h/hiv-testing \"Common questions about HIV testing\")  \n[HIV and AIDS topics](https://healthify.nz/health-a-z/h/hiv-and-aids-topics \"HIV and AIDS topics\")  \n[Antenatal blood tests – screening for infections](https://healthify.nz/health-a-z/p/pregnancy-blood-tests-screening-for-infections)\n####  More information \n[All about testing(external link)](https://www.nzaf.org.nz/awareness-and-prevention/getting-tested/all-about-testing/ \"Open external link\") Burnett Foundation Aotearoa  \n[Information and support(external link)](https://www.burnettfoundation.org.nz/life-with-hiv/connect/ \"Open external link\") Burnett Foundation Aotearoa  \n[Partner notification(external link)](https://sti.guidelines.org.nz/wp-content/uploads/2021/10/Partner-Notification-final-Sept-2021-v2.pdf \"Open external link\") STI Management Guidelines, NZ   \n[HIV/AIDS(external link)](https://info.health.nz/conditions-treatments/sexual-reproductive/hiv-and-aids/ \"Open external link\") Health New Zealand | Te Whatu Ora  \n[HIV(external link)](http://www.healthysex.nz/STI_Facts/HIV/ \"Open external link\") Healthy Sex, NZ\n#### Resources\n[HIV testing in pregnancy(external link)](https://healthed.govt.nz/products/hiv-testing-in-pregnancy-part-of-antenatal-blood-tests \"Open external link\") HealthEd, NZ  \n[Voluntary counselling and testing for diagnosis of HIV infection](https://healthify.nz/page-not-found) Ministry of Health and Health Promotion Agency, NZ\n#### References\n  1. [HIV basics(external link)](https://www.cdc.gov/hiv/about/index.html \"Open external link\") Centers for Disease Control and Prevention (CDC), US\n  2. [General practitioners and HIV(external link)](https://ashm.org.au/resources-repo/HIV/gp-hiv-20/ASHM_HIV_GPsHIV_vFinalUpdated_Apr20.pdf \"Open external link\") Australasian Society for HIV, Viral Hepatitis and Sexual Health Medicine (ASHM), 2020\n  3. Broyles LN, Luo R, Boeras D, Vojnov L. [The risk of sexual transmission of HIV in individuals with low-level HIV viraemia – a systematic review(external link)](https://pubmed.ncbi.nlm.nih.gov/37490935/ \"Open external link\") Lancet. 2023;402(10400):464-471\n  4. [HIV in Aotearoa(external link)](https://www.burnettfoundation.org.nz/learn/hiv/hiv-in-aotearoa/ \"Open external link\") Burnett Foundation Aotearoa, NZ, 2023\n  5. [How likely is mother-to-child transmission of HIV?(external link)](https://www.aidsmap.com/about-hiv/how-likely-mother-child-transmission-hiv \"Open external link\") Aidsmap, UK, 2022\n\n\n## Brochures\n![hiv testing in pregnancy part of antenatal blood tests](https://healthify.nz/assets/hiv-testing-in-pregnancy-part-of-antenatal-blood-tests.jpg)\n[HIV testing in pregnancy – part of antenatal blood tests](https://healthed.govt.nz/products/hiv-testing-in-pregnancy-part-of-antenatal-blood-tests)  \nHealthEd, NZ, 2024\n![voluntary counselling and testing for diagnosis of hiv infection](https://healthify.nz/assets/voluntary-counselling-and-testing-for-diagnosis-of-hiv-infection.jpg)\n[Voluntary counselling and testing for diagnosis of HIV infection](https://healthify.nz/page-not-found)\nHealthEd, NZ, 2023\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/h/hiv-aids)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/h/hiv-aids)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Cameron Leakey, Research Officer, Burnett Foundation Aotearoa\nLast reviewed: 12 Jun 2024\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/h/hiv-aids \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [H](https://healthify.nz/health-a-z/h)\n\n\n# HIV and AIDS\n## Human immunodeficiency virus and acquired immunodeficiency syndrome\n### Key points about HIV and AIDS\n  * HIV is a virus that damages your immune system and weakens your ability to fight infection and disease.\n  * It's transmitted via sexual activity and sharing of needles.\n  * Left untreated, HIV can cause AIDS.\n  * A person with AIDS has a severe deficiency of their immune system, which increases their risk of severe infections. \n  * There's no cure for HIV, but it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). \n  * Most people living with HIV who are on ART will never develop AIDS.\n\n\n![Coastal sunrise HN 950x690](https://healthify.nz/assets/NZ-outdoors/Coastal-sunrise-HN-950x690.jpg)\nQR Code Print\nOpen all Close all\n####  Overview \nHIV is the name of the virus that causes an infection that damages your immune system and weakens your ability to fight infection and disease. You can be infected with HIV (a virus) without having AIDS (an illness). Left untreated, HIV can cause AIDS – the most advanced stage of HIV infection. \nA person with AIDS has a severe deficiency of their immune system, which increases their risk of severe infections. Although there's no cure for HIV, it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). Most people living with HIV who are on ART will never develop AIDS.\nHIV is a sexually transmitted infection and can also be spread by sharing needles.  \n  \n\n[![](https://healthify.nz/assets/hiv-and-aids-whats-the-difference__ResizedImageWzM1MiwzNTNd.jpg) (external link)](https://hivinfo.nih.gov/understanding-hiv/infographics/hiv-and-aids-whats-difference \"Open external link\")  \n_Image credit: AIDS Info_\n####  How is HIV spread? \nHIV is found in some of the body fluids of people living with HIV, eg, semen, vaginal and anal fluids, blood and breast milk. It can be spread by having unprotected sex (without a condom) with a person living with HIV, or by sharing infected needles and other injecting equipment. It can also be passed on from mother to baby during pregnancy and delivery.   \n  \nYou can't become infected through ordinary day-to-day contact (eg, kissing, hugging, shaking hands) or from sharing personal objects, food or water. \n####  Who is at risk of HIV? \n#### Behaviours and conditions that put you at greater risk of contracting HIV\n  * Having unprotected anal or vaginal sex.\n  * Having another sexually transmitted infection (STI) such as syphilis, herpes, chlamydia, gonorrhoea or [bacterial vaginosis](https://healthify.nz/health-a-z/b/bacterial-vaginosis \"Bacterial vaginosis\").\n  * Sharing contaminated needles, syringes and other injecting equipment and drug solutions when injecting drugs.\n  * Receiving unsafe injections, blood transfusions and tissue transplantation, and medical procedures that involve unsterile (dirty) cutting or piercing.\n  * Experiencing accidental needle-stick injuries, a risk particularly for healthcare workers.\n\n\nWhile anyone can acquire HIV, men who have sex with men, and their sexual partners, are the most affected group in Aotearoa New Zealand. Read more about [HIV in Aotearoa.(external link)](https://www.burnettfoundation.org.nz/learn/hiv/hiv-in-aotearoa/ \"Open external link\")\n####  What are the stages of HIV? \nIf you get HIV and don’t get treatment, you usually progress through 3 stages of disease. Medicine to treat HIV, known as [antiretroviral therapy (ART)](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy), helps you at all stages of the disease if you take it as prescribed. It can slow or prevent progression of HIV from one stage to the next.   \n  \nIf you take HIV medicine as prescribed and get to and keep an undetectable viral load, you have zero risk of passing on HIV to an HIV-negative partner through sex.\n####    \nStage 1: Acute HIV infection\nWithin 2 to 4 weeks after infection with HIV, you may experience a flu-like illness, which may last for a few weeks. This is your body’s natural response to infection.   \n  \nWhen you have acute HIV infection, you have a large amount of virus in your blood and you are very contagious. But people with acute infection are often unaware of being infected, because you may not feel sick right away or at all.   \n  \nTo know whether you have acute infection, you need to have blood tests. If you think you have been exposed to HIV through sex or drug use and you have flu-like symptoms, see your healthcare provider and ask for an HIV test.\n####    \nStage 2: Clinical latency (HIV inactivity or dormancy)\nThis stage is sometimes called asymptomatic HIV infection or chronic HIV infection.   \n  \nDuring this phase, HIV is still active but reproduces at very low levels. You may not have any symptoms or get sick during this time. If you aren’t taking medicine to treat HIV, this period can last a decade or longer, but you may move through this phase faster. You can still pass on HIV to others during this phase. At the end of Stage 2, your viral load starts to go up and your CD4 cell count begins to go down. You may begin to have symptoms as the virus levels increase in your body and you move into Stage 3.   \n  \nHowever, if you take HIV medicine as prescribed and get to and keep an undetectable viral load (or stay virally suppressed), you have zero risk of transmitting HIV to your HIV-negative sexual partners. If you take ART as prescribed, you may stay in this stage indefinitely and may not progress to Stage 3 of the infection.\n####    \nStage 3: Acquired immunodeficiency syndrome (AIDS)\nAIDS is the most severe phase of HIV infection. People with AIDS have badly damaged immune systems and they get an increasing number of severe illnesses, called opportunistic illnesses (eg, tuberculosis (TB), cryptococcal meningitis and severe bacterial infections).   \n  \nYou're diagnosed with AIDS when your CD4 cell count drops below 200 cells/mm or if you develop opportunistic illnesses. People with AIDS can have a high viral load and be very infectious.  \n  \nWithout treatment, people with AIDS typically live about 3 years. Common symptoms of AIDS include chills, fever, sweats, swollen lymph glands, weakness and weight loss.\n####  How do I know if I have HIV? \nThe only way to know for sure whether you have HIV is to get tested. Knowing your status is important because it helps you make healthy decisions to prevent getting or transmitting HIV. If HIV virus is found in your blood, you are said to be HIV positive.  \n  \nHow often you should get tested (the frequency of testing) depends on who you have sex with and what type of sex you have. Use the ['Testing frequency calculator'(external link)](https://www.burnettfoundation.org.nz/tools/how-often-should-i-test-for-hiv/ \"Open external link\") (Burnett Foundation Aotearoa) to get a recommendation on how often you should be tested.   \n  \nIf you think you may have been exposed to HIV, you can use the '[Been exposed tool(external link)](https://www.nzaf.org.nz/awareness-and-prevention/been-exposed/ \"Open external link\")' (Burnett Foundation Aotearoa) to find out the likely risk of a specific event or encounter. If you were at risk of HIV exposure you will also get a recommendation for next steps.   \n\n  * If you think you may have been exposed to HIV, there are several organisations who can arrange a blood test for you – your healthcare provider, Sexual Wellbeing Aotearoa clinic, sexual health clinic, Burnett Foundation Aotearoa, Body Positive, Positive Women and Toitu Te Ao. The result is confidential.\n  * If your first test suggests you have HIV, a further blood test will needed to confirm the result.\n  * If this is positive, you'll be referred to a specialist HIV clinic for some more tests and a discussion about your treatment options. \n  * There is a short period just after being infected with HIV when the virus can't be detected. If you have been exposed to HIV, you may need a follow-up test later. \n  * **Note:** HIV is a notifiable disease which means that it is a legal responsibility for your healthcare provider to notify public health authorities of a HIV positive result. In the notification, you will not identified by name or address (it is anonymous). \n\n\n####  How is HIV treated? \nWhile there's no cure for HIV, it can be controlled with a combination of medicines, known as antiretroviral therapy (ART). These work by stopping the virus replicating (spreading) in your body, allowing your immune system to repair itself and preventing further damage. Taking these medicines can reduce the amount of virus in your body and help you stay healthy, and can also help prevent you passing the virus on to others.  \n  \nYou will also be encouraged to have regular exercise, eat a healthy diet, avoid smoking and keep up-to-date with vaccines to lessen the risk of getting serious illnesses. Without treatment, your immune system will become severely damaged and life-threatening illnesses (eg, cancer and severe infections) can occur. Read more about [antiretroviral therapy](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy).\n####  How can I prevent HIV infection? \nThere are a few things you can do to protect yourself from HIV.\n  * **Practice safe sex:** Using condoms and water-based lubricant correctly every time you have vaginal or anal sex reduces the risk of getting HIV by around 95%. In Aotearoa New Zealand, HIV is most commonly caught by having unprotected sex with a person living with HIV. \n  * **Don't share needles:** If you inject yourself with drugs, it’s important to use new needles and syringes. Blood is left on syringes and needles every time they’re used. If you share injecting equipment, you can catch HIV from another person’s blood if they are living with HIV.\n  * **Have HIV antenatal screening:** Women with HIV can pass it on to their babies during pregnancy, birth and while breastfeeding. If you’re pregnant, you’ll be offered a screening test for HIV at the same time as you have your other blood tests, as a routine part of your antenatal care. The screening programme is run by the National Screening Unit. If you’re found to have HIV, you’ll be offered treatment that reduces the chance of your baby becoming infected from about 25% to less than 1%.\n  * **Use pre-exposure prophylaxis (PrEP):** This is an HIV prevention method for people who don't have HIV but who are at higher risk. By taking this medicine you can reduce your risk of becoming infected with HIV by up to 99%. Read more about [PrEP](https://healthify.nz/medicines-a-z/p/pre-exposure-prophylaxis-prep).\n  * **Use post-exposure prophylaxis (PEP):** This is an emergency medicine for people who may have been exposed to HIV (eg, from a needle-stick injury, unprotected sex, or sexual assault). Read more about [PEP](https://healthify.nz/medicines-a-z/p/post-exposure-prophylaxis). \n\n\nIf you are HIV positive, you can take precautions to avoid spreading the infection to others.\n  * Take your antivirals. It can suppress your viral load to being undetectable and there is no risk of sexual transmission if your viral load stays undetectable. \n  * Tell your sexual partner or partners about your relevant behaviour and whether you are HIV-positive.\n  * Follow safer sex practices, such as using condoms. Read more about [staying safe(external link)](https://www.burnettfoundation.org.nz/learn/staying-safe/ \"Open external link\"). \n  * Don't donate blood, plasma, semen, body organs or body tissues.\n  * Don't share personal items (eg, toothbrushes, razors or sex toys) that may be contaminated with blood, semen or vaginal fluids.\n\n\n####  VIDEOS: Personal stories \n#### Video: More than HIV - Jewel's Story\nThis video may take a few moments to load.  \n  \n\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: I Am\n  \n  \n[![](https://healthify.nz/assets/hiv-video-665x443__ResizedImageWzY1MCw0MzNd.jpg) (external link)](https://www.tvnz.co.nz/shows/i-am \"Open external link\")  \n(TVNZ, NZ, 2018)\n#### Video: More than HIV - Jan's Story\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: More than HIV - Judith's Story\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: More than HIV - Lance's Story  \n  \n\n  \n(NZ AIDS Foundation, NZ, 2015)\n####    \nVideo: HIV - My Story - Florence | NHS\n  \n(NHS, UK, 2021)\n####    \nVideo: CDC: Chris's story, let's stop HIV together\n  \n(CDC, US, 2014)\n####  Support \n[Body Positive NZ(external link)](https://www.bodypositive.org.nz/ \"Open external link\") is a peer support organisation for all people living with HIV in New Zealand  \n[Toitu te Ao Inc(external link)](https://aucklandregion.communityhealthpathways.org/Resources/ToituteAoflyer.pdf) offers support, advocacy, information and education for Māori   \n[Positive Women NZ(external link)](https://positivewomen.org.nz/ \"Open external link\") support organisation for women and families living with and affected by HIV  \n[Burnett Foundation Aotearoa(external link)](https://www.burnettfoundation.org.nz/ \"Open external link\") provides information and support about sex, HIV and AIDS\n####  Related topics on Healthify \n[Antiretroviral therapy](https://healthify.nz/medicines-a-z/a/antiretroviral-therapy \"Antiretroviral therapy\")  \n[Pre-exposure Prophylaxis (PrEP)](https://healthify.nz/medicines-a-z/p/pre-exposure-prophylaxis-prep \"Pre-exposure Prophylaxis \\(PrEP\\)\")  \n[Post-exposure Prophylaxis (PEP)](https://healthify.nz/medicines-a-z/p/post-exposure-prophylaxis)  \n[Common questions about HIV testing](https://healthify.nz/health-a-z/h/hiv-testing \"Common questions about HIV testing\")  \n[HIV and AIDS topics](https://healthify.nz/health-a-z/h/hiv-and-aids-topics \"HIV and AIDS topics\")  \n[Antenatal blood tests – screening for infections](https://healthify.nz/health-a-z/p/pregnancy-blood-tests-screening-for-infections)\n####  More information \n[All about testing(external link)](https://www.nzaf.org.nz/awareness-and-prevention/getting-tested/all-about-testing/ \"Open external link\") Burnett Foundation Aotearoa  \n[Information and support(external link)](https://www.burnettfoundation.org.nz/life-with-hiv/connect/ \"Open external link\") Burnett Foundation Aotearoa  \n[Partner notification(external link)](https://sti.guidelines.org.nz/wp-content/uploads/2021/10/Partner-Notification-final-Sept-2021-v2.pdf \"Open external link\") STI Management Guidelines, NZ   \n[HIV/AIDS(external link)](https://info.health.nz/conditions-treatments/sexual-reproductive/hiv-and-aids/ \"Open external link\") Health New Zealand | Te Whatu Ora  \n[HIV(external link)](http://www.healthysex.nz/STI_Facts/HIV/ \"Open external link\") Healthy Sex, NZ\n#### Resources\n[HIV testing in pregnancy(external link)](https://healthed.govt.nz/products/hiv-testing-in-pregnancy-part-of-antenatal-blood-tests \"Open external link\") HealthEd, NZ  \n[Voluntary counselling and testing for diagnosis of HIV infection](https://healthify.nz/page-not-found) Ministry of Health and Health Promotion Agency, NZ\n#### References\n  1. [HIV basics(external link)](https://www.cdc.gov/hiv/about/index.html \"Open external link\") Centers for Disease Control and Prevention (CDC), US\n  2. [General practitioners and HIV(external link)](https://ashm.org.au/resources-repo/HIV/gp-hiv-20/ASHM_HIV_GPsHIV_vFinalUpdated_Apr20.pdf \"Open external link\") Australasian Society for HIV, Viral Hepatitis and Sexual Health Medicine (ASHM), 2020\n  3. Broyles LN, Luo R, Boeras D, Vojnov L. [The risk of sexual transmission of HIV in individuals with low-level HIV viraemia – a systematic review(external link)](https://pubmed.ncbi.nlm.nih.gov/37490935/ \"Open external link\") Lancet. 2023;402(10400):464-471\n  4. [HIV in Aotearoa(external link)](https://www.burnettfoundation.org.nz/learn/hiv/hiv-in-aotearoa/ \"Open external link\") Burnett Foundation Aotearoa, NZ, 2023\n  5. [How likely is mother-to-child transmission of HIV?(external link)](https://www.aidsmap.com/about-hiv/how-likely-mother-child-transmission-hiv \"Open external link\") Aidsmap, UK, 2022\n\n\n## Brochures\n![hiv testing in pregnancy part of antenatal blood tests](https://healthify.nz/assets/hiv-testing-in-pregnancy-part-of-antenatal-blood-tests.jpg)\n[HIV testing in pregnancy – part of antenatal blood tests](https://healthed.govt.nz/products/hiv-testing-in-pregnancy-part-of-antenatal-blood-tests)  \nHealthEd, NZ, 2024\n![voluntary counselling and testing for diagnosis of hiv infection](https://healthify.nz/assets/voluntary-counselling-and-testing-for-diagnosis-of-hiv-infection.jpg)\n[Voluntary counselling and testing for diagnosis of HIV infection](https://healthify.nz/page-not-found)\nHealthEd, NZ, 2023\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/h/hiv-aids)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/h/hiv-aids)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Cameron Leakey, Research Officer, Burnett Foundation Aotearoa\nLast reviewed: 12 Jun 2024\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/h/hiv-aids \n![image](https://healthify.nz/assets/Uploads/image.png)\n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-04T02:56:30.779835Z",
    "letter": "a",
    "slug": "aids-hiv"
  }
}