{
  "url": "https://healthify.nz/health-a-z/a/angina/",
  "title": "Angina",
  "markdown": "[Skip to main content](https://healthify.nz/health-a-z/a/angina#main)\n  * [ Healthify on Instagram ](https://www.instagram.com/healthify_hepunawaiora/ \"Follow us on Instagram\")\n  * [ Healthify on Facebook ](https://facebook.com/healthifyhepunawaiora \"Follow us on Facebook\")\n\n\n![logo black](https://healthify.nz/assets/Uploads/logo-black.png)\n[ ![logo orange v2](https://healthify.nz/assets/Uploads/logo-orange-v2.png) ](https://healthify.nz)\nSearch\nSearch this website\n  * [Health A–Z](https://healthify.nz/health-a-z) Show submenu for Health A–Z\n  *     * [A](https://healthify.nz/health-a-z/a)\n    * [B](https://healthify.nz/health-a-z/b)\n    * [C](https://healthify.nz/health-a-z/c)\n    * [D](https://healthify.nz/health-a-z/d)\n    * [E](https://healthify.nz/health-a-z/e)\n    * [F](https://healthify.nz/health-a-z/f)\n    * [G](https://healthify.nz/health-a-z/g)\n    * [H](https://healthify.nz/health-a-z/h)\n    * [I](https://healthify.nz/health-a-z/i)\n    * [J](https://healthify.nz/health-a-z/j)\n    * [K](https://healthify.nz/health-a-z/k)\n    * [L](https://healthify.nz/health-a-z/l)\n    * [M](https://healthify.nz/health-a-z/m)\n    * [N](https://healthify.nz/health-a-z/n)\n    * [O](https://healthify.nz/health-a-z/o)\n    * [P](https://healthify.nz/health-a-z/p)\n    * [Q](https://healthify.nz/health-a-z/q)\n    * [R](https://healthify.nz/health-a-z/r)\n    * [S](https://healthify.nz/health-a-z/s)\n    * [T](https://healthify.nz/health-a-z/t)\n    * [U](https://healthify.nz/health-a-z/u)\n    * [V](https://healthify.nz/health-a-z/v)\n    * [W](https://healthify.nz/health-a-z/w)\n    * [X](https://healthify.nz/health-a-z/x)\n    * [Z](https://healthify.nz/health-a-z/z)\n  * [Medicines A–Z](https://healthify.nz/medicines-a-z) Show submenu for Medicines A–Z\n  *     * [A](https://healthify.nz/medicines-a-z/a)\n    * [B](https://healthify.nz/medicines-a-z/b)\n    * [C](https://healthify.nz/medicines-a-z/c)\n    * [D](https://healthify.nz/medicines-a-z/d)\n    * [E](https://healthify.nz/medicines-a-z/e)\n    * [F](https://healthify.nz/medicines-a-z/f)\n    * [G](https://healthify.nz/medicines-a-z/g)\n    * [H](https://healthify.nz/medicines-a-z/h)\n    * [I](https://healthify.nz/medicines-a-z/i)\n    * [J](https://healthify.nz/medicines-a-z/j)\n    * [K](https://healthify.nz/medicines-a-z/k)\n    * [L](https://healthify.nz/medicines-a-z/l)\n    * [M](https://healthify.nz/medicines-a-z/m)\n    * [N](https://healthify.nz/medicines-a-z/n)\n    * [O](https://healthify.nz/medicines-a-z/o)\n    * [P](https://healthify.nz/medicines-a-z/p)\n    * [Q](https://healthify.nz/medicines-a-z/q)\n    * [R](https://healthify.nz/medicines-a-z/r)\n    * [S](https://healthify.nz/medicines-a-z/s)\n    * [T](https://healthify.nz/medicines-a-z/t)\n    * [U](https://healthify.nz/medicines-a-z/u)\n    * [V](https://healthify.nz/medicines-a-z/v)\n    * [W](https://healthify.nz/medicines-a-z/w)\n    * [X](https://healthify.nz/medicines-a-z/x)\n    * [Y](https://healthify.nz/medicines-a-z/y)\n    * [Z](https://healthify.nz/medicines-a-z/z)\n  * [Hauora Wellbeing](https://healthify.nz/hauora-wellbeing) Show submenu for Hauora Wellbeing\n  *     * [A](https://healthify.nz/hauora-wellbeing/a)\n    * [B](https://healthify.nz/hauora-wellbeing/b)\n    * [C](https://healthify.nz/hauora-wellbeing/c)\n    * [D](https://healthify.nz/hauora-wellbeing/d)\n    * [E](https://healthify.nz/hauora-wellbeing/e)\n    * [F](https://healthify.nz/hauora-wellbeing/f)\n    * [G](https://healthify.nz/hauora-wellbeing/g)\n    * [H](https://healthify.nz/hauora-wellbeing/h)\n    * [I](https://healthify.nz/hauora-wellbeing/i)\n    * [K](https://healthify.nz/hauora-wellbeing/k)\n    * [L](https://healthify.nz/hauora-wellbeing/l)\n    * [M](https://healthify.nz/hauora-wellbeing/m)\n    * [N](https://healthify.nz/hauora-wellbeing/n)\n    * [O](https://healthify.nz/hauora-wellbeing/o)\n    * [P](https://healthify.nz/hauora-wellbeing/p)\n    * [R](https://healthify.nz/hauora-wellbeing/r)\n    * [S](https://healthify.nz/hauora-wellbeing/s)\n    * [T](https://healthify.nz/hauora-wellbeing/t)\n    * [V](https://healthify.nz/hauora-wellbeing/v)\n    * [W](https://healthify.nz/hauora-wellbeing/w)\n    * [Y](https://healthify.nz/hauora-wellbeing/y)\n    * [Z](https://healthify.nz/hauora-wellbeing/z)\n  * [Care & Support](https://healthify.nz/care-and-support)\n  * [App Library](https://healthify.nz/app-library)\n  * [Tools](https://healthify.nz/tools) Show submenu for Tools\n  *     * [A](https://healthify.nz/tools/a)\n    * [B](https://healthify.nz/tools/b)\n    * [C](https://healthify.nz/tools/c)\n    * [D](https://healthify.nz/tools/d)\n    * [E](https://healthify.nz/tools/e)\n    * [F](https://healthify.nz/tools/f)\n    * [G](https://healthify.nz/tools/g)\n    * [H](https://healthify.nz/tools/h)\n    * [I](https://healthify.nz/tools/i)\n    * [J](https://healthify.nz/tools/j)\n    * [K](https://healthify.nz/tools/k)\n    * [L](https://healthify.nz/tools/l)\n    * [M](https://healthify.nz/tools/m)\n    * [N](https://healthify.nz/tools/n)\n    * [O](https://healthify.nz/tools/o)\n    * [P](https://healthify.nz/tools/p)\n    * [R](https://healthify.nz/tools/r)\n    * [S](https://healthify.nz/tools/s)\n    * [T](https://healthify.nz/tools/t)\n    * [W](https://healthify.nz/tools/w)\n  * [Donate](https://healthify.nz/donate)\n\n\nSearch\nSearch this website\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Angina\n### Key points about angina\n  * Angina is pain or discomfort, usually in your chest, that occurs when not enough blood gets to your heart muscle.\n  * You might experience an unpleasant feeling, tightness, pressure or weight on your chest, and sometimes a feeling of breathlessness.\n  * While it's not usually life-threatening, it is a warning sign that you could be at risk of a heart attack or stroke.\n  * It usually only lasts a few minutes and can be relieved by rest and/or medicine.\n  * If your angina isn’t relieved with rest and 2 doses of your medicine 5 minutes apart, call 111 and ask for an ambulance.\n\n\n![Older man with chest pain ](https://healthify.nz/assets/Health-A-Z/Pain/Older-man-with-chest-pain-Freepix-950x690.jpg)\nQR Code Print\nOpen all Close all\n####  Could it be a heart attack? \nIf your angina symptoms don’t improve with rest and 2 doses of your angina medicine 5 minutes apart it could be a heart attack.\nIf your symptoms are not improving 5 minutes after your second dose of angina medicine, **call 111 and ask for an ambulance** **immediately**.\n####  What is angina? (+ VIDEO) \nAngina is pain or discomfort, usually in your chest, that occurs when not enough blood gets to your heart muscle.\nYou might experience an unpleasant feeling, tightness, pressure or weight on your chest, and sometimes a feeling of breathlessness. It usually only lasts a few minutes and can be relieved by rest and/or medicine.\nAlthough it's not usually life-threatening, it’s a warning sign that you could be at risk of a heart attack or stroke.\nIf your angina happens more often or gets worse, lasts longer or happens when you’re doing very little or resting, see your healthcare provider in the next 24 hours.\n####    \nVideo: What is angina?  \n  \n\n(British Heart Foundation, UK, 2019)\n####  What are the symptoms of angina? \nThe symptoms of angina are sometimes called an angina attack or episode. The main symptom is chest pain or discomfort.\n  * The pain may feel tight, dull or heavy and is usually felt across the centre of your chest.\n  * It may also be felt in either or both shoulders, your neck or jaw, down one or both arms and in your hands.\n  * You may get pain or discomfort in only one of these areas and not in your chest at all.\n  * Angina is usually brought on by physical exertion or stress.\n  * Angina usually stops within a few minutes of resting or taking angina medicines.\n\n\nAngina can also cause breathlessness, nausea (feeling sick), feeling sweaty, pain in your lower chest or belly that's similar to indigestion and fatigue. **O****lder people, people with diabetes and women are more likely to have these symptoms.**\nYou may get angina when you’re sitting down or even during the night. It’s often experienced at particular times of the day, such as first thing in the morning or late afternoon.\n####    \nTypes of angina\nThere are 2 main types of angina.\n  * **Stable angina** (the most common type) is when something, such as exercise, triggers your symptoms. The symptoms improve with medicines and rest.\n  * **Unstable angina** (the more serious type) is when attacks are more unpredictable. They can happen while you’re resting, last longer than 15 to 20 minutes and can continue even after resting and taking angina medicine (if you’ve used this before). It’s a sign that you could have a heart attack soon.\n\n\n####  Angina action plan – what to do if you have an attack \n#### What to do in an angina attack\nFollow this action plan if you have an angina attack\n  1. If you’re having angina symptoms, stop what you’re doing and rest. Tell someone how you’re feeling and use your glyceryl trinitrate (GTN) medicine – take 1 puff of your GTN spray or put 1 tablet under your tongue.\n  2. If you still have symptoms after 5 minutes, take 1 more puff of your GTN spray or put 1 more tablet under your tongue.\n  3. If you still have symptoms 5 minutes after taking the second dose of GTN, call 111 and ask for an ambulance. If a paramedic advises it, chew an aspirin while you wait.\n\n\nIf your symptoms are relieved, you can get back to your activities gently.\nIf your angina becomes more frequent or severe, lasts longer or happens when you are doing very little or resting, see your healthcare provider in the next 24 hours.\nIf you’re not sure what to do, you can call [Healthline(external link)](https://www.health.govt.nz/your-health/services-and-support/health-care-services/healthline \"Open external link\") on 0800 611 116 for free health advice at any time.\n####  What should I do if I have angina symptoms? \n#### Regular pattern of symptoms\nIf you get angina at predictable times (eg, in cold temperatures, walking up hills, while mowing lawns or showering, during sexual activity or at work) use your glyceryl trinitrate (GTN) spray a few minutes before doing that activity. If you’re experiencing angina symptoms every day, see your healthcare provider in case you need more, or different, treatment.\n####    \nChange in symptoms\nSee your healthcare provider within 24 hours if the pattern of your angina symptoms changes significantly in one or more of the following ways:\n  * Frequency – you get angina more often.\n  * Severity – your symptoms get worse.\n  * Duration – your symptoms last longer.\n  * Your symptoms occur when you're doing very little or you’re resting. \n\n\nContinue to use your medicine in the meantime. \n####  What causes angina? \nIn most cases, angina is caused by [coronary artery disease (CAD)](https://healthify.nz/health-a-z/c/coronary-artery-disease). Your coronary arteries supply blood to your heart muscle and CAD occurs when fatty deposits build up inside them. This causes narrowing of these arteries resulting in poor blood flow to your heart muscle. The build-up of fatty deposits in the arteries is called [atherosclerosis](https://healthify.nz/health-a-z/a/atherosclerosis).\n![Normal artery and artery blocked by plaque with atherosclerosis](https://healthify.nz/assets/Health-A-Z/Cardiac/Atherosclerosis-Depositphotos-950x690__ResizedImageWzYwMCw0MzZd.jpg)\n_Image credit: Depositphotos_\n  \nThings that can increase your risk of atherosclerosis include:\n  * getting older\n  * an unhealthy diet\n  * a lack of exercise\n  * being overweight\n  * regularly drinking too much alcohol\n  * smoking\n  * other health conditions, including [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high), [high cholesterol](https://healthify.nz/health-a-z/c/cholesterol-high \"High cholesterol\")[diabetes](https://healthify.nz/health-a-z/d/diabetes \"Diabetes\")\n  * a family history of atherosclerosis or heart problems.\n\n\nSome people can get angina even if their coronary arteries aren’t significantly narrowed.\n####  What is the difference between angina and a heart attack? \nAngina is caused by a temporary reduction in the blood flow to part of your heart muscle, a heart attack is caused by an actual blockage.\nAngina doesn’t damage your heart muscle but a heart attack causes permanent damage.\nAngina is usually eased fairly quickly by resting and using GTN spray, but with a heart attack the pain can last longer than 15 minutes and rest and GTN spray doesn’t help.\n**If you think you might be having a heart attack, call 111 for an ambulance.  \n  \n**\n![Characteristics of angina and a heart attack](https://healthify.nz/assets/Infographics/Angina-or-heart-attack-HN-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Healtify He Puna Waiora_\n####  How is angina diagnosed? \nSee your healthcare provider if you've had an episode of chest pain or are concerned about angina. They may ask about:\n  * your symptoms – what you experienced, when they happened and what you were doing at the time, and if anything makes them better or worse\n  * your lifestyle, eg, what your diet is like and whether you smoke\n  * whether heart problems run in your family.\n\n\nThey may also measure your:\n  * blood pressure\n  * weight\n  * blood glucose and cholesterol, along with other blood tests, including a full blood count and troponin level (which indicates if there’s damage to your heart muscle).\n\n\nIf they think you might have angina, they may refer you to hospital for further tests to confirm the diagnosis.\n#### Further tests\nTo confirm if you have angina and assess your risk of more serious problems such as heart attacks or stroke, you may have one or more of the following:\n  * An [electrocardiogram (ECG)](https://healthify.nz/health-a-z/e/electrocardiograph-ecg) – to check your heart's rhythm and electrical activity.\n  * An exercise ECG – an ECG that's recorded while you're exercising on a treadmill or stationary bike to assess your heart's response to stress or exercise.\n  * A [coronary angiography](https://healthify.nz/health-a-z/c/coronary-angiography) – a procedure that uses a special dye (contrast material) and X-rays to see how blood flows through the arteries in your heart.\n  * An [echocardiogram (ECHO)](https://healthify.nz/health-a-z/e/echocardiogram) – a type of ultrasound which looks at your heart and how it's working. It can be performed when you're at rest or it may be done after being given medication which stimulates your heart, to see how it responds to stress.\n  * A [CT calcium score](https://healthify.nz/health-a-z/c/ct-calcium-score) test – a scan that looks at how your blood flows in the arteries of your heart. \n  * A myocardial perfusion scan – a scan that looks at how your blood flows to your heart muscle at rest and under stress. \n  * Blood tests.\n\n\nFind out more about the different [heart tests](https://healthify.nz/health-a-z/h/heart-disease-tests).\n####    \nWhat happens if I'm diagnosed with angina?\nIf you have stable angina, you’ll be given medicines to treat attacks when they occur and reduce the risk of further attacks. Your healthcare provider may refer you to a heart specialist (a cardiologist).\nIf you have unstable angina, you’ll be referred urgently to hospital for further tests and treatment, which may include surgery. You’ll need medicines to prevent blood clots and reduce your risk of having a heart attack or stroke. \n####  How is angina treated? \nA combination of medicines and a healthy lifestyle can help stop angina attacks and reduce the risk of further problems such as a heart attack.\n  * You may need to take several medicines to control your angina.\n  * Adopting a [heart-healthy lifestyle](https://healthify.nz/health-a-z/h/heart-disease-risk-factors) will help prevent further damage.\n  * Surgery may be recommended if medicines and lifestyle changes don't help.\n\n\n####    \nMedicines for angina\nThere are a variety of medicines for angina, which work in different ways. Medicines are used together with healthy lifestyle choices such as eating a healthy balanced diet, maintaining a healthy weight and exercising regularly.\nThe following are examples of the medicines used to ease and prevent chest pain and reduce your chances of further heart problems. Not everyone with angina will be prescribed the same medicines. Your healthcare provider will prescribe the medicines that work best for you.\n**Medicines to ease chest pain**\nGTN (glyceryl trinitrate) is available in Aotearoa New Zealand as a spray. It’s used to ease chest pain and provides rapid relief from angina symptoms. You spray it under your tongue so that it works quickly.\n  * GTN works by widening blood vessels, letting more blood and oxygen reach your heart, which reduces strain on it and makes it easier for it to pump blood.\n  * It can also be used if you’re going to do something that triggers angina pain, such as exercise or climbing stairs.\n  * Always carry your GTN spray with you and know how to use them. Read more about [GTN spray](https://healthify.nz/medicines-a-z/g/glyceryl-trinitrate-spray). \n\n\n**Medicines to prevent angina**\nThe following are examples of medicines used to prevent chest pain and angina symptoms from happening. They must be taken every day on an ongoing basis.\n  * **Beta-blockers** such as metoprolol and bisoprolol reduce the work your heart has to do, so it needs less oxygen. This helps prevent angina. Read more about [beta-blockers](https://healthify.nz/medicines-a-z/b/beta-blockers).\n  * **Calcium channel blockers** such as amlodipine or felodipine are used when beta-blockers are not suitable, such as if you have angina due to blood vessel spasm, or asthma. Read more about [calcium channel blockers](https://healthify.nz/medicines-a-z/c/calcium-channel-blockers). \n  * **Isosorbide mononitrate** works by widening blood vessels, letting more blood and oxygen reach your heart. This reduces strain on your heart and makes it easier for it to pump blood. It can be used when beta-blockers or calcium channels are unsuitable, or can be used in combination with these if they're not working well enough. Read more about [isosorbide mononitrate](https://healthify.nz/medicines-a-z/i/isosorbide-mononitrate). \n\n\n**Medicines to reduce further heart problems**\nIf you have angina you’re at high risk of having serious heart problems such as a heart attack. To reduce your risk of heart problems and stroke, your healthcare provider may prescribe other medicines including:\n  * medicines to lower your [cholesterol](https://healthify.nz/health-a-z/c/cholesterol-high) such as [statins](https://healthify.nz/health-a-z/a/angina)\n  * blood thinning medicines that reduce the chance of blood clots developing such as [aspirin](https://healthify.nz/medicines-a-z/a/aspirin-low-dose)\n  * medicines to control your blood pressure\n  * medicines to control your diabetes.\n\n\nRead more about [medicines used for heart problems](https://healthify.nz/medicines-a-z/c/cardiovascular-medications).\n####    \nSurgery for angina \nIf medicines and lifestyle changes aren't helping control your angina, or if you have unstable angina, surgery may be recommended.\nThe 2 main types of surgery for angina are:\n  * [coronary artery bypass surgery (CABG)](https://healthify.nz/health-a-z/c/coronary-artery-bypass-surgery) – where a section of blood vessel from another part of your body is used to re-route blood around a narrowed or blocked artery\n  * percutaneous coronary intervention (PCI) – widening of a narrowed section of artery by use of a stent (a tiny piece of tube). \n\n\nAn X-ray of the coronary arteries (coronary angiography) is used to decide whether CABG or PCI is appropriate.\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps), [nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps), [blood pressure apps](https://healthify.nz/apps/b/blood-pressure-apps), [diabetes apps](https://healthify.nz/apps/d/diabetes-apps) and [meditation and mindfulness apps](https://healthify.nz/apps/m/meditation-and-mindfulness-apps).\n####  How can I improve my heart health? (+ APPS) \n#### A healthy lifestyle to help prevent further heart damage\nAngina is a sign that your heart isn't healthy. Medicines and surgery can help with symptoms but they're not a cure for heart disease. The best way to help prevent further damage is to make healthy lifestyle changes.\nTo improve your heart health:\n  * cut down on saturated (animal) fats and salt\n  * eat more fruit, vegetables and wholegrain cereals\n  * don't smoke\n  * limit your alcohol intake\n  * have your blood pressure checked regularly\n  * build regular physical activity into your week\n  * maintain a healthy bodyweight\n  * develop ways to cope with stress. \n\n\nEven small changes can have a positive impact on your risk of heart attack and stroke. The more you change, the better for your health. \nLearn more about: \n  * [Stopping smoking](https://healthify.nz/hauora-wellbeing/s/smoking-topics)\n  * [Exercise and physical activity](https://healthify.nz/hauora-wellbeing/p/physical-activity)\n  * [Healthy and unhealthy fats](https://healthify.nz/hauora-wellbeing/f/fats-oils)\n  * [Cutting back on salt](https://healthify.nz/hauora-wellbeing/s/sodium-salt)\n  * [Benefits of drinking less alcohol](https://healthify.nz/hauora-wellbeing/a/alcohol-the-benefits-of-drinking-less)\n  * [Reaching a healthy weight](https://healthify.nz/hauora-wellbeing/w/weight-loss)\n  * [Managing stress](https://healthify.nz/health-a-z/s/stress)\n\n\n####   \nApps reviewed by Healthify\nYou may find it useful to look at some [quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps), [nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps), [blood pressure apps](https://healthify.nz/apps/b/blood-pressure-apps), [diabetes apps](https://healthify.nz/apps/d/diabetes-apps) and [meditation and mindfulness apps](https://healthify.nz/apps/m/meditation-and-mindfulness-apps).\n####  What is the outlook if I have angina? \nStable angina usually improves with medicines and healthy lifestyle changes. \nUnstable angina is a sign of more severe heart disease and may lead to a heart attack. What happens in the future will depend on things such as:\n  * how many of your arteries are affected by coronary artery disease\n  * how severe the narrowing is\n  * if you’ve had a heart attack before, and \n  * how well your heart is working to pump blood around your body.\n\n\nHaving coronary artery disease means you’re likely to have atherosclerosis in other arteries (eg, the arteries that supply your brain), so you’re at higher risk of having a stroke.\n####  What support is available if I have angina? \nSometimes it can be helpful to talk with someone who knows what it’s like to live with heart disease and angina. The [Heart Foundation(external link)](https://www.heartfoundation.org.nz/ \"Open external link\") has an [online directory of community-run support groups(external link)](https://www.heartfoundation.org.nz/your-heart/cardiac-rehab-and-heart-support-groups/heart-support-groups \"Open external link\") around the country that provide a way of connecting with others. \n####  Related topics on Healthify \n[Coronary artery disease](https://healthify.nz/health-a-z/c/coronary-artery-disease)  \n[Atherosclerosis](https://healthify.nz/health-a-z/a/atherosclerosis)  \n[Heart attack](https://healthify.nz/health-a-z/h/heart-attack)  \n[Stroke](https://healthify.nz/health-a-z/s/stroke)  \n[Heart risk assessment](https://healthify.nz/health-a-z/h/heart-risk-assessment)  \n[Healthy recipes for a healthy heart](https://healthify.nz/hauora-wellbeing/h/healthy-recipes-for-a-healthy-heart)\n####  More information \n[Angina(external link)](https://www.heartfoundation.org.nz/your-heart/heart-conditions/angina \"Open external link\") Heart Foundation, NZ  \n[Angina](https://healthify.nz/health-a-z/a/angina) American Heart Association, US  \n[Heart tests(external link)](https://www.heartfoundation.org.nz/your-heart/heart-tests \"Open external link\") Heart Foundation, NZ  \n  \n\n#### Brochures\n[Angina(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/what-is-angina-pamphlet.pdf?mtime=1667526708?1748392101&_gl=1*1xf549u*_gcl_aw*R0NMLjE3NDcwMDQxMjkuQ2owS0NRandsWUhCQmhEOUFSSXNBTFJ1MDlvS0J0ZjEwdl9hQ0lBSHNsME52V0cxb3ktRF9pa21SNGZRQWR1RWZOeWV2VHkzdVZTMUtWRWFBalhvRUFMd193Y0I.*_gcl_au*MTA0MTg3MTg2Ny4xNzQ2MDU2MjA1 \"Open external link\") Heart Foundation, NZ  \n[Angina action plan(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster.pdf?mtime=1612406584 \"Open external link\") Heart Foundation, NZ Also available in [te reo Māori(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-maori.pdf?mtime=1612407251?1655345341 \"Open external link\"), [Samoan(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-samoan.pdf?mtime=1612407379?1655345360 \"Open external link\"), [Tongan(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/non-stock-resources/angina-action-plan-poster-tongan.pdf \"Open external link\"), [Chinese (traditional)(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-chinese.pdf?mtime=1612406352?1655338442 \"Open external link\"), [Hindi(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-hindi.pdf?mtime=1612406942 \"Open external link\"), [Korean(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-korean.pdf?mtime=1612407146?1655345441 \"Open external link\")  \n[A guide to coronary angiography and angioplasty(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/coronary-angiography-and-angioplasty-2019.pdf?mtime=1667526706?1669351478 \"Open external link\") Heart Foundation, NZ, 2019  \n[I.C.E. – emergency details wallet card(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/ice-emergency-details-wallet-card.pdf?mtime=1701127482?1748388743&_gl=1*1a7vayx*_gcl_aw*R0NMLjE3NDcwMDQxMjkuQ2owS0NRandsWUhCQmhEOUFSSXNBTFJ1MDlvS0J0ZjEwdl9hQ0lBSHNsME52V0cxb3ktRF9pa21SNGZRQWR1RWZOeWV2VHkzdVZTMUtWRWFBalhvRUFMd193Y0I.*_gcl_au*MTA0MTg3MTg2Ny4xNzQ2MDU2MjA1 \"Open external link\") Heart Foundation, NZ  \n  \n\n#### Apps\n[Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps)  \n[Nutrition, Exercise and Weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps)  \n[Meditation and mindfulness apps](https://healthify.nz/apps/m/meditation-and-mindfulness-apps)  \n[Blood pressure apps](https://healthify.nz/apps/b/blood-pressure-apps)  \n[Diabetes apps](https://healthify.nz/apps/d/diabetes-apps)\n####   \nReferences\n  1. [Angina(external link)](http://www.nhs.uk/conditions/angina/ \"Open external link\") NHS, UK\n  2. [Stable angina(external link)](https://nzf.org.nz/nzf_1547 \"Open external link\") NZ Formulary\n  3. [Stable angina(external link)](https://medlineplus.gov/ency/article/000198.htm \"Open external link\") Medline Plus, US, 2023\n  4. [Unstable angina(external link)](https://medlineplus.gov/ency/article/000201.htm \"Open external link\") Medline Plus, US, 2023\n  5. [Management of stable angina pectoris(external link)](https://bpac.org.nz/2025/angina.aspx \"Open external link\") BPAC, NZ, 2025\n  6. [Beta blockers for cardiovascular conditions – one size does not fit all(external link)](https://bpac.org.nz/2024/docs/beta-blockers.pdf \"Open external link\") BPAC, NZ, 2024\n  7. [Tests for heart conditions(external link)](https://info.health.nz/conditions-treatments/medical-tests-and-procedures/tests-for-heart-problems \"Open external link\") Health New Zealand | Te Whatu Ora, NZ, 2025\n\n\n####  Information for healthcare providers \n[Management of stable angina pectoris(external link)](https://bpac.org.nz/2025/angina.aspx \"Open external link\") BPAC, NZ, 2025  \n[B-Quick – Management of stable angina pectoris(external link)](https://bpac.org.nz/b-quick/angina.aspx \"Open external link\") BPAC, NZ, 2025\n## Brochures\n![angina action plan brochure](https://healthify.nz/assets/angina-action-plan-brochure.png)\n[Angina action plan(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster.pdf?mtime=1612406584 \"Open external link\")\nHeart Foundation, NZ\n[English(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster.pdf?mtime=1612406584 \"Open external link\"), [te reo Māori(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-maori.pdf?mtime=1612407251?1655345341 \"Open external link\"), [Samoan(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-samoan.pdf?mtime=1612407379?1655345360 \"Open external link\"), [Tongan(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/non-stock-resources/angina-action-plan-poster-tongan.pdf \"Open external link\"), [Chinese (traditional)(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-chinese.pdf?mtime=1612406352?1655338442 \"Open external link\"), [Hindi(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-hindi.pdf?mtime=1612406942 \"Open external link\"), [Korean(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/angina-action-plan-poster-korean.pdf?mtime=1612407146?1655345441 \"Open external link\")\n![a guide to coronary angiography and angioplasty](https://healthify.nz/assets/a-guide-to-coronary-angiography-and-angioplasty.jpg)\n[A guide to coronary angiography & angioplasy(external link)](https://assets.heartfoundation.org.nz/documents/shop/heart-healthcare/coronary-angiography-and-angioplasty-2019.pdf?mtime=1667526706?1669351478 \"Open external link\")\nHeart Foundation, NZ, 2015\n![ice emergency details](https://healthify.nz/assets/ice-emergency-details.jpg)\n[I.C.E. – emergency details(external link)](https://www.heartfoundation.org.nz/resources/ice-emergency-details-wallet-card \"Open external link\")\nHeart Foundation, NZ\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/a/angina)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/a/angina)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Grace Lee, FRNZCGP and Clinical Educator\nLast reviewed: 15 Aug 2025\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/angina \n![image](https://healthify.nz/assets/Uploads/image.png)\n[![Healthify He Puna Waiora logo in orange](https://healthify.nz/assets/Affiliate-Images/Healthify-Logo-Orange__ResizedImageWzI1MSwxMjRd.png) ](https://healthify.nz/)\n[![](https://healthify.nz/assets/Affiliate-Images/HNCT-logo-for-footer__ResizedImageWzI1MCwyMDBd.png) ](https://www.hnct.nz)\n[Home](https://healthify.nz/)\n[Health A–Z](https://healthify.nz/health-a-z)\n[Medicines A–Z](https://healthify.nz/medicines-a-z)\n[Hauora Wellbeing](https://healthify.nz/hauora-wellbeing)\n[Care & Support](https://healthify.nz/care-and-support)\n[App Library](https://healthify.nz/app-library)\n[Tools](https://healthify.nz/tools)\n[News](https://healthify.nz/news)\n[Newsletters](https://healthify.nz/newsletters-sign-up \"Sign up to our newsletters\")\n[Leave a review](https://socialjuice.io/p/healthify \"Link to provide feedback about our site\")\n[About Healthify](https://healthify.nz/about-healthify)\n[How to use Healthify](https://healthify.nz/about-healthify/how-to-use-healthify \"How to use the Healthify He Puna Waiora website\")\n[About Health Navigator Charitable Trust](https://www.hnct.nz)\n[Volunteer / Work with us](https://healthify.nz/about-healthify/volunteer)\n[Accessibility](https://healthify.nz/about-healthify/our-policies#accessibility)\n[Privacy & Cookies Policy](https://healthify.nz/about-healthify/our-policies#privacy-cookies)\n[Disclaimer](https://healthify.nz/about-healthify/our-policies#disclaimer)\n[Contact](https://healthify.nz/contact)\n[Donate](https://healthify.nz/donate)\n[Use Healthify without data](https://portal.zero.govt.nz/28f2e4000bd5a26366ede8abb548f277 \"Link to Zero Data \")\n[For Healthcare Providers](https://healthify.nz/healthcare-providers)\n[Regional HealthPathways NZ](https://healthify.nz/healthcare-providers/r/regional-healthpathways-links-hcps)\n[Journey to Wellbeing | Huarahi Ora](https://www.journeytowellbeing.nz/)\n[Translations](https://healthify.nz/translations)\n[Medicine Brand Changes, Factsheets & Videos](https://healthify.nz/medicines-a-z/m/medicine-brand-changes-factsheets-and-videos)\n[Te Kete Haerenga](https://healthify.nz/tools/t/te-kete-haerenga-wellness-toolkit)\n[![RNZCGP logo showing endorsement of Healthify](https://healthify.nz/assets/Affiliate-Images/RNZCGP-Endorsed-GUIDANCE-logo-Exp-31-Mar-2027__ResizedImageWzE3MCwxNzBd.png) ](https://healthify.nz/about-healthify/why-you-can-trust-us \"rnzcgp-endorsement\")\nScroll to Top\n[ ![shielded](https://healthify.nz/_resources/themes/catalyst-starter/dist/img/shielded_site_logo.png?m=1736474156) ](https://healthify.nz/health-a-z/a/angina)\n© 2025 Health Navigator Charitable Trust CC36318. All rights reserved. \n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-03T05:57:09.375892Z",
    "letter": "a",
    "slug": "angina"
  }
}