{
  "url": "https://healthify.nz/health-a-z/a/amenorrhoea/",
  "title": "Amenorrhoea",
  "markdown": "[Skip to main content](https://healthify.nz/health-a-z/m/menstruation#main)\n  * [ Healthify on Instagram ](https://www.instagram.com/healthify_hepunawaiora/ \"Follow us on Instagram\")\n  * [ Healthify on Facebook ](https://facebook.com/healthifyhepunawaiora \"Follow us on Facebook\")\n\n\n![logo black](https://healthify.nz/assets/Uploads/logo-black.png)\n[ ![logo orange v2](https://healthify.nz/assets/Uploads/logo-orange-v2.png) ](https://healthify.nz)\nSearch\nSearch this website\n  * [Health A–Z](https://healthify.nz/health-a-z) Show submenu for Health A–Z\n  *     * [A](https://healthify.nz/health-a-z/a)\n    * [B](https://healthify.nz/health-a-z/b)\n    * [C](https://healthify.nz/health-a-z/c)\n    * [D](https://healthify.nz/health-a-z/d)\n    * [E](https://healthify.nz/health-a-z/e)\n    * [F](https://healthify.nz/health-a-z/f)\n    * [G](https://healthify.nz/health-a-z/g)\n    * [H](https://healthify.nz/health-a-z/h)\n    * [I](https://healthify.nz/health-a-z/i)\n    * [J](https://healthify.nz/health-a-z/j)\n    * [K](https://healthify.nz/health-a-z/k)\n    * [L](https://healthify.nz/health-a-z/l)\n    * [M](https://healthify.nz/health-a-z/m)\n    * [N](https://healthify.nz/health-a-z/n)\n    * [O](https://healthify.nz/health-a-z/o)\n    * [P](https://healthify.nz/health-a-z/p)\n    * [Q](https://healthify.nz/health-a-z/q)\n    * [R](https://healthify.nz/health-a-z/r)\n    * [S](https://healthify.nz/health-a-z/s)\n    * [T](https://healthify.nz/health-a-z/t)\n    * [U](https://healthify.nz/health-a-z/u)\n    * [V](https://healthify.nz/health-a-z/v)\n    * [W](https://healthify.nz/health-a-z/w)\n    * [X](https://healthify.nz/health-a-z/x)\n    * [Z](https://healthify.nz/health-a-z/z)\n  * [Medicines A–Z](https://healthify.nz/medicines-a-z) Show submenu for Medicines A–Z\n  *     * [A](https://healthify.nz/medicines-a-z/a)\n    * [B](https://healthify.nz/medicines-a-z/b)\n    * [C](https://healthify.nz/medicines-a-z/c)\n    * [D](https://healthify.nz/medicines-a-z/d)\n    * [E](https://healthify.nz/medicines-a-z/e)\n    * [F](https://healthify.nz/medicines-a-z/f)\n    * [G](https://healthify.nz/medicines-a-z/g)\n    * [H](https://healthify.nz/medicines-a-z/h)\n    * [I](https://healthify.nz/medicines-a-z/i)\n    * [J](https://healthify.nz/medicines-a-z/j)\n    * [K](https://healthify.nz/medicines-a-z/k)\n    * [L](https://healthify.nz/medicines-a-z/l)\n    * [M](https://healthify.nz/medicines-a-z/m)\n    * [N](https://healthify.nz/medicines-a-z/n)\n    * [O](https://healthify.nz/medicines-a-z/o)\n    * [P](https://healthify.nz/medicines-a-z/p)\n    * [Q](https://healthify.nz/medicines-a-z/q)\n    * [R](https://healthify.nz/medicines-a-z/r)\n    * [S](https://healthify.nz/medicines-a-z/s)\n    * [T](https://healthify.nz/medicines-a-z/t)\n    * [U](https://healthify.nz/medicines-a-z/u)\n    * [V](https://healthify.nz/medicines-a-z/v)\n    * [W](https://healthify.nz/medicines-a-z/w)\n    * [X](https://healthify.nz/medicines-a-z/x)\n    * [Y](https://healthify.nz/medicines-a-z/y)\n    * [Z](https://healthify.nz/medicines-a-z/z)\n  * [Hauora Wellbeing](https://healthify.nz/hauora-wellbeing) Show submenu for Hauora Wellbeing\n  *     * [A](https://healthify.nz/hauora-wellbeing/a)\n    * [B](https://healthify.nz/hauora-wellbeing/b)\n    * [C](https://healthify.nz/hauora-wellbeing/c)\n    * [D](https://healthify.nz/hauora-wellbeing/d)\n    * [E](https://healthify.nz/hauora-wellbeing/e)\n    * [F](https://healthify.nz/hauora-wellbeing/f)\n    * [G](https://healthify.nz/hauora-wellbeing/g)\n    * [H](https://healthify.nz/hauora-wellbeing/h)\n    * [I](https://healthify.nz/hauora-wellbeing/i)\n    * [K](https://healthify.nz/hauora-wellbeing/k)\n    * [L](https://healthify.nz/hauora-wellbeing/l)\n    * [M](https://healthify.nz/hauora-wellbeing/m)\n    * [N](https://healthify.nz/hauora-wellbeing/n)\n    * [O](https://healthify.nz/hauora-wellbeing/o)\n    * [P](https://healthify.nz/hauora-wellbeing/p)\n    * [R](https://healthify.nz/hauora-wellbeing/r)\n    * [S](https://healthify.nz/hauora-wellbeing/s)\n    * [T](https://healthify.nz/hauora-wellbeing/t)\n    * [V](https://healthify.nz/hauora-wellbeing/v)\n    * [W](https://healthify.nz/hauora-wellbeing/w)\n    * [Y](https://healthify.nz/hauora-wellbeing/y)\n    * [Z](https://healthify.nz/hauora-wellbeing/z)\n  * [Care & Support](https://healthify.nz/care-and-support)\n  * [App Library](https://healthify.nz/app-library)\n  * [Tools](https://healthify.nz/tools) Show submenu for Tools\n  *     * [A](https://healthify.nz/tools/a)\n    * [B](https://healthify.nz/tools/b)\n    * [C](https://healthify.nz/tools/c)\n    * [D](https://healthify.nz/tools/d)\n    * [E](https://healthify.nz/tools/e)\n    * [F](https://healthify.nz/tools/f)\n    * [G](https://healthify.nz/tools/g)\n    * [H](https://healthify.nz/tools/h)\n    * [I](https://healthify.nz/tools/i)\n    * [J](https://healthify.nz/tools/j)\n    * [K](https://healthify.nz/tools/k)\n    * [L](https://healthify.nz/tools/l)\n    * [M](https://healthify.nz/tools/m)\n    * [N](https://healthify.nz/tools/n)\n    * [O](https://healthify.nz/tools/o)\n    * [P](https://healthify.nz/tools/p)\n    * [R](https://healthify.nz/tools/r)\n    * [S](https://healthify.nz/tools/s)\n    * [T](https://healthify.nz/tools/t)\n    * [W](https://healthify.nz/tools/w)\n  * [Donate](https://healthify.nz/donate)\n\n\nSearch\nSearch this website\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [M](https://healthify.nz/health-a-z/m)\n\n\n# Menstruation\n## Periods\n### Key points about menstruation\n  * Menstruation (also called your menstrual period, period or menses) is normal vaginal bleeding that occurs for about 5 days every month as part of your monthly menstrual cycle.\n  * Periods usually start during puberty between the ages of 9 and 14 and continue until menopause.\n  * Every month, if no pregnancy occurs, your uterus (womb) sheds its lining and some of this tissue and blood passes out of your body through your vagina. This is your period. \n  * As well as vaginal bleeding, you may experience pain and changes in mood around the time of your period.\n  * There are things you can do to make your menstrual cycle more manageable.\n\n\n![Smiling young woman at a social gathering with friends](https://healthify.nz/assets/Healthy-Living/Women/Smiling-young-woman-at-a-social-gathering-with-friends-Canva.jpg)\nQR Code Print\nOpen all Close all\n####  What are periods? (+ VIDEO) \nYour body prepares for a possible pregnancy every month after you reach puberty. If you don't get pregnant, the lining of your uterus (womb) sheds and passes out of your vagina. Your period is the time when the blood, cells from the lining of your uterus and mucus are coming out.\n####    \nWhat is the menstrual cycle?\nYour menstrual cycle is the changes in hormones, and changes in your uterus and ovaries, that make pregnancy possible. Your cycle goes from the first day of your period (the first day you wake with bleeding) to the first day of your next period.\n####    \nVideo: Menstruation – what to expect   \n  \n\n(AMAZE, US, 2018)\n####  What should I expect when I get my period? \nEverybody's menstrual cycle is a bit different. The range of what's normal is wide, but there are some common features.\n####    \nStarting age (menarche)\n  * Periods generally start between 9 and 14 years of age. This is often about 2 years after your breasts first start to develop and about a year after you start to grow pubic hair.\n  * You often start your period at a similar age to others in your family – if you can, find out when your mother, sister or grandmother started.\n\n\n####    \nMenstrual cycle pattern\n  * Periods are often not regular when they first start, but generally settle into a regular pattern after about 3 years.\n  * Some people never have a regular cycle.\n  * Periods occur anything from every 21 to every 35 days.\n  * The commonly quoted cycle of 28 days only happens for about 1 woman in 10.\n  * The first day you wake up with bleeding is counted as day 1 of your menstrual cycle. \n  * Your period comes 14 days after you ovulate (release an egg from one of your ovaries).\n  * If you have a 28 day cycle, you ovulate around day 14 and have a period 14 days later (if you're not [pregnant](https://healthify.nz/hauora-wellbeing/p/pregnancy \"Pregnancy\")).\n  * If your cycle is 35 days long, then you are likely to ovulate around day 21. If your cycle is 21 days long, then you probably ovulate around day 7, close to the end of your period.\n  * If you want to prevent a pregnancy, you need to use [contraception](https://healthify.nz/health-a-z/c/contraception \"Contraception\") throughout your cycle. This is because the timing of ovulation can be unpredictable which means you can become pregnant at unexpected times.  \n  \n  \n\n\n\n![Graphic showing the stages of the menstrual cycle](https://healthify.nz/assets/Health-A-Z/Womens-health/Stages-of-menstrual-cycle-Depositphotos-800x800__ResizedImageWzYwMCw2MDBd.png)\n  \n_Image credit: Depositphotos_\n####    \nBlood loss\n  * During each period you lose 30 to 40 mL of blood and fluid (about 2 to 3 tablespoons), but it can look like more. \n  * Bleeding can last anywhere from 3 to 7 days – 5 days is the average.\n  * Bleeding is generally heaviest for the first day or two then lighter over the next day or two and your period may finish with a day or so of spotting (very light bleeding)\n  * The blood and fluid are often red when your flow is heaviest, and brown or black when flow is light, which can be at the beginning or particularly the end of your period.\n  * Some people do bleed more heavily, read more about [heavy periods for young people](https://healthify.nz/health-a-z/h/heavy-periods-young-people) and in [adults](https://healthify.nz/health-a-z/p/periods-heavy-bleeding).\n\n\n####    \nTissue loss\nThe blood you lose doesn't usually clot, but small amounts of tissue shedding from the lining of your uterus can look a bit like clots and this is normal. Clots are dark red and are generally passed when your bleeding is heavy. Tissue from your uterus is lighter coloured. Another way to tell the difference is if you squeeze them between bits of toilet paper, clots will break up and bits of tissue won't. \n####    \nOther symptoms\nPainful periods are common, especially for younger women. This often feels like cramping in your lower abdomen (tummy) or pelvis (the area between your hip bones). For most women the pain is mild.\nYou may also have 1 or more of the following:\n  * abdominal bloating\n  * lower back pain\n  * sore breasts\n  * food cravings\n  * mood swings and irritability\n  * [headache](https://healthify.nz/health-a-z/h/headache \"Headache\") and [fatigue](https://healthify.nz/health-a-z/f/fatigue \"Tiredness and fatigue\").\n\n\nRead about [premenstrual syndrome](https://healthify.nz/health-a-z/p/premenstrual-syndrome-pms) which can occur in the days leading up to your period.\n####    \nApproaching menopause\n  * Menopause is the time when your body stops preparing for a pregnancy each month and your periods stop.\n  * As you approach menopause (a time called perimenopause), your periods may become more irregular again.\n  * Periods tend to finish between the ages of 45 and 55. However they can stop earlier, for no apparent reason, or due to some medicines or surgery. If your periods stop between the ages of 40 and 45 it's called early menopause and if they stop before the age of 40 it's called premature menopause. \n\n\nRead more about [menopause](https://healthify.nz/hauora-wellbeing/m/menopause) and [early menopause](https://healthify.nz/hauora-wellbeing/m/menopause-early).\n####  What if I have a period problem? \nSee your healthcare provider or visit a [Sexual Wellbeing Aotearoa clinic(external link)](https://sexualwellbeing.org.nz/find-a-clinic/ \"Open external link\") if you have any of the following period problems.\n####    \nPeriods starting before 8 years of age\nIf your child shows signs of puberty or gets a period before the age of 8 make an appointment to see your GP or nurse practitioner. Early puberty can have serious health and social effects.\n####    \nNo periods\nIf you have a uterus, it's normal not to have periods:\n  * before you reach puberty\n  * when you're pregnant\n  * if you're breastfeeding (however, breastfeeding doesn't necessarily prevent pregnancy)\n  * if you've reached menopause\n  * if you take the combined oral contraceptive hormone pills every day (missing the 7 non-hormonal pills in the packet and going straight on to the next set of hormone pills from a new packet).\n\n\nHowever, if you're not having periods and you don't fit into any of the groups listed above, it's known as amenorrhoea. There are 2 categories of amenorrhoea:\n  * primary amenorrhoea –\n  * secondary amenorrhoea\n\n\nAmenorrhoea may be caused by:\n  * strenuous exercise\n  * [stress](https://healthify.nz/health-a-z/s/stress \"Stress\")\n  * some medicines, including the oral contraceptive pill (it can take 3 to 6 months to start having normal periods again after stopping the pill)\n  * chronic illness\n  * problems with your ovaries\n  * hormonal imbalances such as [polycystic ovarian syndrome (PCOS)](https://healthify.nz/health-a-z/p/polycystic-ovary-syndrome \"Polycystic Ovary Syndrome\"), or problems with your thyroid gland, hypothalamus (the part of your brain that helps regulate your menstrual cycle) or pituitary gland\n  * anatomical problems with your uterus, cervix or vagina\n  * the absence of puberty\n  * [depression](https://healthify.nz/health-a-z/d/depression-overview \"Depression\") and some other forms of mental illness\n  * low body weight, eg, due to an eating disorder..\n\n\nIf your lack of periods (amenorrhoea) is because you're not ovulating (releasing an egg from one of your ovaries each menstrual cycle), you may find it difficult to get pregnant. You may also be at risk of [osteoporosis](https://healthify.nz/health-a-z/o/osteoporosis \"Osteoporosis\") (weak bones).   \n  \nSee your healthcare provider if you're not having periods (except for the normal reasons listed above). There are different treatment options available, depending on the cause of your amenorrhea. \n####    \nBleeding between periods\nIt’s not normal to bleed between your periods or after sexual intercourse, so see a healthcare provider if you experience either of these. Read about [abnormal vaginal bleeding](https://healthify.nz/health-a-z/v/vaginal-bleeding-abnormal).\n####    \nLate or irregular periods\nA late period is when you have more than 35 days between periods, and an early period is one that comes less than 21 days after the start of your last period.\nPregnancy is one reason why your period might be late. If you think you might be pregnant, buy a pregnancy test from your pharmacy or see your healthcare provider.\nThere are other lifestyle and medical reasons why your period might be late or irregular. Many of these reasons are the same as those that might cause you to have no periods (eg, stress, exercising too much, eating disorders or hormonal conditions such as [PCOS](https://healthify.nz/health-a-z/p/polycystic-ovary-syndrome)), but other reasons include shift work or travelling between different time zones. Stress is the most common cause of irregular periods.\nIf you’re between the ages of 40 and 55, late or irregular periods might be a sign that you’re starting [menopause](https://healthify.nz/hauora-wellbeing/m/menopause).\n####    \nHeavy periods\nMenorrhagia is the term given to heavy periods. It affects about 20 to 25% of women. With menorrhagia you may have longer periods (lasting longer than 7 days), excessive bleeding with flooding or clots or both.\n  * If you have menorrhagia you may lose 80 mL or more of blood per period, compared to the 30 to 40 mL lost by most women.\n  * If you're needing to change your tampon or sanitary pad more often than every hour, flooding (soaking through your pads/clothing) or becoming [anaemic](https://healthify.nz/health-a-z/a/anaemia \"Anaemia\"), you probably have menorrhagia.\n\n\nMenorrhagia is one of the main reasons for having a hysterectomy (surgical removal of your uterus), although there are other less extreme treatments to try first such as insertion of a Mirena (a type of intrauterine device also used for contraception). Read more about [heavy periods](https://healthify.nz/health-a-z/p/periods-heavy-bleeding \"Periods – heavy bleeding\") and [heavy periods for young people](https://healthify.nz/health-a-z/h/heavy-periods-young-people). If you think your periods are heavy, try filling out the [Healthify heavy period diary [JPG, 111 KB]](https://healthify.nz/assets/Health-A-Z/Womens-health/Heavy-period-diary-HN-image.jpg) and take it along to an appointment with a healthcare provider. \n####    \nPainful periods\nSome people have [painful periods](https://healthify.nz/health-a-z/d/dysmenorrhoea \"Dysmenorrhoea\") (dysmenorrhoea). This may be caused by your period or it may be a sign of an underlying condition, such as [endometriosis](https://healthify.nz/health-a-z/e/endometriosis \"Endometriosis\"). If your periods are very painful, talk to a healthcare provider.\n####    \nBleeding after menopause\nIf it’s been a year since your last period then you start to bleed again, see a healthcare provider. Read more about [post-menopausal bleeding](https://healthify.nz/health-a-z/p/post-menopausal-bleeding).  \n  \n\n####  What should I use to absorb the blood when I have a period? \nThere are a range of options for absorbing the blood flow during your period. \n  * **Pads** are made of absorbent material and stick to your underwear to soak up blood. They come in many different shapes and absorbencies (amount of blood they can soak up) and you throw them away after use.\n  * **Reusable pads** are cloth pads that you can wash and reuse. They’re usually made of absorbent material like cotton or bamboo. It’s recommended that after using the pad, you rinse it, soak it overnight and then wash it before using it again.\n  * **Tampons** are small tubes of absorbent material with a string at one end. You put them into your vagina to soak up your blood, and pull them out using the string. You should change a tampon as needed but at least every 4 to 8 hours. It’s best not to use them overnight. You can choose from a range of sizes, depending on how heavy your period is. Applicator tampons come with a cardboard tube to help you get your tampon into the right place. Read more about [tampons and how to use them safely](https://healthify.nz/hauora-wellbeing/t/tampons).\n  * **Menstrual sponges** (period sponges or soft tampons) are natural or artificial sea sponges used inside your vagina. They are like a reusable tampon but without a string. They need to be changed every 4 to 6 hours and washed thoroughly after use.\n  * **Menstrual cups** are soft rubber or silicon cups that are put into your vagina to catch the blood flow. You empty the cup every 8 to 12 hours, rinse it under water, and put it back in.\n  * **Period underwear** looks and feels like your usual underwear but is very absorbent. It can be used instead of pads or tampons when you have a light flow, or as a back-up to a tampon when you have a heavy blood flow. \n\n\nRead more about [period products(external link)](https://sexualwellbeing.org.nz/adv/periods/period-products/ \"Open external link\").\n####  What self-care can I do during my period? (+ APPS) \nThere are things you can do to help you manage your period.\n  * Keep a record of the first day of your period, eg, on a calendar or in a period app. After a few months you should be able to work out how long your cycle is. This can help you predict when you’ll get your next period, or know if your period is early or late.\n  * You may want to track your periods like this for a variety of reasons, including: \n    * knowing when to expect your period so you can be prepared\n    * understanding your body's reactions to different phases of your cycle\n    * planning a pregnancy\n    * having informed conversations with healthcare providers (who often ask when your last period was). \n  * Read about [period tracking apps](https://healthify.nz/apps/p/period-menstrual-cycle-tracking-apps).\n  * Read about [what you can do to look after yourself if you have premenstrual syndrome](https://healthify.nz/health-a-z/p/premenstrual-syndrome-pms#self-care-with-pms). \n  * During your period you can try the following things to help manage any symptoms: \n    * gentle exercise\n    * relaxation techniques\n    * making time for enough sleep\n    * moving decisions or tasks that can wait to another time in your cycle\n    * using a wheat pack or hot water bottle on your tummy or breasts\n    * using pain relief medicines such as paracetamol or ibuprofen\n    * reducing smoking and alcohol use.\n\n\n####    \nDo I have to have a period?\nIt’s not necessary for your health to have a period every month. Some hormonal medicines which change your menstrual cycle can stop your periods. These medicines have other effects on your body you need to think about, so talk to your healthcare provider if you’re wondering about this.\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [period tracking apps](https://healthify.nz/apps/p/period-menstrual-cycle-tracking-apps), and [meditation and mindfulness apps](https://healthify.nz/apps/m/meditation-and-mindfulness-apps). \n####  Related topics on Healthify \n[Painful periods](https://healthify.nz/health-a-z/d/dysmenorrhoea)  \n[Premenstrual syndrome (PMS)](https://healthify.nz/health-a-z/p/premenstrual-syndrome-pms \"Premenstrual syndrome \\(PMS\\)\")  \n[Heavy periods](https://healthify.nz/health-a-z/p/periods-heavy-bleeding \"Heavy periods\")  \n[Heavy periods for young people](https://healthify.nz/health-a-z/h/heavy-periods-young-people)  \n[Endometriosis | Kōpū whakatupu pūtautau](https://healthify.nz/health-a-z/e/endometriosis \"Endometriosis | Kōpū whakatupu pūtautau\")  \n[Periods – how to talk to kids](https://healthify.nz/hauora-wellbeing/p/periods-how-to-talk-to-kids)  \n[Abnormal vaginal bleeding](https://healthify.nz/health-a-z/v/vaginal-bleeding-abnormal)  \n[Tampons](https://healthify.nz/hauora-wellbeing/t/tampons)\n####  More information \n[Periods(external link)](https://sexualwellbeing.org.nz/adv/periods/ \"Open external link\") Sexual Wellbeing Aotearoa, NZ  \n[Managing your period(external link)](https://sexualwellbeing.org.nz/adv/periods/managing-your-period/ \"Open external link\") Sexual Wellbeing Aotearoa, NZ  \n[How not to be afraid the first time you use a tampon(external link)](https://www.wikihow.com/Not-Be-Afraid-the-First-Time-You-Use-a-Tampon \"Open external link\") WikiHow\n####    \nBrochures\n[All about growing up(external link)](https://sexualwellbeing.org.nz/media/1fvpx4lj/swa_all-about-growing-up_lowres.pdf \"Open external link\") Sexual Wellbeing Aotearoa, NZ  \n[Just about … periods(external link)](https://sexualwellbeing.org.nz/media/uxllfxdy/swa_just-about-period_a4.pdf \"Open external link\") Sexual Wellbeing Aotearoa, NZ  \n[Periods(external link)](https://www.jeanhailes.org.au/uploads/05-Fact-sheets-English-TGD/periods-factsheet_TGD.pdf \"Open external link\") Jean Hailes for Women's Health, Australia  \n[Heavy periods fact sheet(external link)](https://www.jeanhailes.org.au/uploads/05-Fact-sheets-English-TGD/heavy-period-factsheet_TGD.pdf \"Open external link\") Jean Hailes for Women’s Health, Australia  \n[Periods and heavy bleeding – easy read fact sheet(external link)](https://www.jeanhailes.org.au/uploads/04-Easy-Read-TGD/Jean-Hailes_Periods-and-heavy-bleeding_Easy-Read_TGD.pdf \"Open external link\") Jean Hailes for Women’s Health, Australia  \n[It's all good!(external link)](https://web-assets.education.govt.nz/s3fs-public/2023-12/Ikura-Whanau-Resources-1-5-English.pdf?VersionId=mIQ7auDxmQIw0Vxi625Fa3MqMn0m7eoG \"Open external link\") Te Tāhuhu o te Mātauranga Ministry of Education, NZ, 2023 Resources about periods and talking to young people about them\n####    \nApps\n[Period tracking apps](https://healthify.nz/apps/p/period-menstrual-cycle-tracking-apps)  \n[Pain management apps](https://healthify.nz/apps/p/pain-management-apps)  \n[Women's health apps](https://healthify.nz/apps/w/womens-health-apps)\n####    \nReferences\n  1. [Heavy menstrual bleeding(external link)](https://ranzcog.edu.au/wp-content/uploads/2022/06/Heavy-menstrual-bleeding.pdf \"Open external link\") Royal Australian and New Zealand College of Obstetricians and Gynaecologists, 2018\n  2. [Heavy menstrual bleeding clinical care standard(external link)](https://www.safetyandquality.gov.au/sites/default/files/2024-06/heavy-menstrual-bleeding-clinical-care-standard-2024.pdf \"Open external link\") Australian Commission on Safety and Quality in Health Care, 2024\n  3. [Physiology of the normal menstrual cycle(external link)](https://www.uptodate.com/contents/physiology-of-the-normal-menstrual-cycle?search=Physiology%20of%20the%20normal%20menstrual%20cycle&source=search_result&selectedTitle=1~150&usage_type=default&display_rank=1 \"Open external link\") UpToDate, 2019\n  4. [Clinical manifestations and diagnosis of menopause(external link)](https://www.uptodate.com/contents/clinical-manifestations-and-diagnosis-of-menopause?search=menopause&source=search_result&selectedTitle=1~150&usage_type=default&display_rank=1 \"Open external link\") UpToDate, 2020\n  5. [Late and irregular periods(external link)](https://sexualwellbeing.org.nz/adv/periods/late-and-irregular-periods/#Amenorrhea \"Open external link\") Sexual Wellbeing Aotearoa, NZ\n  6. [Managing your period(external link)](https://sexualwellbeing.org.nz/adv/periods/managing-your-period/ \"Open external link\") Sexual Wellbeing Aotearoa, NZ\n  7. [Continuous pill taking(external link)](https://sexualwellbeing.org.nz/adv/contraception/continuous-pill-taking/ \"Open external link\") Sexual Wellbeing Aotearoa, NZ\n\n\n####  Information for healthcare providers \n#### Clinical resources\n[Investigating and managing abnormal vaginal bleeding – an overview(external link)](https://bpac.org.nz/2019/bleeding.aspx#patterns \"Open external link\") BPAC, NZ, 2019  \n[Heavy menstrual bleeding(external link)](https://ranzcog.edu.au/wp-content/uploads/2022/06/Heavy-menstrual-bleeding.pdf \"Open external link\") Royal Australian and New Zealand College of Obstetricians and Gynaecologists  \n[Heavy menstrual bleeding clinical care standard(external link)](https://www.safetyandquality.gov.au/sites/default/files/2024-06/heavy-menstrual-bleeding-clinical-care-standard-2024.pdf \"Open external link\") Australian Commission on Safety and Quality in Health Care, 2024  \n[Physiology of the normal menstrual cycle(external link)](https://www.uptodate.com/contents/physiology-of-the-normal-menstrual-cycle?search=Physiology%20of%20the%20normal%20menstrual%20cycle&source=search_result&selectedTitle=1~150&usage_type=default&display_rank=1 \"Open external link\") UpToDate, 2019  \n[Clinical manifestations and diagnosis of menopause(external link)](https://www.uptodate.com/contents/clinical-manifestations-and-diagnosis-of-menopause?search=menopause&source=search_result&selectedTitle=1~150&usage_type=default&display_rank=1 \"Open external link\") UpToDate, 2020\n####    \nContinuing professional development \n#### Video: PHARMAC seminar: Women's health 2019, 1a of 6, amenorrhea Amenorrhea – pointers to quick evaluation in primary care (parts 1 and 2) – Stella Milsom (25 minutes + 17 minutes = 42 minutes)\n(Pharmac seminars, NZ, 2019)\n####    \nVideo: PHARMAC seminar: Women's health 2019, 1b of 6, amenorrhea\n(Pharmac seminars, NZ, 2019)\n####    \nVideo: PHARMAC seminar: Women's health 2019, 2 of 6, hypothalamic amenorrhea – Megan Ogilvie (32 minutes)\n(PHARMAC seminars, NZ, 2019)\n## Brochures\n![](https://healthify.nz/assets/Brochures/Periods-Jean-Hailes-Australia__ResizedImageWzE2MCwyMjdd.jpg)\n[   \nPeriods](https://www.jeanhailes.org.au/uploads/05-Fact-sheets-English-TGD/periods-factsheet_TGD.pdf) Jean Hailes for Women's Health, Australia\n![](https://healthify.nz/assets/Brochures/Just-about-periods-Sexual-Wellbeing-Aotearoa-__ResizedImageWzIyNiwxNjBd.jpg)\n[   \nJust about periods](https://sexualwellbeing.org.nz/media/uxllfxdy/swa_just-about-period_a4.pdf) Sexual Wellbeing Aotearoa, NZ\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/m/menstruation)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/m/menstruation)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Emma Dunning, Clinical Editor and Advisor\nLast reviewed: 11 Mar 2025\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/m/menstruation \n![image](https://healthify.nz/assets/Uploads/image.png)\n[![Healthify He Puna Waiora logo in orange](https://healthify.nz/assets/Affiliate-Images/Healthify-Logo-Orange__ResizedImageWzI1MSwxMjRd.png) ](https://healthify.nz/)\n[![](https://healthify.nz/assets/Affiliate-Images/HNCT-logo-for-footer__ResizedImageWzI1MCwyMDBd.png) ](https://www.hnct.nz)\n[Home](https://healthify.nz/)\n[Health A–Z](https://healthify.nz/health-a-z)\n[Medicines A–Z](https://healthify.nz/medicines-a-z)\n[Hauora Wellbeing](https://healthify.nz/hauora-wellbeing)\n[Care & Support](https://healthify.nz/care-and-support)\n[App Library](https://healthify.nz/app-library)\n[Tools](https://healthify.nz/tools)\n[News](https://healthify.nz/news)\n[Newsletters](https://healthify.nz/newsletters-sign-up \"Sign up to our newsletters\")\n[Leave a review](https://socialjuice.io/p/healthify \"Link to provide feedback about our site\")\n[About Healthify](https://healthify.nz/about-healthify)\n[How to use Healthify](https://healthify.nz/about-healthify/how-to-use-healthify \"How to use the Healthify He Puna Waiora website\")\n[About Health Navigator Charitable Trust](https://www.hnct.nz)\n[Volunteer / Work with us](https://healthify.nz/about-healthify/volunteer)\n[Accessibility](https://healthify.nz/about-healthify/our-policies#accessibility)\n[Privacy & Cookies Policy](https://healthify.nz/about-healthify/our-policies#privacy-cookies)\n[Disclaimer](https://healthify.nz/about-healthify/our-policies#disclaimer)\n[Contact](https://healthify.nz/contact)\n[Donate](https://healthify.nz/donate)\n[Use Healthify without data](https://portal.zero.govt.nz/28f2e4000bd5a26366ede8abb548f277 \"Link to Zero Data \")\n[For Healthcare Providers](https://healthify.nz/healthcare-providers)\n[Regional HealthPathways NZ](https://healthify.nz/healthcare-providers/r/regional-healthpathways-links-hcps)\n[Journey to Wellbeing | Huarahi Ora](https://www.journeytowellbeing.nz/)\n[Translations](https://healthify.nz/translations)\n[Medicine Brand Changes, Factsheets & Videos](https://healthify.nz/medicines-a-z/m/medicine-brand-changes-factsheets-and-videos)\n[Te Kete Haerenga](https://healthify.nz/tools/t/te-kete-haerenga-wellness-toolkit)\n[![RNZCGP logo showing endorsement of Healthify](https://healthify.nz/assets/Affiliate-Images/RNZCGP-Endorsed-GUIDANCE-logo-Exp-31-Mar-2027__ResizedImageWzE3MCwxNzBd.png) ](https://healthify.nz/about-healthify/why-you-can-trust-us \"rnzcgp-endorsement\")\nScroll to Top\n[ ![shielded](https://healthify.nz/_resources/themes/catalyst-starter/dist/img/shielded_site_logo.png?m=1736474156) ](https://healthify.nz/health-a-z/m/menstruation)\n© 2025 Health Navigator Charitable Trust CC36318. All rights reserved. \n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-03T05:57:06.760777Z",
    "letter": "a",
    "slug": "amenorrhoea"
  }
}