{
  "url": "https://healthify.nz/health-a-z/a/asthma-adults/",
  "title": "Asthma Adults",
  "markdown": "# Asthma in adults\n### Key points about asthma in adults\n  * Asthma (mate huango) is a common lung condition that affects the breathing tubes (airways) that carry air in and out of your lungs.\n  * Asthma causes wheeze, a tight chest and cough, and can make it difficult to breathe.\n  * Although asthma can't be cured, it can be well managed with self-care and appropriate use of medicines.\n  * This page focuses on asthma in adults. For information about children with asthma, see the asthma in children page.\n\n\n![Harakeke flower New Zealand](https://healthify.nz/assets/Plants-and-animals/Harakeke-flower-HN-950x690.jpg)\nQR Code Print\n####  What is asthma? (+ VIDEO) \nAotearoa New Zealand has one of the highest rates of asthma in the world – asthma affects up to 1 in 7 children and 1 in 8 adults. It's more common among Māori adults and tamariki.\nIf you have asthma, your airways are sensitive and react to certain triggers such as allergens (substances that cause an allergic reaction), viruses, cold or humid weather, exercise and air pollutants such as cigarette smoke.\nThese triggers cause your air passages to tighten up, swell on the inside (become inflamed) and produce more mucus. As a result, the airways become narrower, making it difficult for air to move into your lungs, and even more difficult for air to move out.\n####    \nVideo: What is asthma? Causes, signs and symptoms, diagnosis and treatment  \n  \n\n(Medical Centric, US, 2018)\n####  What causes asthma? \nAsthma is thought to be caused by a combination of genetic and environmental factors.\n####    \nGenetic factors\nAsthma and allergies are closely linked. It's been estimated that about 70 to 80% of asthma in Aotearoa New Zealand is associated with allergies. Often people with asthma also have [eczema](https://healthify.nz/health-a-z/e/eczema \"Eczema\") (allergic skin rash) or [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\"), or have close family members who have asthma, eczema or hay fever. The tendency for these 3 conditions to occur together is known as atopy. If you are atopic, allergies can be a trigger for your asthma. \n####    \nEnvironmental factors\nCertain things in our environment thought to have a role in causing asthma include:\n  * allergens\n  * air pollution (including tobacco smoke and petrol fumes)\n  * workplace chemicals. \n\n\n####  What are the symptoms of asthma? \nAsthma is ongoing and your symptoms may come and go.\n#### Common symptoms of asthma include:\n  * difficulty breathing, feeling out of breath or as though you can't get enough air out of your lungs\n  * a tight feeling in your chest like something is squeezing or sitting on your chest\n  * wheezing (a whistling, musical or squeaky noise in your chest)\n  * a cough, which can be worse at night or in the morning.\n\n\nIf you have any of these symptoms, see your healthcare provider so they can assess if this is due to asthma or something else. \nIf you are using a [peak flow meter](https://healthify.nz/health-a-z/p/peak-flow-meter-asthma), a more than 20% day-to-day change in your recordings is a sign of asthma, or that your existing asthma needs better care.   \n  \n\n#### Severe asthma symptoms\nFrom time to time, your symptoms may get gradually, or suddenly, worse – these are called flare ups or exacerbations. Seek urgent medical help if you have any of these severe symptoms:\n  * it's difficult to talk\n  * your lips and/or fingernails have a bluish tinge\n  * your nostrils flare when you breathe\n  * the skin around your neck and/or ribs pulls in when you breathe\n  * your heart is racing\n  * it's hard to walk\n  * your peak flow recordings are muck lower than usual.\n\n**For severe asthma symptoms, you should use your reliever inhaler immediately and call an ambulance on 111 or go to your nearest Accident & Emergency clinic.**  \n---  \n####  What triggers asthma symptoms? \nLearning what triggers your asthma and finding ways to avoid or reduce the effects is an important part of managing your asthma. \nCommon asthma triggers include:\n  * house[dust mite](https://healthify.nz/health-a-z/a/allergy-dust-mites)\n  * [infections of your airways](https://healthify.nz/health-a-z/r/respiratory-tract-infection-topics \"Respiratory infections\"), such as colds and flu \n  * pollen\n  * mould\n  * pets\n  * cigarette smoke\n  * weather, such as change in temperature, cold weather or humid weather\n  * exercise\n  * stress and high emotion\n  * chemicals that irritate the airways, such as sprays, perfumes, cleaning fluids\n  * some medications (read more about[medications that may trigger asthma](https://healthify.nz/medicines-a-z/a/medicines-that-may-trigger-asthma-symptoms \"Medicines that may trigger asthma symptoms\")).\n\n\n####  How is asthma diagnosed? \nAsthma can generally be diagnosed from:\n  * a description of your asthma symptoms now and in the past\n  * listening to your breathing with a stethoscope\n  * checking how your lungs are working with breathing tests, such as a peak flow meter (a device that measures changes in your breathing over the day)\n  * a spirometry test (with a machine that measures lung function) – this may be available at your healthcare provider's practice or you may need to go to your local hospital.\n\n\nMore detailed testing may be required, such as:\n  * a blood test (blood eosinophils and IgE level)\n  * a skin-prick test to test for allergens\n  * [a chest X-ray](https://healthify.nz/health-a-z/x/x-ray#chest-x-ray) to rule out other conditions.\n\n\nOther lung function tests such as an exhaled nitric oxide test (FeNO) or airway challenging testing may be required. If these lung function tests are needed, you'll be referred to a specialist clinic. \nOnce a diagnosis is made, your healthcare provider will prescribe the type of medicines you need to take and should set up an[asthma action plan(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Open external link\"). This plan reminds you how to manage your asthma every day and how to recognise and manage your asthma when your symptoms get worse. Regular peak flow monitoring may help you achieve good control and peak flow reading targets may be included in your asthma action plan. \n####  How is asthma treated? \n#### Aims of treatment\nWhile asthma can't be cured, the correct use of medicine combined with other self-care measures means that symptoms can be well controlled for most people.\nAsthma treatment aims to keep your symptoms under control and prevent asthma attacks, or sudden worsening of symptoms. This is so that your asthma doesn't interfere with your daily activities and you can enjoy a full and active life.\n####    \nTreatment\nTreatment of asthma consists of inhaled medicines. It's crucial to receive good education on how to use the different inhalers properly.\nThere are 2 types of inhalers:\n  * Metered dose inhalers (MDIs), and\n  * dry powder inhalers.\n\n\nMDIs are best used with a spacer to make sure the medicine is delivered to your small airways or breathing tubes. \nGenerally there are 2 main approaches to the treatment of asthma, depending on whether you are using a budesonide/formoterol inhaler or a steroid inhaler with/without long-acting bronchodilator. \n####    \nBudesonide/formoterol\nExamples of Budesonide/formoterol inhalers:\n  * [Symbicort Turbuhaler](https://healthify.nz/medicines-a-z/s/symbicort-for-asthma \"Symbicort\")\n  * [Vannair Inhaler](https://healthify.nz/medicines-a-z/v/vannair-for-asthma)\n  * [DuoResp Spiromax](https://healthify.nz/medicines-a-z/d/duoresp-spiromax \"DuoResp Spiromax\")\n\n\n**Mild symptoms**\n  * Use budesonide/formoterol when required for relief of asthma.\n  * This is also called **a** nti-**i** nflammatory **r** eliever (AIR) therapy or **s** ingle-inhaler **m** aintenance **a** nd **r** eliever (SMART) **t** herapy.\n\n\nModerate to severe symptoms\n  * Use budesonide/formoterol every day **PLUS** when required for relief of asthma symptoms.\n  * Also called **s** ingle-inhaler **m** aintenance **a** nd **r** eliever (SMART) **t** herapy.\n\n\n####    \nSteroid inhaler with/without long-acting bronchodilator\n**Mild symptoms**\n  * Use your steroid inhaler every day, even when you're not having symptoms.\n  * Examples of steroid inhalers include: \n    * [Beclometasone ](https://healthify.nz/medicines-a-z/b/beclometasone-inhaler)(Beclazone®, Qvar®)\n    * [Budesonide ](https://healthify.nz/medicines-a-z/b/budesonide-inhaler)(Pulmicort®)\n    * [Fluticasone ](https://healthify.nz/medicines-a-z/f/fluticasone-inhaler-and-accuhaler)(Flixotide®)\n\n\n  * Use [salbutamol](https://healthify.nz/medicines-a-z/s/salbutamol) or [terbutaline](https://healthify.nz/medicines-a-z/t/terbutaline) for symptom relief when needed.\n  * If you’re using them more than twice a week, see your healthcare provider to review your treatment.\n\n\n**Moderate to severe symptoms**\n  * Use your **steroid inhaler** PLUS **long-acting bronchodilator** every day, even when you're not having symptoms.\n  * For examples of steroid inhalers and long-acting bronchodilator inhalers, see [asthma medications](https://healthify.nz/medicines-a-z/a/asthma-medication \"Medication\").\n  * Use[salbutamol](https://healthify.nz/medicines-a-z/s/salbutamol \"Salbutamol\") or[terbutaline](https://healthify.nz/medicines-a-z/t/terbutaline \"Terbutaline\")\n  * If you're are using them more than twice a week, see your healthcare provider to review your treatment.\n\n\nFor severe flare ups or exacerbations of asthma or for asthma attacks your healthcare provider will prescribe prednisone for a short period. Prednisone is a tablet to help reduce inflammation. It shouldn't generally be used long term for asthma treatment. If you need prednisone regularly each year you should be referred to a specialist clinic. Extra inhaler treatment might be needed or, for some people, new generation biological treatments (eg, [benralizumab](https://healthify.nz/medicines-a-z/b/benralizumab), [mepolizumab](https://healthify.nz/medicines-a-z/m/mepolizumab)).\nAfter each flare up you should have your inhalers reviewed – including your preventer treatment and your asthma action plan.\nThere are other less commonly used medicines for asthma prevention such as [montelukast](https://healthify.nz/medicines-a-z/m/montelukast) tablets.\n####    \nFlu and COVID-19 vaccines\nPeople with asthma are at increased risk of complications from the flu, even if their symptoms are mild or well-controlled by medicine. Complications include[pneumonia (lung infection)](https://healthify.nz/health-a-z/p/pneumonia \"Pneumonia\"),[heart failure](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n  * Ask your healthcare provider about getting the flu vaccination to reduce your risk of flu.\n  * The flu vaccine is usually free for people with asthma, if you are on regular preventative therapy.\n  * It is best to get vaccinated before the start of the winter season, before the flu enters the community.\n  * It’s important to get the flu jab every year because each year the flu vaccine is developed to match the different strains of flu virus you are likely to come across. \n  * Have your COVID-19 booster vaccination if you can.\n  * Some people are eligible for the [respiratory syncytial virus (RSV) vaccine](https://healthify.nz/medicines-a-z/a/arexvy-vaccine).\n  * Read more about[influenza](https://healthify.nz/health-a-z/i/influenza \"Influenza\")[flu vaccine](https://healthify.nz/medicines-a-z/i/influenza-vaccine-adults \"Influenza vaccine\") and the [COVID-19 vaccine](https://healthify.nz/medicines-a-z/c/covid-19-vaccination-topics). \n\n\n####  When should I go back to my healthcare provider? \n  * Keep an eye on your symptoms. If you're getting wheezy more than twice a week, it means your asthma is not well controlled. See your healthcare provider for a check-up.\n  * If you have symptoms of hay fever ([allergic rhinitis](https://healthify.nz/health-a-z/h/hay-fever)), such as nasal congestion, runny nose, sneezing and itchy eyes, talk to your healthcare provider about medicine to treat these symptoms, such as[antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines \"Antihistamines\")\n  * Many people with asthma have other long-term health conditions which can cause symptoms that are similar to asthma, but may not respond to the usual inhaler treatments. Your healthcare provider should review whether this is happening for you. \n  * If your asthma is severe, or hard to treat, you may be referred to a specialist clinic. \n\n\n####  What self-care can I do with asthma? (+ APPS) \nThere are many things you can do to improve how well your asthma is controlled. By working with your healthcare provider to create an[asthma action plan(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Asthma action plan\"), you can reduce the severity of your asthma symptoms and how often you have them.\n  * Understand your asthma and learn to recognise your symptoms and your triggers.\n  * Take your prescribed medicine, especially your preventer, every day, regardless of whether you have asthma symptoms or not.\n  * Be confident that you're using your inhalers properly – be certain the medicine is delivered to the small breathing tubes or bronchi.\n  * If you smoke, try to[quit](https://healthify.nz/hauora-wellbeing/s/smoking-treatments-for-quitting-smoking \"Quit smoking – treatments\"). Try to keep clear of anyone else who smokes and of any other fumes.\n  * If you vape, try to quit.\n  * Ask your healthcare provider about managing allergies if these are a known trigger for you.\n  * Use the[asthma under control test(external link)](http://www.asthmacontrol.co.nz/ \"Open external link\")\n  * Use a peak flow meter to take and record regular readings to check that your asthma is under control.\n  * Stay active – physical activity improves how well your lungs work, and people who are fit usually find they have less asthma and cope better when they do have it. There are many elite athletes with asthma. \n  * Visit your asthma team (your healthcare provider, your practice nurse and your pharmacist) regularly. They will review the medicines you're taking and can teach you how to use your inhaler properly so you get the most benefit. \n  * Keep your[dust-mite allergy](https://healthify.nz/health-a-z/a/allergy-dust-mites \"Allergy – dust mites\") under control.\n  * Ask for a specialist referral if your asthma is severe or seems difficult to treat in spite of: \n    * you using your inhalers as prescribed, and\n    * other factors that increase asthma-like symptoms being ruled out.\n\n\nRead more about an [asthma action plan.(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Asthma action plan\")\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [asthma apps](https://healthify.nz/apps/a/asthma-apps).\n####    \nSupport\n[Asthma New Zealand(external link)](https://www.asthma.org.nz/pages/our-service \"Open external link\") provides education, training and support to individuals with asthma/COPD and their whānau.\n####  Asthma action plans \nIt can be hard to remember directions or instructions from your healthcare provider. That's why you also need an asthma action plan. This is a written document to help you remember what you need to do to manage your asthma well.\nIt includes information on how to:\n  * manage your asthma daily, including taking medications correctly\n  * identify and avoid exposure to allergens and irritants that can bring about asthma symptoms\n  * recognise and handle worsening asthma symptoms, and when, how, and who to contact in an emergency.\n\n\nYou can develop your asthma management plan with your healthcare provider. It will be based on how severe your asthma is and your preferences. At each visit with your healthcare provider, you can review your plan and make changes as needed.\nRegular peak flow monitoring may help you to get good control of your asthma. Your peak flow reading target may be included in your asthma action plan.\n####    \nWhat are the benefits of an asthma action plan?\nUsing an asthma action plan that meets your individual needs has been found to:\n  * reduce absences from work or school\n  * reduce hospital admissions\n  * reduce emergency visits to general practice\n  * reduce reliever medication use\n  * improve lung function.\n\n\n####    \nSample asthma action plans\nAsthma + Respiratory Foundation NZ has [action plans for adults and children(external link)](https://www.asthmafoundation.org.nz/resources/topic/asthma-action-plans \"Open external link\").\n####  VIDEOS: NZSL Asthma \nNew Zealand Sign Language videos about asthma, produced by Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ. These videos are NZSL translations of Healthify pages on asthma. \n#### Video: Asthma – an overview\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: What causes asthma?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: What are symptoms of asthma?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: What triggers asthma symptoms?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: How is asthma diagnosed?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022\n####    \nVideo: How is asthma treated?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)  \n\n####  Related topics on Healthify \n[Asthma in children | Mate huango tamariki](https://healthify.nz/health-a-z/a/asthma-children \"Asthma in children | Mate huango tamariki\")  \n[Asthma triggered by exercise](https://healthify.nz/health-a-z/a/asthma-exercise \"Asthma triggered by exercise\")  \n[Asthma – first aid](https://healthify.nz/health-a-z/a/asthma-first-aid \"Asthma – first aid\")  \n[Asthma and pregnancy](https://healthify.nz/health-a-z/a/asthma-pregnancy \"Asthma and pregnancy\")  \n[Asthma topics | Mate huango](https://healthify.nz/health-a-z/a/asthma-topics \"Asthma topics | Mate huango\")\n####  More information \n[Living with asthma(external link)](https://www.asthmafoundation.org.nz/your-health/living-with-asthma \"Open external link\") Asthma + Respiratory Foundation NZ  \n[Asthma and Allergy Frequently Asked Questions(external link)](https://www.allergy.org.au/images/pc/ASCIA_PC_Asthma_and_allergy_FAQ_2024.pdf \"Open external link\") ASCIA, Australia, 2024  \n[Tools and resources(external link)](https://www.severeasthma.org.au/tools-resources/ \"Open external link\") Centre of Excellence in Severe Asthma, Australia\n#### Brochures\n**Asthma + Respiratory Foundation NZ brochures**\n  * [Asthma – what is it?(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/What-is-Asthma-Resource.pdf \"Open external link\")\n  * [Asthma – first aid poster(external link)](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\") available in [English(external link)](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\"), [te reo Māori(external link)](https://www.asthmafoundation.org.nz/assets/documents/Asthma-First-Aid-Poster-Te-Reo-Maori.pdf \"Open external link\")\n  * [Asthma checklist(external link)](https://www.asthmafoundation.org.nz/assets/documents/Asthma-Checklist.pdf \"Open external link\")\n  * [Breathing and asthma(external link)](https://www.asthmafoundation.org.nz/assets/documents/Breathing-Asthma-Fact-Sheet.pdf \"Open external link\")\n  * [House dust mites(external link)](https://www.asthmafoundation.org.nz/assets/documents/House-Dust-Mites-Fact-Sheet.pdf \"Open external link\")\n  * [Asthma – help yourself and stay well(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Asthma-Help-Yourself-and-Stay-Well-Resource.pdf \"Open external link\") available in [English,(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Asthma-Help-Yourself-and-Stay-Well-Resource.pdf \"Open external link\") [te reo Māori(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Asthma-Help-Yourself-and-Stay-Well-Maori-Resource.jpg \"Open external link\")\n  * [Triggers in asthma(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Triggers-in-Asthma-Resource.pdf \"Open external link\")\n  * [Better breathing – healthy lung checklist(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Better-Breathing-Checklist.pdf \"Open external link\")\n  * [Home sweet healthy home(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Healthy-Home-Checklist.pdf \"Open external link\")\n\n\n[GINA patient guide for asthma – you can control your asthma(external link)](https://ginasthma.org/wp-content/uploads/2021/05/GINA-Patient-Guide-2021-copy.pdf \"Open external link\") Global Initiative for Asthma (GINA)  \n[Inhaler device identification(external link)](https://www.nzrespiratoryguidelines.co.nz/inhaler-identification.html \"Open external link\") NZ Respiratory Guidelines\n####    \nApps\n[A](https://healthify.nz/apps/a/asthma-apps)[sthma apps](https://healthify.nz/apps/a/asthma-apps)\n####   \nReferences\n  1. Barnard LT, Zhang J. [The impact of respiratory disease in NZ – 2023 update(external link)](https://www.asthmafoundation.org.nz/assets/documents/Respiratory-Impact-Report-2023.pdf \"Open external link\") Asthma and Respiratory Foundation NZ, 2023\n  2. [NZ adolescent and adult asthma guidelines 2020(external link)](https://www.nzrespiratoryguidelines.co.nz/uploads/8/3/0/1/83014052/arfnz_adolescent_and_adult_asthma_guidelines_.pdf \"Open external link\") Asthma + Respiratory Foundation, NZ\n  3. [Difficult-to-treat and severe asthma in adolescent and adult patients(external link)](https://ginasthma.org/wp-content/uploads/2024/11/GINA-Severe-Asthma-Guide-2024-WEB-WMS.pdf \"Open external link\") Global Initiative for Asthma, 2024\n  4. [Asthma in adults – a quick reference guide for primary care health professionals(external link)](https://files.nationalasthma.org.au/resources/NAC039-Asthma-in-Adults_Quick-Reference-Guide_Oct-2024_WEB.pdf \"Open external link\") National Asthma Council, Australia, 2024\n  5. [Global strategy for asthma management and prevention(external link)](https://ginasthma.org/wp-content/uploads/2024/05/GINA-2024-Strategy-Report-24_05_22_WMS.pdf \"Open external link\") Global Initiative for Asthma, 2024\n\n\n####  Information for healthcare providers \nSee our page [Asthma in adults for healthcare providers](https://healthify.nz/healthcare-providers/a/asthma-healthcare-providers), [Long-term conditions for healthcare providers](https://healthify.nz/healthcare-providers/l/long-term-conditions-hcps)\n## Brochures\n![asthma foundation what is asthma](https://healthify.nz/assets/asthma-foundation-what-is-asthma.png)\n[Asthma – what is it?](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/What-is-Asthma-Resource.pdf \"Open external link\")\nAsthma and Respiratory Foundation NZ, 2013\n![4 stage asthma action plan asthma and resp foundation nz](https://healthify.nz/assets/4-stage-asthma-action-plan-asthma-and-resp-foundation-nz.jpg)\n[4 stage adult asthma action plan](https://healthify.nz/assets/468839-4-stage-asthma-action-plan-v05-bleed.pdf \"4 stage adult asthma action plan\")\nAsthma + Respiratory Foundation, NZ [te reo Māori](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/4-Stage-Asthma-Action-Plan-Maori.pdf \"Open external link\"), [Samoan](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/468839-4-Stage-Asthma-Action-Plan-v05-SAM-WEB.pdf \"Open external link\")\n![asthma first aid 2021](https://healthify.nz/assets/asthma-first-aid-2021.jpg)\n[Asthma – First aid poster](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\")\nAsthma and Respiratory Foundation NZ, 2021  \n[English](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\"), [te reo Māori](https://www.asthmafoundation.org.nz/assets/documents/Asthma-First-Aid-Poster-Te-Reo-Maori.pdf \"Open external link\")\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Roland Meyer, Specialist Physician, Respiratory and General Medicine\nLast reviewed: 18 Nov 2024\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/asthma-adults \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Asthma in adults\n### Key points about asthma in adults\n  * Asthma (mate huango) is a common lung condition that affects the breathing tubes (airways) that carry air in and out of your lungs.\n  * Asthma causes wheeze, a tight chest and cough, and can make it difficult to breathe.\n  * Although asthma can't be cured, it can be well managed with self-care and appropriate use of medicines.\n  * This page focuses on asthma in adults. For information about children with asthma, see the asthma in children page.\n\n\n![Harakeke flower New Zealand](https://healthify.nz/assets/Plants-and-animals/Harakeke-flower-HN-950x690.jpg)\nQR Code Print\n####  What is asthma? (+ VIDEO) \nAotearoa New Zealand has one of the highest rates of asthma in the world – asthma affects up to 1 in 7 children and 1 in 8 adults. It's more common among Māori adults and tamariki.\nIf you have asthma, your airways are sensitive and react to certain triggers such as allergens (substances that cause an allergic reaction), viruses, cold or humid weather, exercise and air pollutants such as cigarette smoke.\nThese triggers cause your air passages to tighten up, swell on the inside (become inflamed) and produce more mucus. As a result, the airways become narrower, making it difficult for air to move into your lungs, and even more difficult for air to move out.\n####    \nVideo: What is asthma? Causes, signs and symptoms, diagnosis and treatment  \n  \n\n(Medical Centric, US, 2018)\n####  What causes asthma? \nAsthma is thought to be caused by a combination of genetic and environmental factors.\n####    \nGenetic factors\nAsthma and allergies are closely linked. It's been estimated that about 70 to 80% of asthma in Aotearoa New Zealand is associated with allergies. Often people with asthma also have [eczema](https://healthify.nz/health-a-z/e/eczema \"Eczema\") (allergic skin rash) or [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\"), or have close family members who have asthma, eczema or hay fever. The tendency for these 3 conditions to occur together is known as atopy. If you are atopic, allergies can be a trigger for your asthma. \n####    \nEnvironmental factors\nCertain things in our environment thought to have a role in causing asthma include:\n  * allergens\n  * air pollution (including tobacco smoke and petrol fumes)\n  * workplace chemicals. \n\n\n####  What are the symptoms of asthma? \nAsthma is ongoing and your symptoms may come and go.\n#### Common symptoms of asthma include:\n  * difficulty breathing, feeling out of breath or as though you can't get enough air out of your lungs\n  * a tight feeling in your chest like something is squeezing or sitting on your chest\n  * wheezing (a whistling, musical or squeaky noise in your chest)\n  * a cough, which can be worse at night or in the morning.\n\n\nIf you have any of these symptoms, see your healthcare provider so they can assess if this is due to asthma or something else. \nIf you are using a [peak flow meter](https://healthify.nz/health-a-z/p/peak-flow-meter-asthma), a more than 20% day-to-day change in your recordings is a sign of asthma, or that your existing asthma needs better care.   \n  \n\n#### Severe asthma symptoms\nFrom time to time, your symptoms may get gradually, or suddenly, worse – these are called flare ups or exacerbations. Seek urgent medical help if you have any of these severe symptoms:\n  * it's difficult to talk\n  * your lips and/or fingernails have a bluish tinge\n  * your nostrils flare when you breathe\n  * the skin around your neck and/or ribs pulls in when you breathe\n  * your heart is racing\n  * it's hard to walk\n  * your peak flow recordings are muck lower than usual.\n\n**For severe asthma symptoms, you should use your reliever inhaler immediately and call an ambulance on 111 or go to your nearest Accident & Emergency clinic.**  \n---  \n####  What triggers asthma symptoms? \nLearning what triggers your asthma and finding ways to avoid or reduce the effects is an important part of managing your asthma. \nCommon asthma triggers include:\n  * house[dust mite](https://healthify.nz/health-a-z/a/allergy-dust-mites)\n  * [infections of your airways](https://healthify.nz/health-a-z/r/respiratory-tract-infection-topics \"Respiratory infections\"), such as colds and flu \n  * pollen\n  * mould\n  * pets\n  * cigarette smoke\n  * weather, such as change in temperature, cold weather or humid weather\n  * exercise\n  * stress and high emotion\n  * chemicals that irritate the airways, such as sprays, perfumes, cleaning fluids\n  * some medications (read more about[medications that may trigger asthma](https://healthify.nz/medicines-a-z/a/medicines-that-may-trigger-asthma-symptoms \"Medicines that may trigger asthma symptoms\")).\n\n\n####  How is asthma diagnosed? \nAsthma can generally be diagnosed from:\n  * a description of your asthma symptoms now and in the past\n  * listening to your breathing with a stethoscope\n  * checking how your lungs are working with breathing tests, such as a peak flow meter (a device that measures changes in your breathing over the day)\n  * a spirometry test (with a machine that measures lung function) – this may be available at your healthcare provider's practice or you may need to go to your local hospital.\n\n\nMore detailed testing may be required, such as:\n  * a blood test (blood eosinophils and IgE level)\n  * a skin-prick test to test for allergens\n  * [a chest X-ray](https://healthify.nz/health-a-z/x/x-ray#chest-x-ray) to rule out other conditions.\n\n\nOther lung function tests such as an exhaled nitric oxide test (FeNO) or airway challenging testing may be required. If these lung function tests are needed, you'll be referred to a specialist clinic. \nOnce a diagnosis is made, your healthcare provider will prescribe the type of medicines you need to take and should set up an[asthma action plan(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Open external link\"). This plan reminds you how to manage your asthma every day and how to recognise and manage your asthma when your symptoms get worse. Regular peak flow monitoring may help you achieve good control and peak flow reading targets may be included in your asthma action plan. \n####  How is asthma treated? \n#### Aims of treatment\nWhile asthma can't be cured, the correct use of medicine combined with other self-care measures means that symptoms can be well controlled for most people.\nAsthma treatment aims to keep your symptoms under control and prevent asthma attacks, or sudden worsening of symptoms. This is so that your asthma doesn't interfere with your daily activities and you can enjoy a full and active life.\n####    \nTreatment\nTreatment of asthma consists of inhaled medicines. It's crucial to receive good education on how to use the different inhalers properly.\nThere are 2 types of inhalers:\n  * Metered dose inhalers (MDIs), and\n  * dry powder inhalers.\n\n\nMDIs are best used with a spacer to make sure the medicine is delivered to your small airways or breathing tubes. \nGenerally there are 2 main approaches to the treatment of asthma, depending on whether you are using a budesonide/formoterol inhaler or a steroid inhaler with/without long-acting bronchodilator. \n####    \nBudesonide/formoterol\nExamples of Budesonide/formoterol inhalers:\n  * [Symbicort Turbuhaler](https://healthify.nz/medicines-a-z/s/symbicort-for-asthma \"Symbicort\")\n  * [Vannair Inhaler](https://healthify.nz/medicines-a-z/v/vannair-for-asthma)\n  * [DuoResp Spiromax](https://healthify.nz/medicines-a-z/d/duoresp-spiromax \"DuoResp Spiromax\")\n\n\n**Mild symptoms**\n  * Use budesonide/formoterol when required for relief of asthma.\n  * This is also called **a** nti-**i** nflammatory **r** eliever (AIR) therapy or **s** ingle-inhaler **m** aintenance **a** nd **r** eliever (SMART) **t** herapy.\n\n\nModerate to severe symptoms\n  * Use budesonide/formoterol every day **PLUS** when required for relief of asthma symptoms.\n  * Also called **s** ingle-inhaler **m** aintenance **a** nd **r** eliever (SMART) **t** herapy.\n\n\n####    \nSteroid inhaler with/without long-acting bronchodilator\n**Mild symptoms**\n  * Use your steroid inhaler every day, even when you're not having symptoms.\n  * Examples of steroid inhalers include: \n    * [Beclometasone ](https://healthify.nz/medicines-a-z/b/beclometasone-inhaler)(Beclazone®, Qvar®)\n    * [Budesonide ](https://healthify.nz/medicines-a-z/b/budesonide-inhaler)(Pulmicort®)\n    * [Fluticasone ](https://healthify.nz/medicines-a-z/f/fluticasone-inhaler-and-accuhaler)(Flixotide®)\n\n\n  * Use [salbutamol](https://healthify.nz/medicines-a-z/s/salbutamol) or [terbutaline](https://healthify.nz/medicines-a-z/t/terbutaline) for symptom relief when needed.\n  * If you’re using them more than twice a week, see your healthcare provider to review your treatment.\n\n\n**Moderate to severe symptoms**\n  * Use your **steroid inhaler** PLUS **long-acting bronchodilator** every day, even when you're not having symptoms.\n  * For examples of steroid inhalers and long-acting bronchodilator inhalers, see [asthma medications](https://healthify.nz/medicines-a-z/a/asthma-medication \"Medication\").\n  * Use[salbutamol](https://healthify.nz/medicines-a-z/s/salbutamol \"Salbutamol\") or[terbutaline](https://healthify.nz/medicines-a-z/t/terbutaline \"Terbutaline\")\n  * If you're are using them more than twice a week, see your healthcare provider to review your treatment.\n\n\nFor severe flare ups or exacerbations of asthma or for asthma attacks your healthcare provider will prescribe prednisone for a short period. Prednisone is a tablet to help reduce inflammation. It shouldn't generally be used long term for asthma treatment. If you need prednisone regularly each year you should be referred to a specialist clinic. Extra inhaler treatment might be needed or, for some people, new generation biological treatments (eg, [benralizumab](https://healthify.nz/medicines-a-z/b/benralizumab), [mepolizumab](https://healthify.nz/medicines-a-z/m/mepolizumab)).\nAfter each flare up you should have your inhalers reviewed – including your preventer treatment and your asthma action plan.\nThere are other less commonly used medicines for asthma prevention such as [montelukast](https://healthify.nz/medicines-a-z/m/montelukast) tablets.\n####    \nFlu and COVID-19 vaccines\nPeople with asthma are at increased risk of complications from the flu, even if their symptoms are mild or well-controlled by medicine. Complications include[pneumonia (lung infection)](https://healthify.nz/health-a-z/p/pneumonia \"Pneumonia\"),[heart failure](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n  * Ask your healthcare provider about getting the flu vaccination to reduce your risk of flu.\n  * The flu vaccine is usually free for people with asthma, if you are on regular preventative therapy.\n  * It is best to get vaccinated before the start of the winter season, before the flu enters the community.\n  * It’s important to get the flu jab every year because each year the flu vaccine is developed to match the different strains of flu virus you are likely to come across. \n  * Have your COVID-19 booster vaccination if you can.\n  * Some people are eligible for the [respiratory syncytial virus (RSV) vaccine](https://healthify.nz/medicines-a-z/a/arexvy-vaccine).\n  * Read more about[influenza](https://healthify.nz/health-a-z/i/influenza \"Influenza\")[flu vaccine](https://healthify.nz/medicines-a-z/i/influenza-vaccine-adults \"Influenza vaccine\") and the [COVID-19 vaccine](https://healthify.nz/medicines-a-z/c/covid-19-vaccination-topics). \n\n\n####  When should I go back to my healthcare provider? \n  * Keep an eye on your symptoms. If you're getting wheezy more than twice a week, it means your asthma is not well controlled. See your healthcare provider for a check-up.\n  * If you have symptoms of hay fever ([allergic rhinitis](https://healthify.nz/health-a-z/h/hay-fever)), such as nasal congestion, runny nose, sneezing and itchy eyes, talk to your healthcare provider about medicine to treat these symptoms, such as[antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines \"Antihistamines\")\n  * Many people with asthma have other long-term health conditions which can cause symptoms that are similar to asthma, but may not respond to the usual inhaler treatments. Your healthcare provider should review whether this is happening for you. \n  * If your asthma is severe, or hard to treat, you may be referred to a specialist clinic. \n\n\n####  What self-care can I do with asthma? (+ APPS) \nThere are many things you can do to improve how well your asthma is controlled. By working with your healthcare provider to create an[asthma action plan(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Asthma action plan\"), you can reduce the severity of your asthma symptoms and how often you have them.\n  * Understand your asthma and learn to recognise your symptoms and your triggers.\n  * Take your prescribed medicine, especially your preventer, every day, regardless of whether you have asthma symptoms or not.\n  * Be confident that you're using your inhalers properly – be certain the medicine is delivered to the small breathing tubes or bronchi.\n  * If you smoke, try to[quit](https://healthify.nz/hauora-wellbeing/s/smoking-treatments-for-quitting-smoking \"Quit smoking – treatments\"). Try to keep clear of anyone else who smokes and of any other fumes.\n  * If you vape, try to quit.\n  * Ask your healthcare provider about managing allergies if these are a known trigger for you.\n  * Use the[asthma under control test(external link)](http://www.asthmacontrol.co.nz/ \"Open external link\")\n  * Use a peak flow meter to take and record regular readings to check that your asthma is under control.\n  * Stay active – physical activity improves how well your lungs work, and people who are fit usually find they have less asthma and cope better when they do have it. There are many elite athletes with asthma. \n  * Visit your asthma team (your healthcare provider, your practice nurse and your pharmacist) regularly. They will review the medicines you're taking and can teach you how to use your inhaler properly so you get the most benefit. \n  * Keep your[dust-mite allergy](https://healthify.nz/health-a-z/a/allergy-dust-mites \"Allergy – dust mites\") under control.\n  * Ask for a specialist referral if your asthma is severe or seems difficult to treat in spite of: \n    * you using your inhalers as prescribed, and\n    * other factors that increase asthma-like symptoms being ruled out.\n\n\nRead more about an [asthma action plan.(external link)](https://www.asthmafoundation.org.nz/resources/4-stage-asthma-action-plans \"Asthma action plan\")\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [asthma apps](https://healthify.nz/apps/a/asthma-apps).\n####    \nSupport\n[Asthma New Zealand(external link)](https://www.asthma.org.nz/pages/our-service \"Open external link\") provides education, training and support to individuals with asthma/COPD and their whānau.\n####  Asthma action plans \nIt can be hard to remember directions or instructions from your healthcare provider. That's why you also need an asthma action plan. This is a written document to help you remember what you need to do to manage your asthma well.\nIt includes information on how to:\n  * manage your asthma daily, including taking medications correctly\n  * identify and avoid exposure to allergens and irritants that can bring about asthma symptoms\n  * recognise and handle worsening asthma symptoms, and when, how, and who to contact in an emergency.\n\n\nYou can develop your asthma management plan with your healthcare provider. It will be based on how severe your asthma is and your preferences. At each visit with your healthcare provider, you can review your plan and make changes as needed.\nRegular peak flow monitoring may help you to get good control of your asthma. Your peak flow reading target may be included in your asthma action plan.\n####    \nWhat are the benefits of an asthma action plan?\nUsing an asthma action plan that meets your individual needs has been found to:\n  * reduce absences from work or school\n  * reduce hospital admissions\n  * reduce emergency visits to general practice\n  * reduce reliever medication use\n  * improve lung function.\n\n\n####    \nSample asthma action plans\nAsthma + Respiratory Foundation NZ has [action plans for adults and children(external link)](https://www.asthmafoundation.org.nz/resources/topic/asthma-action-plans \"Open external link\").\n####  VIDEOS: NZSL Asthma \nNew Zealand Sign Language videos about asthma, produced by Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ. These videos are NZSL translations of Healthify pages on asthma. \n#### Video: Asthma – an overview\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: What causes asthma?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: What are symptoms of asthma?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: What triggers asthma symptoms?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)\n####    \nVideo: How is asthma diagnosed?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022\n####    \nVideo: How is asthma treated?\n  \n(Platform Trust, in partnership with Deafradio and Healthify He Puna Waiora, NZ, 2022)  \n\n####  Related topics on Healthify \n[Asthma in children | Mate huango tamariki](https://healthify.nz/health-a-z/a/asthma-children \"Asthma in children | Mate huango tamariki\")  \n[Asthma triggered by exercise](https://healthify.nz/health-a-z/a/asthma-exercise \"Asthma triggered by exercise\")  \n[Asthma – first aid](https://healthify.nz/health-a-z/a/asthma-first-aid \"Asthma – first aid\")  \n[Asthma and pregnancy](https://healthify.nz/health-a-z/a/asthma-pregnancy \"Asthma and pregnancy\")  \n[Asthma topics | Mate huango](https://healthify.nz/health-a-z/a/asthma-topics \"Asthma topics | Mate huango\")\n####  More information \n[Living with asthma(external link)](https://www.asthmafoundation.org.nz/your-health/living-with-asthma \"Open external link\") Asthma + Respiratory Foundation NZ  \n[Asthma and Allergy Frequently Asked Questions(external link)](https://www.allergy.org.au/images/pc/ASCIA_PC_Asthma_and_allergy_FAQ_2024.pdf \"Open external link\") ASCIA, Australia, 2024  \n[Tools and resources(external link)](https://www.severeasthma.org.au/tools-resources/ \"Open external link\") Centre of Excellence in Severe Asthma, Australia\n#### Brochures\n**Asthma + Respiratory Foundation NZ brochures**\n  * [Asthma – what is it?(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/What-is-Asthma-Resource.pdf \"Open external link\")\n  * [Asthma – first aid poster(external link)](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\") available in [English(external link)](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\"), [te reo Māori(external link)](https://www.asthmafoundation.org.nz/assets/documents/Asthma-First-Aid-Poster-Te-Reo-Maori.pdf \"Open external link\")\n  * [Asthma checklist(external link)](https://www.asthmafoundation.org.nz/assets/documents/Asthma-Checklist.pdf \"Open external link\")\n  * [Breathing and asthma(external link)](https://www.asthmafoundation.org.nz/assets/documents/Breathing-Asthma-Fact-Sheet.pdf \"Open external link\")\n  * [House dust mites(external link)](https://www.asthmafoundation.org.nz/assets/documents/House-Dust-Mites-Fact-Sheet.pdf \"Open external link\")\n  * [Asthma – help yourself and stay well(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Asthma-Help-Yourself-and-Stay-Well-Resource.pdf \"Open external link\") available in [English,(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Asthma-Help-Yourself-and-Stay-Well-Resource.pdf \"Open external link\") [te reo Māori(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Asthma-Help-Yourself-and-Stay-Well-Maori-Resource.jpg \"Open external link\")\n  * [Triggers in asthma(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Triggers-in-Asthma-Resource.pdf \"Open external link\")\n  * [Better breathing – healthy lung checklist(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Better-Breathing-Checklist.pdf \"Open external link\")\n  * [Home sweet healthy home(external link)](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/Healthy-Home-Checklist.pdf \"Open external link\")\n\n\n[GINA patient guide for asthma – you can control your asthma(external link)](https://ginasthma.org/wp-content/uploads/2021/05/GINA-Patient-Guide-2021-copy.pdf \"Open external link\") Global Initiative for Asthma (GINA)  \n[Inhaler device identification(external link)](https://www.nzrespiratoryguidelines.co.nz/inhaler-identification.html \"Open external link\") NZ Respiratory Guidelines\n####    \nApps\n[A](https://healthify.nz/apps/a/asthma-apps)[sthma apps](https://healthify.nz/apps/a/asthma-apps)\n####   \nReferences\n  1. Barnard LT, Zhang J. [The impact of respiratory disease in NZ – 2023 update(external link)](https://www.asthmafoundation.org.nz/assets/documents/Respiratory-Impact-Report-2023.pdf \"Open external link\") Asthma and Respiratory Foundation NZ, 2023\n  2. [NZ adolescent and adult asthma guidelines 2020(external link)](https://www.nzrespiratoryguidelines.co.nz/uploads/8/3/0/1/83014052/arfnz_adolescent_and_adult_asthma_guidelines_.pdf \"Open external link\") Asthma + Respiratory Foundation, NZ\n  3. [Difficult-to-treat and severe asthma in adolescent and adult patients(external link)](https://ginasthma.org/wp-content/uploads/2024/11/GINA-Severe-Asthma-Guide-2024-WEB-WMS.pdf \"Open external link\") Global Initiative for Asthma, 2024\n  4. [Asthma in adults – a quick reference guide for primary care health professionals(external link)](https://files.nationalasthma.org.au/resources/NAC039-Asthma-in-Adults_Quick-Reference-Guide_Oct-2024_WEB.pdf \"Open external link\") National Asthma Council, Australia, 2024\n  5. [Global strategy for asthma management and prevention(external link)](https://ginasthma.org/wp-content/uploads/2024/05/GINA-2024-Strategy-Report-24_05_22_WMS.pdf \"Open external link\") Global Initiative for Asthma, 2024\n\n\n####  Information for healthcare providers \nSee our page [Asthma in adults for healthcare providers](https://healthify.nz/healthcare-providers/a/asthma-healthcare-providers), [Long-term conditions for healthcare providers](https://healthify.nz/healthcare-providers/l/long-term-conditions-hcps)\n## Brochures\n![asthma foundation what is asthma](https://healthify.nz/assets/asthma-foundation-what-is-asthma.png)\n[Asthma – what is it?](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/What-is-Asthma-Resource.pdf \"Open external link\")\nAsthma and Respiratory Foundation NZ, 2013\n![4 stage asthma action plan asthma and resp foundation nz](https://healthify.nz/assets/4-stage-asthma-action-plan-asthma-and-resp-foundation-nz.jpg)\n[4 stage adult asthma action plan](https://healthify.nz/assets/468839-4-stage-asthma-action-plan-v05-bleed.pdf \"4 stage adult asthma action plan\")\nAsthma + Respiratory Foundation, NZ [te reo Māori](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/4-Stage-Asthma-Action-Plan-Maori.pdf \"Open external link\"), [Samoan](https://s3-ap-southeast-2.amazonaws.com/assets.asthmafoundation.org.nz/documents/468839-4-Stage-Asthma-Action-Plan-v05-SAM-WEB.pdf \"Open external link\")\n![asthma first aid 2021](https://healthify.nz/assets/asthma-first-aid-2021.jpg)\n[Asthma – First aid poster](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\")\nAsthma and Respiratory Foundation NZ, 2021  \n[English](https://www.asthmafoundation.org.nz/assets/documents/ASTHMA-First-aid-A3-ENG-WEB.pdf \"Open external link\"), [te reo Māori](https://www.asthmafoundation.org.nz/assets/documents/Asthma-First-Aid-Poster-Te-Reo-Maori.pdf \"Open external link\")\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Roland Meyer, Specialist Physician, Respiratory and General Medicine\nLast reviewed: 18 Nov 2024\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/asthma-adults \n![image](https://healthify.nz/assets/Uploads/image.png)\n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-04T03:24:35.731496Z",
    "letter": "a",
    "slug": "asthma-adults"
  }
}