{
  "url": "https://healthify.nz/health-a-z/a/abortion/",
  "title": "Abortion",
  "markdown": "  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Abortion\n## Also known as a termination of pregnancy\n### Key points about abortion\n  * Abortion and related counselling services are free for anyone eligible to receive publicly-funded healthcare in Aotearoa New Zealand.\n  * There are 2 types of abortion available here: medical (taking pills) and surgical (a minor operation).\n  * Healthcare providers can provide abortion services up to and including 20 weeks of pregnancy. \n  * After 20 weeks, a second health practitioner is consulted, to decide if termination is clinically appropriate. \n  * If you're thinking about having an abortion, get advice and information from DECIDE (link provided below) and see a doctor or an organisation like Family Planning.\n  * It's up to you who you tell about the abortion, but having a support person can be really helpful.\n\n\n![Two women sitting on couch and talking while one comforts the other](https://healthify.nz/assets/Health-A-Z/Mental-health/Woman-comforting-friend-canva-950x690.jpg)\nQR Code\n![](https://healthify.nz/health-a-z/a/abortion)\nPrint\nOpen all Close all\n####  What are my options if I am pregnant? \n![Worried young woman looks out the window](https://healthify.nz/assets/Healthy-Living/Women/worried-young-woman-looking-out-window-Canva__ResizedImageWzYwMCw0MzZd.jpg)\nImage credit; Canva\nIf you miss a period or have pregnancy symptoms, find out as soon as possible whether you are pregnant. This will give you more time to think about your options and seek advice about how you wish to proceed. Pregnancy tests can be purchased from pharmacies and supermarkets, or you can see your healthcare provider or Sexual Wellbeing Aotearoa for an appointment.\nFinding out you are pregnant is different for everyone and how you feel about it will depend on a number of factors. There are several options available to you:\n  * **Keeping the pregnancy**\n  * **Whāngai** – the Māori tradition of a child being raised by a relative or relatives who are not the birth parents, eg, grandparents or other whānau members. \n  * **Adoption** a permanent legal agreement where the adoptive parents have full parental rights and responsibilities.\n  * **Abortion**\n\n\nDeciding what to do when you are pregnant is a very personal decision. Once you have the information you need, it is your decision to make. Learn more about[pregnancy options.](https://healthify.nz/hauora-wellbeing/p/pregnancy-options)\n####  Does it cost anything to have an abortion? \nMost abortion services and related counselling services are free in Aotearoa New Zealand to any pregnant person eligible for publicly funded healthcare. However, you may need to pay for an ultrasound scan. There are fees for abortion if you are not a New Zealand resident. Find out more about [non-resident abortion costs in New Zealand.(external link)](https://decide.org.nz/en/faqs/ \"Open external link\")\n####  When can abortions be carried out? \nA qualified healthcare provider can provide you with abortion services up to and including week 20 of your pregnancy.\nIf you are more than 20 weeks pregnant, a qualified healthcare provider may still provide abortion services, if they reasonably believe that the abortion is clinically appropriate in the circumstances (taking into account your physical and mental health, and overall wellbeing and the gestational age of the fetus). The practitioner must consult with another qualified healthcare provider before providing abortion services. There are a limited number of providers for late-gestation abortions, so it is likely you would need to travel to access this service. \n####  What are the different types of abortion? \nTwo different methods of abortion are used in Aotearoa New Zealand:\n  * **Medical abortion**\n  * **Surgical abortion**\n\n\nTalk to a healthcare provider as soon as you can – both procedures are more straightforward and involve less risk the earlier the abortion is completed. \n####  What is a medical abortion and how is it done? \nMedical abortion is a way to end a pregnancy by using medication. It causes your cervix to open and your uterus to contract and pass the pregnancy tissue.\n  * **Early medical abortion** is for pregnancies less than 9 to 10 weeks gestation and induces a miscarriage.\n  * **Late medical abortion**\n\n\n#### Early medical abortion\nDuring early pregnancy a medicine called mifepristone is used to block the effect of progesterone, a hormone necessary for the placenta and pregnancy to grow. After 24–48 hours, a second medicine called misoprostol orCytotec (a type of medicinecalled a prostaglandin) is given to make your womb contract and expel the pregnancy in the same way as a miscarriage. Sometimes you'll need to take a second or third dose of misoprostol to make sure the pregnancy passes. \nLike a miscarriage, there can be period-like crampy pain. You'll be given medicine to help with the pain, and wheat-packs or hot water bottles can help a lot too. There will also be bleeding that's heavier than a normal period and you may see some lighter-coloured pregnancy tissue pass. Some people can feel nauseous with misoprostol, so you may also be given anti-nausea medicine to help manage this. \nThe main advantages of early medical abortion are:\n  * it's performed early in the pregnancy\n  * it doesn't require an operation\n  * you can complete the process at home or somewhere you are comfortable.\n\n\n#### Late medical abortion\nThe same hormones can be used for an abortion much later in pregnancy, but the doses of hormones needed are higher than those used for an early medical abortion. It also takes much longer, and you need to be admitted to hospital in case you have heavy bleeding or the pregnancy tissue doesn't pass easily. \n####  What is a surgical abortion and how is it done? \nSurgical abortion is a simple procedure carried out to end a pregnancy. It is usually performed between 7 and 15 weeks of pregnancy but can be done later in some centres.\nDuring this procedure, a small tube is inserted into your uterus through your vagina and cervix. The pregnancy is then removed by gentle suction. This takes about 3–5 minutes and can usually be performed under a[local anaesthetic.](https://healthify.nz/health-a-z/a/anaesthesia \"Anaesthesia\") If the pregnancy is further on, or depending on the provider, a [general anaesthetic](https://healthify.nz/health-a-z/a/anaesthesia \"Anaesthesia\")\nRecovery after a surgical abortion is usually very quick. There is usually very little pain, and the bleeding and cramping are about the same as a period.\n####  Where does an abortion take place? \n  * An early medical abortion (in the first 9–10 weeks) usually takes place at home as long as you have access to a phone, and a way of getting to hospital if you need to in an emergency. Once you've had an appointment via [telehealth](https://healthify.nz/health-a-z/t/telehealth-faqs) at a community clinic or Sexual Wellbeing Aotearoa clinic you can collect the 2 types of medicine needed. \n  * For a later medical abortion, you will need to visit a clinic or hospital.\n  * For a surgical abortion, you'll need to visit a specialist clinic or hospital. Sometimes you need to have an appointment before you're booked in for surgery. You'll be able to go home the same day after surgery if it's done early (in the first 13–15 weeks), but you may need to stay overnight if it's done later in your pregnancy. \n  * You don't need a referral from your GP or other healthcare provider to have an abortion. You can use this link to [search for an abortion provider(external link)](https://decide.org.nz/en/find-a-provider/ \"Find an abortion provider in your area\") in your area. \n\n\n#### Does anyone else need to know?\nIt's your decision who you tell about your pregnancy or abortion, including your parents, whānau or sexual partner. Accessing an abortion is confidential, no-one will be told without your permission. It's a good idea to talk it over with someone who can support you if you feel you can. If you're having an early medical abortion at home, it's also recommended that you have a support person available throughout the process. \nRead more about [abortion and your rights(external link)](https://decide.org.nz/en/abortion-services/abortion-and-your-rights/#section_you-decide-who-knows \"Link to abortion and your rights\").\n#### Will there be protestors at the clinic or people seeing me go in?\nA law was recently passed in Aotearoa New Zealand so there are[Safe Areas(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Link to Safe Areas established for abortion services\") of up to 150 metres around some of the premises where abortion services are provided. There are currently [6 Safe Area providers(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas/safe-area-locations \"Safe Area locations NZ\") across the country. They are there to protect the safety, wellbeing, privacy and dignity of people – those who are accessing abortions or providing abortion services. This means it's illegal for anyone to:\n  * block an entrance to stop anyone entering or leaving\n  * take photos or videos that will cause distress\n  * approach you to provide information about abortion services (this doesn't include the service provider themselves)\n  * approach you to try and put you off accessing these services\n  * provide anti-abortion pamphlets or similar materials\n  * protest about matters relating to the provision of abortion services. \n\n\nIf anybody is doing any of these things within the safe area, make sure you report it to your abortion provider.\n####  What are the risks involved with an abortion? \nAbortion is a safe procedure, with fewer risks than pregnancy or childbirth. Most people have no complications during or after their abortion, however with any surgical or medical procedure there are some risks. Risks are lower for abortions at <12 weeks.\nThe most common risk for medical abortion is heavy bleeding or infection. This can be due to pregnancy tissue that hasn’t completely passed. Usually, further misoprostol (abortion medicine) or antibiotics are used to manage this. \nFor surgical abortions there's also a risk of bleeding and infection (lower than medical termination), and there's a very low risk of damage to your cervix or uterus.\nFor both procedures, there's a small chance the termination isn't successful. Further misoprostol medication or a surgical abortion will be recommended in that case. However, 99% of surgical terminations and 97–99% of medical terminations _are successful_. \nThere is no evidence to suggest that having an abortion will affect your ability to get pregnant in the future.\n####  Where can I find more information, and get support, if I am considering an abortion? \n  * If you're thinking about having an abortion, [DECIDE.org.nz(external link)](https://www.decide.org.nz/ \"Open external link\") has the information you need about abortion services, abortion care, and how to find a provider near you.\n  * Health New Zealand | Te Whatu Ora website has[information for women considering an abortion.(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\")\n  * Healthline can be contacted on 0800 611 116. This free service is available 24 hours a day, 7 days a week. They have interpreters available.\n\n\n#### Decision-making support\nFor some women, the process of thinking about and going through with an abortion can be emotionally difficult. If you are struggling in this way, it is a good idea to seek counselling and advice from a qualified therapist. Free counselling is available to anyone considering an abortion in Aotearoa New Zealand, and is also available after you've had an abortion if you need it. \nYou can contact a healthcare provider to discuss your options, including continuing a pregnancy or having an abortion, and to access counselling that is unbiased and non-judgmental.\nCounselling is not mandatory – a healthcare provider cannot insist that you have counselling before providing abortion services.  \n  \nContact the New Zealand organisation [DECIDE(external link)](https://www.decide.org.nz/ \"Open external link\")\n####  What happens to the pregnancy tissue after an abortion? \nIf you are having an abortion at home, it is common to pass the miscarriage into the toilet, but you may want to collect the tissue for burial. If you have a surgical abortion, you can choose to have the pregnancy tissue returned to you, otherwise it will be cremated by the clinic or hospital services.\nYou might choose to bury the pregnancy tissue, returning the tissue to the whenua. Your abortion provider can provide more specific instructions on how to do this safely.\n####  What should I do after an abortion? \nTake pain relief as you need it to manage cramping (paracetamol or ibuprofen) and contact your abortion provider if you feel the pain is getting worse rather than better over time.\nUse pads rather than tampons or menstrual cups, and have showers rather than baths and avoid swimming (in spas, the ocean or swimming pools) for the first couple of weeks.  \n  \nIt's best to wait at least 2 weeks after an abortion before having sexual intercourse, to reduce the risk of infection. If you do have intercourse before then, you should use a condom to decrease the chance of infection.\nUse [contraception](https://healthify.nz/health-a-z/c/contraception). This is a good time to discuss contraception and choose a method that works for you. Remember that you can still get pregnant again within 2 weeks of a termination of pregnancy.\n####  Te Tiriti o Waitangi, Māori and abortion \nIn Aotearoa New Zealand, healthcare providers actively support Māori to make decisions that are best for them, in combination with the principles of Te Tiriti o Waitangi.\nThey seek to work in partnership with Māori wahine, including your whānau if you would like. This approach aims to ensure you make decisions to enhance your rangatiratanga, and are able to exercise mana motuhake (authority) over your own body and reproductive health.\nHealthcare providers will also ensure that Māori have evidence-based information about the abortion process, so you can make decisions and preparations that will uphold your tikanga or cultural practices. Wherever the process takes place, the aim is for it to be culturally safe as defined by Māori.\n####  Healthcare provider rights and responsibilities \nSome healthcare providers (or other staff members such as receptionists) may choose not to be involved in abortion or provide any information about it due to personal beliefs. If this is the case, they must tell you how to access the contact details of the closest provider who can provide the service. If they don’t, you can [complain to the Health and Disability Commissioner.](https://healthify.nz/hauora-wellbeing/c/code-of-health-and-disability-consumers-rights \"Code of Health and Disability Consumers' Rights\")\n####  Related topics on Healthify \n[Pregnancy topics](https://healthify.nz/hauora-wellbeing/p/pregnancy \"Pregnancy topics\")  \n[Emergency contraception](https://healthify.nz/health-a-z/e/emergency-contraception \"Emergency contraception\")  \n[Overview of contraception methods | Rongoā ārai hapūtanga](https://healthify.nz/health-a-z/c/contraception \"Overview of contraception methods | Rongoā ārai hapūtanga\")  \n[Pregnancy options](https://healthify.nz/hauora-wellbeing/p/pregnancy-options)\n####  More information \n[Abortion(external link)](https://sexualwellbeing.org.nz/adv/abortion/ \"Open external link\") Sexual Wellbeing Aotearoa  \n[Abortion (termination of pregnancy)(external link)](https://info.health.nz/keeping-healthy/sexual-health/abortion/ \"Open external link\") Health New Zealand | Te Whatu Ora  \n[Pregnancy options and decision making [PDF, 121 KB]](https://healthify.nz/assets/Legacy/8368/regnancy-options-and-decision-making-te-mahoe.pdf \"Pregnancy options and decision making\") Capital and Coast DHB, NZ, 2017\nThere are several organisations that provide information about abortion services in Aotearoa New Zealand.   \n  \nNational abortion telehealth service [DECIDE NZ(external link)](https://decide.org.nz/ \"Open external link\") 0800 DECIDE (0800 332 433)  \n[Sexual Wellbeing Aotearoa(external link)](https://sexualwellbeing.org.nz/ \"Open external link\")  \n[Abortion NZ(external link)](http://abortion.org.nz/about-this-site \"Open external link\")   \n[Post-abortion support(external link)](https://www.facebook.com/pages/category/Community-Organization/Post-Abortion-Trauma-Healing-Service-571636766205216/ \"Open external link\")   \n  \nFind an[abortion service provider in your area(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas#locations \"Open external link\")\n#### References\n  1. [Considering an abortion(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\")\n  2. [What to expect(external link)](https://www.decide.org.nz/en/abortion-services/what-to-expect/ \"Open external link\") DECIDE.org.nz\n  3. [New Zealand Aotearoa abortion clinical guideline (external link)](https://www.health.govt.nz/publication/new-zealand-aotearoa-abortion-clinical-guideline \"Open external link\")Ministry of Health, NZ, 2021\n  4. [DECIDE FAQs(external link)](https://decide.org.nz/en/faqs/ \"Open external link\") DECIDE National Abortion Telehealth Service, NZ, 2023\n  5. [Safe areas(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\") Ministry of Health, NZ, 2023\n  6. [Abortion training modules 1–4(external link)](https://bpac.org.nz/ema/module1.aspx \"Open external link\") BPAC, NZ\n\n\n####  Information for healthcare providers \n#### Abortion legislation changes\nOn 24 March 2020 changes were made to the law to decriminalise abortion, better align the regulation of abortion services with other health services and modernise the legal framework for abortion services in New Zealand.\nThe abortion legislation is available on the New Zealand Legislation website.\nPlease note this amendment updates the primary legislation for abortion, set out in the Contraception, Sterilisation, and Abortion Act 1977 and the Crimes Act 1961.\nLearn more about:   \n[Abortion legislation – key changes for health practitioners(external link)(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-legislation-information-health-practitioners \"Open external link\") Ministry of Health, NZ, 2020  \n[Safe Areas locations(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas/safe-area-locations \"Safe Areas locations for abortion services\") Ministry of Health, 2023\n#### Clinical resources\n[NZ Aotearoa abortion clinical guideline(external link)](https://www.health.govt.nz/system/files/documents/publications/new_zealand_aotearoa_abortion_clinical_guideline.pdf \"Open external link\")  \n[Termination law in NZ(external link)](https://bpac.org.nz/bpj/2010/top/law.aspx \"Open external link\") BPAC, NZ, 2010  \n[The role of the GP in termination of pregnancy in NZ(external link)](https://bpac.org.nz/BPJ/2010/top/role.aspx \"Open external link\") BPAC, NZ, 2010  \n[Methods of termination of pregnancy in NZ(external link)](https://bpac.org.nz/bpj/2010/top/methods.aspx \"Open external link\") BPAC, NZ, 2010  \n[Mifegynetab(external link)](http://www.medsafe.govt.nz/profs/datasheet/m/Mifegynetab.pdf \"Open external link\")  \n[The care of women requesting induced abortion(external link)](https://www.rcog.org.uk/media/wgalpxws/abortion_guideline_summary.pdf \"Open external link\")  \n[Medical methods for first trimester abortion(external link)](http://cochranelibrary-wiley.com/doi/10.1002/14651858.CD002855.pub4/full \"Open external link\")  \n[Best practice in comprehensive abortion care(external link)](https://www.rcog.org.uk/globalassets/documents/guidelines/best-practice-papers/best-practice-paper-2.pdf \"Open external link\") Royal College of Obstetricians and Gynaecologists, UK, 2015  \n[BPAC further information on abortion services in primary care (external link)](https://bpacnz.cmail19.com/t/d-l-vjyhio-tuudvejh-jy/ \"Open external link\")BPAC, NZ, 2023\n#### Apps\n[Women's health apps](https://healthify.nz/apps/w/womens-health-apps)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/a/abortion)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/a/abortion)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Phoebe Hunt, Medical Officer, Northland\nLast reviewed: 09 Oct 2023\n![](https://healthify.nz/health-a-z/a/abortion)\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/abortion \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Abortion\n## Also known as a termination of pregnancy\n### Key points about abortion\n  * Abortion and related counselling services are free for anyone eligible to receive publicly-funded healthcare in Aotearoa New Zealand.\n  * There are 2 types of abortion available here: medical (taking pills) and surgical (a minor operation).\n  * Healthcare providers can provide abortion services up to and including 20 weeks of pregnancy. \n  * After 20 weeks, a second health practitioner is consulted, to decide if termination is clinically appropriate. \n  * If you're thinking about having an abortion, get advice and information from DECIDE (link provided below) and see a doctor or an organisation like Family Planning.\n  * It's up to you who you tell about the abortion, but having a support person can be really helpful.\n\n\n![Two women sitting on couch and talking while one comforts the other](https://healthify.nz/assets/Health-A-Z/Mental-health/Woman-comforting-friend-canva-950x690.jpg)\nQR Code\n![](https://healthify.nz/health-a-z/a/abortion)\nPrint\nOpen all Close all\n####  What are my options if I am pregnant? \n![Worried young woman looks out the window](https://healthify.nz/assets/Healthy-Living/Women/worried-young-woman-looking-out-window-Canva__ResizedImageWzYwMCw0MzZd.jpg)\nImage credit; Canva\nIf you miss a period or have pregnancy symptoms, find out as soon as possible whether you are pregnant. This will give you more time to think about your options and seek advice about how you wish to proceed. Pregnancy tests can be purchased from pharmacies and supermarkets, or you can see your healthcare provider or Sexual Wellbeing Aotearoa for an appointment.\nFinding out you are pregnant is different for everyone and how you feel about it will depend on a number of factors. There are several options available to you:\n  * **Keeping the pregnancy**\n  * **Whāngai** – the Māori tradition of a child being raised by a relative or relatives who are not the birth parents, eg, grandparents or other whānau members. \n  * **Adoption** a permanent legal agreement where the adoptive parents have full parental rights and responsibilities.\n  * **Abortion**\n\n\nDeciding what to do when you are pregnant is a very personal decision. Once you have the information you need, it is your decision to make. Learn more about[pregnancy options.](https://healthify.nz/hauora-wellbeing/p/pregnancy-options)\n####  Does it cost anything to have an abortion? \nMost abortion services and related counselling services are free in Aotearoa New Zealand to any pregnant person eligible for publicly funded healthcare. However, you may need to pay for an ultrasound scan. There are fees for abortion if you are not a New Zealand resident. Find out more about [non-resident abortion costs in New Zealand.(external link)](https://decide.org.nz/en/faqs/ \"Open external link\")\n####  When can abortions be carried out? \nA qualified healthcare provider can provide you with abortion services up to and including week 20 of your pregnancy.\nIf you are more than 20 weeks pregnant, a qualified healthcare provider may still provide abortion services, if they reasonably believe that the abortion is clinically appropriate in the circumstances (taking into account your physical and mental health, and overall wellbeing and the gestational age of the fetus). The practitioner must consult with another qualified healthcare provider before providing abortion services. There are a limited number of providers for late-gestation abortions, so it is likely you would need to travel to access this service. \n####  What are the different types of abortion? \nTwo different methods of abortion are used in Aotearoa New Zealand:\n  * **Medical abortion**\n  * **Surgical abortion**\n\n\nTalk to a healthcare provider as soon as you can – both procedures are more straightforward and involve less risk the earlier the abortion is completed. \n####  What is a medical abortion and how is it done? \nMedical abortion is a way to end a pregnancy by using medication. It causes your cervix to open and your uterus to contract and pass the pregnancy tissue.\n  * **Early medical abortion** is for pregnancies less than 9 to 10 weeks gestation and induces a miscarriage.\n  * **Late medical abortion**\n\n\n#### Early medical abortion\nDuring early pregnancy a medicine called mifepristone is used to block the effect of progesterone, a hormone necessary for the placenta and pregnancy to grow. After 24–48 hours, a second medicine called misoprostol orCytotec (a type of medicinecalled a prostaglandin) is given to make your womb contract and expel the pregnancy in the same way as a miscarriage. Sometimes you'll need to take a second or third dose of misoprostol to make sure the pregnancy passes. \nLike a miscarriage, there can be period-like crampy pain. You'll be given medicine to help with the pain, and wheat-packs or hot water bottles can help a lot too. There will also be bleeding that's heavier than a normal period and you may see some lighter-coloured pregnancy tissue pass. Some people can feel nauseous with misoprostol, so you may also be given anti-nausea medicine to help manage this. \nThe main advantages of early medical abortion are:\n  * it's performed early in the pregnancy\n  * it doesn't require an operation\n  * you can complete the process at home or somewhere you are comfortable.\n\n\n#### Late medical abortion\nThe same hormones can be used for an abortion much later in pregnancy, but the doses of hormones needed are higher than those used for an early medical abortion. It also takes much longer, and you need to be admitted to hospital in case you have heavy bleeding or the pregnancy tissue doesn't pass easily. \n####  What is a surgical abortion and how is it done? \nSurgical abortion is a simple procedure carried out to end a pregnancy. It is usually performed between 7 and 15 weeks of pregnancy but can be done later in some centres.\nDuring this procedure, a small tube is inserted into your uterus through your vagina and cervix. The pregnancy is then removed by gentle suction. This takes about 3–5 minutes and can usually be performed under a[local anaesthetic.](https://healthify.nz/health-a-z/a/anaesthesia \"Anaesthesia\") If the pregnancy is further on, or depending on the provider, a [general anaesthetic](https://healthify.nz/health-a-z/a/anaesthesia \"Anaesthesia\")\nRecovery after a surgical abortion is usually very quick. There is usually very little pain, and the bleeding and cramping are about the same as a period.\n####  Where does an abortion take place? \n  * An early medical abortion (in the first 9–10 weeks) usually takes place at home as long as you have access to a phone, and a way of getting to hospital if you need to in an emergency. Once you've had an appointment via [telehealth](https://healthify.nz/health-a-z/t/telehealth-faqs) at a community clinic or Sexual Wellbeing Aotearoa clinic you can collect the 2 types of medicine needed. \n  * For a later medical abortion, you will need to visit a clinic or hospital.\n  * For a surgical abortion, you'll need to visit a specialist clinic or hospital. Sometimes you need to have an appointment before you're booked in for surgery. You'll be able to go home the same day after surgery if it's done early (in the first 13–15 weeks), but you may need to stay overnight if it's done later in your pregnancy. \n  * You don't need a referral from your GP or other healthcare provider to have an abortion. You can use this link to [search for an abortion provider(external link)](https://decide.org.nz/en/find-a-provider/ \"Find an abortion provider in your area\") in your area. \n\n\n#### Does anyone else need to know?\nIt's your decision who you tell about your pregnancy or abortion, including your parents, whānau or sexual partner. Accessing an abortion is confidential, no-one will be told without your permission. It's a good idea to talk it over with someone who can support you if you feel you can. If you're having an early medical abortion at home, it's also recommended that you have a support person available throughout the process. \nRead more about [abortion and your rights(external link)](https://decide.org.nz/en/abortion-services/abortion-and-your-rights/#section_you-decide-who-knows \"Link to abortion and your rights\").\n#### Will there be protestors at the clinic or people seeing me go in?\nA law was recently passed in Aotearoa New Zealand so there are[Safe Areas(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Link to Safe Areas established for abortion services\") of up to 150 metres around some of the premises where abortion services are provided. There are currently [6 Safe Area providers(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas/safe-area-locations \"Safe Area locations NZ\") across the country. They are there to protect the safety, wellbeing, privacy and dignity of people – those who are accessing abortions or providing abortion services. This means it's illegal for anyone to:\n  * block an entrance to stop anyone entering or leaving\n  * take photos or videos that will cause distress\n  * approach you to provide information about abortion services (this doesn't include the service provider themselves)\n  * approach you to try and put you off accessing these services\n  * provide anti-abortion pamphlets or similar materials\n  * protest about matters relating to the provision of abortion services. \n\n\nIf anybody is doing any of these things within the safe area, make sure you report it to your abortion provider.\n####  What are the risks involved with an abortion? \nAbortion is a safe procedure, with fewer risks than pregnancy or childbirth. Most people have no complications during or after their abortion, however with any surgical or medical procedure there are some risks. Risks are lower for abortions at <12 weeks.\nThe most common risk for medical abortion is heavy bleeding or infection. This can be due to pregnancy tissue that hasn’t completely passed. Usually, further misoprostol (abortion medicine) or antibiotics are used to manage this. \nFor surgical abortions there's also a risk of bleeding and infection (lower than medical termination), and there's a very low risk of damage to your cervix or uterus.\nFor both procedures, there's a small chance the termination isn't successful. Further misoprostol medication or a surgical abortion will be recommended in that case. However, 99% of surgical terminations and 97–99% of medical terminations _are successful_. \nThere is no evidence to suggest that having an abortion will affect your ability to get pregnant in the future.\n####  Where can I find more information, and get support, if I am considering an abortion? \n  * If you're thinking about having an abortion, [DECIDE.org.nz(external link)](https://www.decide.org.nz/ \"Open external link\") has the information you need about abortion services, abortion care, and how to find a provider near you.\n  * Health New Zealand | Te Whatu Ora website has[information for women considering an abortion.(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\")\n  * Healthline can be contacted on 0800 611 116. This free service is available 24 hours a day, 7 days a week. They have interpreters available.\n\n\n#### Decision-making support\nFor some women, the process of thinking about and going through with an abortion can be emotionally difficult. If you are struggling in this way, it is a good idea to seek counselling and advice from a qualified therapist. Free counselling is available to anyone considering an abortion in Aotearoa New Zealand, and is also available after you've had an abortion if you need it. \nYou can contact a healthcare provider to discuss your options, including continuing a pregnancy or having an abortion, and to access counselling that is unbiased and non-judgmental.\nCounselling is not mandatory – a healthcare provider cannot insist that you have counselling before providing abortion services.  \n  \nContact the New Zealand organisation [DECIDE(external link)](https://www.decide.org.nz/ \"Open external link\")\n####  What happens to the pregnancy tissue after an abortion? \nIf you are having an abortion at home, it is common to pass the miscarriage into the toilet, but you may want to collect the tissue for burial. If you have a surgical abortion, you can choose to have the pregnancy tissue returned to you, otherwise it will be cremated by the clinic or hospital services.\nYou might choose to bury the pregnancy tissue, returning the tissue to the whenua. Your abortion provider can provide more specific instructions on how to do this safely.\n####  What should I do after an abortion? \nTake pain relief as you need it to manage cramping (paracetamol or ibuprofen) and contact your abortion provider if you feel the pain is getting worse rather than better over time.\nUse pads rather than tampons or menstrual cups, and have showers rather than baths and avoid swimming (in spas, the ocean or swimming pools) for the first couple of weeks.  \n  \nIt's best to wait at least 2 weeks after an abortion before having sexual intercourse, to reduce the risk of infection. If you do have intercourse before then, you should use a condom to decrease the chance of infection.\nUse [contraception](https://healthify.nz/health-a-z/c/contraception). This is a good time to discuss contraception and choose a method that works for you. Remember that you can still get pregnant again within 2 weeks of a termination of pregnancy.\n####  Te Tiriti o Waitangi, Māori and abortion \nIn Aotearoa New Zealand, healthcare providers actively support Māori to make decisions that are best for them, in combination with the principles of Te Tiriti o Waitangi.\nThey seek to work in partnership with Māori wahine, including your whānau if you would like. This approach aims to ensure you make decisions to enhance your rangatiratanga, and are able to exercise mana motuhake (authority) over your own body and reproductive health.\nHealthcare providers will also ensure that Māori have evidence-based information about the abortion process, so you can make decisions and preparations that will uphold your tikanga or cultural practices. Wherever the process takes place, the aim is for it to be culturally safe as defined by Māori.\n####  Healthcare provider rights and responsibilities \nSome healthcare providers (or other staff members such as receptionists) may choose not to be involved in abortion or provide any information about it due to personal beliefs. If this is the case, they must tell you how to access the contact details of the closest provider who can provide the service. If they don’t, you can [complain to the Health and Disability Commissioner.](https://healthify.nz/hauora-wellbeing/c/code-of-health-and-disability-consumers-rights \"Code of Health and Disability Consumers' Rights\")\n####  Related topics on Healthify \n[Pregnancy topics](https://healthify.nz/hauora-wellbeing/p/pregnancy \"Pregnancy topics\")  \n[Emergency contraception](https://healthify.nz/health-a-z/e/emergency-contraception \"Emergency contraception\")  \n[Overview of contraception methods | Rongoā ārai hapūtanga](https://healthify.nz/health-a-z/c/contraception \"Overview of contraception methods | Rongoā ārai hapūtanga\")  \n[Pregnancy options](https://healthify.nz/hauora-wellbeing/p/pregnancy-options)\n####  More information \n[Abortion(external link)](https://sexualwellbeing.org.nz/adv/abortion/ \"Open external link\") Sexual Wellbeing Aotearoa  \n[Abortion (termination of pregnancy)(external link)](https://info.health.nz/keeping-healthy/sexual-health/abortion/ \"Open external link\") Health New Zealand | Te Whatu Ora  \n[Pregnancy options and decision making [PDF, 121 KB]](https://healthify.nz/assets/Legacy/8368/regnancy-options-and-decision-making-te-mahoe.pdf \"Pregnancy options and decision making\") Capital and Coast DHB, NZ, 2017\nThere are several organisations that provide information about abortion services in Aotearoa New Zealand.   \n  \nNational abortion telehealth service [DECIDE NZ(external link)](https://decide.org.nz/ \"Open external link\") 0800 DECIDE (0800 332 433)  \n[Sexual Wellbeing Aotearoa(external link)](https://sexualwellbeing.org.nz/ \"Open external link\")  \n[Abortion NZ(external link)](http://abortion.org.nz/about-this-site \"Open external link\")   \n[Post-abortion support(external link)](https://www.facebook.com/pages/category/Community-Organization/Post-Abortion-Trauma-Healing-Service-571636766205216/ \"Open external link\")   \n  \nFind an[abortion service provider in your area(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas#locations \"Open external link\")\n#### References\n  1. [Considering an abortion(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\")\n  2. [What to expect(external link)](https://www.decide.org.nz/en/abortion-services/what-to-expect/ \"Open external link\") DECIDE.org.nz\n  3. [New Zealand Aotearoa abortion clinical guideline (external link)](https://www.health.govt.nz/publication/new-zealand-aotearoa-abortion-clinical-guideline \"Open external link\")Ministry of Health, NZ, 2021\n  4. [DECIDE FAQs(external link)](https://decide.org.nz/en/faqs/ \"Open external link\") DECIDE National Abortion Telehealth Service, NZ, 2023\n  5. [Safe areas(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\") Ministry of Health, NZ, 2023\n  6. [Abortion training modules 1–4(external link)](https://bpac.org.nz/ema/module1.aspx \"Open external link\") BPAC, NZ\n\n\n####  Information for healthcare providers \n#### Abortion legislation changes\nOn 24 March 2020 changes were made to the law to decriminalise abortion, better align the regulation of abortion services with other health services and modernise the legal framework for abortion services in New Zealand.\nThe abortion legislation is available on the New Zealand Legislation website.\nPlease note this amendment updates the primary legislation for abortion, set out in the Contraception, Sterilisation, and Abortion Act 1977 and the Crimes Act 1961.\nLearn more about:   \n[Abortion legislation – key changes for health practitioners(external link)(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-legislation-information-health-practitioners \"Open external link\") Ministry of Health, NZ, 2020  \n[Safe Areas locations(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas/safe-area-locations \"Safe Areas locations for abortion services\") Ministry of Health, 2023\n#### Clinical resources\n[NZ Aotearoa abortion clinical guideline(external link)](https://www.health.govt.nz/system/files/documents/publications/new_zealand_aotearoa_abortion_clinical_guideline.pdf \"Open external link\")  \n[Termination law in NZ(external link)](https://bpac.org.nz/bpj/2010/top/law.aspx \"Open external link\") BPAC, NZ, 2010  \n[The role of the GP in termination of pregnancy in NZ(external link)](https://bpac.org.nz/BPJ/2010/top/role.aspx \"Open external link\") BPAC, NZ, 2010  \n[Methods of termination of pregnancy in NZ(external link)](https://bpac.org.nz/bpj/2010/top/methods.aspx \"Open external link\") BPAC, NZ, 2010  \n[Mifegynetab(external link)](http://www.medsafe.govt.nz/profs/datasheet/m/Mifegynetab.pdf \"Open external link\")  \n[The care of women requesting induced abortion(external link)](https://www.rcog.org.uk/media/wgalpxws/abortion_guideline_summary.pdf \"Open external link\")  \n[Medical methods for first trimester abortion(external link)](http://cochranelibrary-wiley.com/doi/10.1002/14651858.CD002855.pub4/full \"Open external link\")  \n[Best practice in comprehensive abortion care(external link)](https://www.rcog.org.uk/globalassets/documents/guidelines/best-practice-papers/best-practice-paper-2.pdf \"Open external link\") Royal College of Obstetricians and Gynaecologists, UK, 2015  \n[BPAC further information on abortion services in primary care (external link)](https://bpacnz.cmail19.com/t/d-l-vjyhio-tuudvejh-jy/ \"Open external link\")BPAC, NZ, 2023\n#### Apps\n[Women's health apps](https://healthify.nz/apps/w/womens-health-apps)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\n[ Share on facebook ](https://facebook.com/sharer/sharer.php?u=https://healthify.nz/health-a-z/a/abortion)\nEmail\n[ Share on Linked In ](https://www.linkedin.com/sharing/share-offsite/?url=https://healthify.nz/health-a-z/a/abortion)\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Phoebe Hunt, Medical Officer, Northland\nLast reviewed: 09 Oct 2023\n![](https://healthify.nz/health-a-z/a/abortion)\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/abortion \n![image](https://healthify.nz/assets/Uploads/image.png)\n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-04T02:56:26.550956Z",
    "letter": "a",
    "slug": "abortion"
  }
}