{
  "url": "https://healthify.nz/health-a-z/a/af/",
  "title": "Af",
  "markdown": "# Atrial fibrillation | Manawa tukituki\n## Also known as irregular heart beat\n### Key points about atrial fibrillation\n  * Atrial fibrillation (manawa tukituki) is a condition that affects the heart, causing a fast and irregular heart beat.\n  * This is known as a heart rhythm disorder (arrhythmia).\n  * It can lead to other problems such as stroke and heart failure.\n  * If you notice your pulse seems irregular, see your doctor.\n  * Atrial fibrillation (AF) is more common as we get older, so see your doctor for regular blood pressure and pulse checks.\n  * If you do have atrial fibrillation, take your medication regularly.\n  * With treatment and lifestyle management, you can continue with an active happy life.\n\n\n![Man holds up happy laughing baby in the air](https://healthify.nz/assets/Maori-and-Pasifika-people-/man-holds-up-happy-baby-Canva.jpg)\nQR Code Print\n####  What is atrial fibrillation? (+ VIDEO) \nAtrial fibrillation is a heart condition where your heart has a fast and irregular beat. You may be aware of your heart pounding or fluttering. It's a heart rhythm disorder and is more common in older adults. Because it affects how your heart pumps, it can make you feel tired, dizzy or lightheaded. \nIf you notice your heart has an irregular beat (an arrhythmia) it's important not to ignore it and to see a healthcare provider as atrial fibrillation can increase your risk of stroke or heart failure.\n#### Video: What is atrial fibrillation?\n(British Heart Foundation, UK, 2015)\n####  What causes atrial fibrillation? \nNormally, your heart beats about 60 to 100 beats per minute when you are at rest, or doing light activities. Usually all of the heart chambers work together in unison. If you have atrial fibrillation (AF), the electrical signals that control your heartbeat are abnormal. These signals cause the upper chambers of your heart (the atria) to beat unevenly and very quickly. In fact, the atria are racing so quickly that the lower heart chambers (the ventricles) can’t quite keep up, and so your heart doesn’t beat in the usual, coordinated way.\nThis results in an irregular and rapid heart rate, often ranging from 100 to 180 beats per minute. When this happens, the heart cannot pump blood around the body as well as it needs to.\n#### There are three different kinds of atrial fibrillation:\n  * **Paroxysmal AF**\n  * **Persistent AF**\n  * **Long-standing persistent or permanent AF**\n\n\nAF is a progressive disease, so it is not uncommon for people with paroxysmal AF to develop persistent or permanent AF over time. \n####  Who is at risk of AF? \nThe causes of atrial fibrillation are not always clear. However, there are a number of things that increase your risk of developing AF. Risk factors include:\n  * age – AF can affect adults at any age, but it is more common as people get older, particularly over 65 years\n  * [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high)\n  * heart disease like coronary artery disease or heart valve disease or heart failure\n  * heart attack\n  * being overweight or obese\n  * chronic obstructive pulmonary disease ([COPD](https://healthify.nz/health-a-z/c/copd \"COPD\"))\n  * diabetes\n  * drinking large amounts of alcohol over a long period of time\n  * genetics – atrial fibrillation can sometimes run in families\n  * overactive thyroid gland\n  * lung infections such as pneumonia\n  * [sleep apnoea.](https://healthify.nz/health-a-z/o/obstructive-sleep-apnoea \"Obstructive sleep apnoea\")\n\n\n####  What are the risks associated with AF? \nHaving AF puts you at higher risk of some serious conditions compared to people without AF. For example,\n  * you are 4–5 times more likely to have a[stroke](https://healthify.nz/health-a-z/s/stroke \"Stroke\")\n  * you are 3 times more likely develop[heart failure](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n  * you are also more likely to have a heart attack or get [dementia.](https://healthify.nz/health-a-z/d/dementia \"Dementia\")\n\n\nTo reduce these risks it is important to treat your AF, even if you don't have AF symptoms (see below).\n### How does AF cause stroke?\nBecause the atria are beating unevenly and very quickly, they don’t pump blood through the heart properly. Blood can then pool in the heart and a blood clot may form. If the clot breaks loose and leaves the heart, it can travel via your blood vessels to other organs in your body. If a clot lodges in a blood vessel that supplies your brain and cuts off the blood supply, it causes a stroke. Read more about[stroke.](https://healthify.nz/health-a-z/s/stroke \"Stroke\")\n### How does AF cause heart failure?\nUncontrolled or very fast AF can put strain on your heart and cause it to weaken. This can cause heart failure. This is a condition when the heart is unable to effectively pump blood around the body. Read more about [heart failure.](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n####  What are the symptoms of AF? \nIf you have AF, you may experience palpitations (an awareness of your heart beating or pounding in your chest). Other symptoms include:\n  * chest pain\n  * dizziness\n  * light-headedness\n  * shortness of breath\n  * fatigue and tiredness.\n\n\nSome people have no symptoms at all, and AF is only detected after a healthcare provider checks your pulse and finds it is irregular.\n![](https://healthify.nz/assets/Legacy/9529/atrial-fibrillation-665x443__ResizedImageWzYwMCw0MDBd.jpg)   \n_Image credit: Alila Medical Media / 123RF_\n####  Is an irregular pulse always due to AF? \nOccasional missed beats or extra beats between regular beats are very common and usually nothing to worry about, but best discussed with your doctor. AF, on the other hand, has no pattern to it at all and is continuously irregular.\n####  Take a test to check your pulse \nA quick guide from the British Heart Foundation:\n  1. Put one of your hands out so you’re looking at your palm.\n  2. Use the index/first finger and middle finger of your other hand and place the pads of these fingers on the inside of your wrist. You should place them at the base of your thumb near where the strap of a watch would sit.\n  3. Press lightly and feel the pulse. If you can’t feel anything press slightly harder or move your fingers around until you feel your pulse.\n  4. Once you’ve found your pulse, continue to feel it for about 20-30 seconds. Feel the rhythm of the pulse and check if it’s regular or irregular.\n\n\nListen to these examples or regular and irregular pulse rhythms from the British Heart Foundation.\n  * [Regular pulse rhythm(external link)(external link)](http://soundcloud.com/bhf/heartbeatreg \"Open external link\")\n  * [Irregular pulse rhythm(external link)(external link)](http://soundcloud.com/bhf/heartbeatirreg \"Open external link\")\n\n\n####  How is AF diagnosed? \nIf you or your doctor thinks you have AF, they may check your pulse, blood pressure, how well hydrated you are and your temperature. They may do a blood test.  \n  \nAF is diagnosed using a simple, painless test called an[electrocardiograph (ECG).](https://healthify.nz/health-a-z/e/electrocardiograph-ecg \"Electrocardiograph \\(ECG\\)\")\n  * When you have an ECG, small patches connected to wires (electrodes) are placed on your chest to measure the electrical impulses given off by your heart.\n  * These electrical impulses are recorded on a piece of paper called an ECG strip.\n  * The abnormal pattern of electrical impulses seen in people with AF is easily detected by the ECG.\n\n\nHowever, if you have paroxysmal AF (episodes that come and then go away), your heartbeat may be normal at the time the ECG is recorded. To detect paroxysmal AF, you may need to have a special test called a Holter monitor test.\n  * A Holter monitor is a portable device that you wear under your clothes.\n  * It continuously records your heart's electrical impulses for at least 24 hours.\n\n\nAF can also be diagnosed using other electrical devices such as KardiaMobile, an Apple Watch or a wearable ambulatory ECG monitor. \nIf you have AF it's likely you'll need an [echocardiogram](https://healthify.nz/health-a-z/e/echocardiogram) (heart ultrasound) to decide on the best treatment.\n####  What are the treatment options for AF? \nThe treatment for AF varies from person to person depending on a number of factors. Treatment will depend on the severity of your symptoms, the cause and duration of your AF, and whether you have any underlying health problems. The main aims of treatment are to:\n  * prevent blood clots, therefore lowering your risk of having a stroke\n  * control your heart rate to restore a normal heart rhythm\n  * manage any elated problems or risks.\n\n\n####    \nMedication\n**Blood clot prevention**\nHaving AF puts you at high risk of having a stroke due to a blood clot lodging in a blood vessel that supplies your brain. So, preventing blood clots is one of the most important parts of treating AF.  \n  \nTo prevent blood clots, you may be prescribed a type of medicine called an anticoagulant such as[warfarin,](https://healthify.nz/medicines-a-z/w/warfarin \"Warfarin\") [dabigatran](https://healthify.nz/medicines-a-z/d/dabigatran \"Dabigatran\") or[rivaroxaban.](https://healthify.nz/medicines-a-z/r/rivaroxaban \"Rivaroxaban\") Anticoagulants are medicines that prevent blood clots from forming and stop existing clots from growing bigger. Because anticoagulants stop blood clots, they may cause bleeding. Your doctor will consider your risk of bleeding and whether anticoagulants are suitable for you. Read more about[anticoagulants](https://healthify.nz/medicines-a-z/a/anticoagulants-and-antiplatelets \"Anticoagulants\")preventing blood clots in people with AF.\n**Rate control**\nYou may be prescribed medicines to slow down the rate (speed) of your heart beating to a normal level. Medicines used to control heart rate include groups of medicines called beta blockers (eg,[metoprolol,](https://healthify.nz/medicines-a-z/m/metoprolol \"Metoprolol\") [bisoprolol](https://healthify.nz/medicines-a-z/b/bisoprolol \"Bisoprolol\") and[carvedilol](https://healthify.nz/medicines-a-z/c/carvedilol \"Carvedilol\")), alcium channel blockers ([diltiazem](https://healthify.nz/medicines-a-z/d/diltiazem \"Diltiazem\")[verapamil](https://healthify.nz/medicines-a-z/v/verapamil \"Verapamil\")) or [digoxin.](https://healthify.nz/medicines-a-z/v/verapamil \"Verapamil\")\n**Rhythm control**\nIf you are not doing so well on the usual rate control medicines, there are some other medication options, eg, [amiodarone,](https://healthify.nz/medicines-a-z/a/amiodarone \"Amiodarone\") sotalol and[flecainide.](https://healthify.nz/medicines-a-z/f/flecainide \"Flecainide\")\n**Related problems**\nYou may need treatment for [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high) or [heart failure](https://healthify.nz/health-a-z/h/heart-failure) which can happen with AF.\n####    \nOther treatment options\nInstead of medicines, there are other options that your healthcare provider or cardiologist might recommend for you which can restore your heart to a normal rate and rhythm. These procedures are usually done in hospital.\n  * **Electrical cardioversion** is sometimes recommended to treat fast or irregular heartbeat. It involves the use of low-energy electrical shocks to trigger your heart into a normal rhythm. It is performed under a general anaesthetic.\n  * **Catheter ablation** is a more invasive method that may be used to restore a normal heart rhythm. In this procedure, a catheter (a long, thin tube) is inserted into a vein in the leg or arm and threaded all the way to the heart. Radio wave energy is used to damage the small portion of tissue responsible for the abnormal electrical signals.\n  * **Pacemakers** help maintain a normal heart rhythm. They are used for people with AF that has not been effectively treated with less invasive treatments. Before inserting a pacemaker, catheter ablation is used to destroy the atrioventricular (AV) node in the heart. The AV node is a part of the electrical control system of the heart that coordinates the atrial and ventricular chambers. The pacemaker takes over the role of the AV node in maintaining a normal heart rhythm.\n  * **Heart surgery** is very rarely required. The most common operation performed is known as the maze procedure, where a number of small incisions are made in the atria (upper chambers) of the heart to create a pattern of scar tissue. The scar tissue (which doesn't carry electrical currents) prevents the abnormal electrical signals that cause AF from travelling through your heart and causing an abnormal heartbeat.\n\n\n[Obstructive sleep apnoea](https://healthify.nz/health-a-z/o/obstructive-sleep-apnoea) and increased body weight can be related to AF, so your healthcare provider may ask about symptoms and management of these too.\n####  How can I look after myself if I have AF? (+ APPS) \nAtrial fibrillation can’t always be prevented but lifestyle changes can help control the level of AF symptoms you experience. \n  * Have enough rest and sleep. Tiredness and fatigue is a common trigger for AF.\n  * Reduce the amount of alcohol you drink or avoid alcohol. Drinking alcohol can trigger or worsen symptoms because alcohol can affect your heart’s electrical signals.\n  * Be aware of unhelpful ‘stressors’ in your life and take steps to address these.\n  * Know how to manage any periods of anxiety.\n  * Reduce caffeine intake as it can trigger AF symptoms.\n  * Quit smoking as it can aggravate AF and is also a risk factor for heart attacks and stroke.\n  * Medications. Talk to your pharmacist or doctor before buying any over the counter medicines, complementary medicines or supplements as some can trigger AF symptoms.\n  * Exercise. Some exercises can trigger symptoms of AF. Find out more about how to stay safe while exercising with AF (see below). \n\n\nThe Heart Foundation has more information on[adjusting to life with AF.(external link)(external link)](https://www.heartfoundation.org.nz/your-heart/hearthelp/atrial-fibrillation/living-with-af \"Open external link\").\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps), [Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps), [Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps), [Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps) and [Stroke apps](https://healthify.nz/apps/s/stroke-apps).\n####  VIDEOS: Personal stories \nStories of people living with atrial fibrillation.\n#### Video: Personal story: living with atrial fibrillation\nIn this video young dad Sela Alo talks about living with atrial fibrillation and how the diagnosis revealed his larger heart problem of mitral valve regurgitation. This video may take a few moments to load.\n(Heart Foundation NZ, 2017)\n#### Video: Personal story: a series of videos\nIn this series of videos, Nikki talks about her journey with atrial fibrillation. This video may take a few moments to load.\n(Heart Foundation NZ, 2018)\nFind more personal stories at[the Heart Foundation website.(external link)](https://www.heartfoundation.org.nz/journeys \"Open external link\")\n####  Related topics on Healthify \n[Heart risk assessment](https://healthify.nz/health-a-z/h/heart-risk-assessment \"Heart risk assessment\")  \n[Heart attack | Hē manawa](https://healthify.nz/health-a-z/h/heart-attack \"Heart attack | Hē manawa\")  \n[Stroke | Mate rehu ohotata](https://healthify.nz/health-a-z/s/stroke \"Stroke | Mate rehu ohotata\")  \n[Heart failure | Manawa ngoikore](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure | Manawa ngoikore\")  \n[Pacemaker | Pūrere whakakapa manawa](https://healthify.nz/health-a-z/p/pacemaker \"Pacemaker | Pūrere whakakapa manawa\")  \n[Anticoagulants](https://healthify.nz/medicines-a-z/a/anticoagulants-and-antiplatelets \"Anticoagulants\")  \n[Beta blockers](https://healthify.nz/medicines-a-z/b/beta-blockers \"Beta blockers\")  \n[Calcium channel blockers](https://healthify.nz/medicines-a-z/c/calcium-channel-blockers \"Calcium channel blockers\")  \n[Digoxin](https://healthify.nz/medicines-a-z/d/digoxin \"Digoxin\")\n####  More information \n[Atrial fibrillation(external link)(external link)](https://www.heartfoundation.org.nz/your-heart/heart-conditions/atrial-fibrillation \"Open external link\")Heart Foundation, NZ  \n[Understanding your pulse (heart rate)(external link)(external link)](https://www.heartfoundation.org.nz/wellbeing/managing-risk/how-to-check-your-pulse-heart-rate \"Open external link\") Heart Foundation, NZ  \n[Atrial fibrillation(external link)(external link)](https://www.nhs.uk/conditions/atrial-fibrillation/ \"Open external link\") NHS, UK  \n[Arrhythmias – normal heartbeat animation(external link)(external link)](http://watchlearnlive.heart.org/CVML_Player.php?moduleSelect=arrhyt \"Open external link\") Watch, learn, live – interactive cardiovascular library – American Heart Association  \n[Atrial fibrillation – conduction system of the heart(external link)(external link)](http://watchlearnlive.heart.org/CVML_Player.php?moduleSelect=atrfib \"Open external link\") Watch, learn, live – interactive cardiovascular library – American Heart Association  \n[Exercising with AF(external link)(external link)](https://www.bhf.org.uk/informationsupport/heart-matters-magazine/activity/exercise-and-atrial-fibrillation \"Open external link\") British Heart Foundation, UK  \n[Staying well with atrial fibrillation(external link)](https://www.heartfoundation.org.nz/your-heart/hearthelp/atrial-fibrillation \"Open external link\") Heart Foundation, NZ\n####    \nApps\n[Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps)  \n[Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps)  \n[Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps)  \n[Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps)  \n[Stroke apps](https://healthify.nz/apps/s/stroke-riskometer-app)  \n  \n\n#### References\n  1. [An update on managing patients with atrial fibrillation(external link)](https://bpac.org.nz/2017/af.aspx \"Open external link\")\n  2. [Management of arrhythmias(external link)](https://nzf.org.nz/nzf_1073 \"Open external link\")\n  3. [Atrial fibrillation(external link)](https://www.nhlbi.nih.gov/health-topics/atrial-fibrillation \"Open external link\")\n  4. [How to check your pulse(external link)](https://www.bhf.org.uk/informationsupport/tests/checking-your-pulse \"Open external link\") British Heart Foundation, UK\n  5. [Atrial fibrillation(external link)](https://3d.communityhealthpathways.org/index.htm?toc.htm?25271.htm \"Open external link\")\n  6. Van Gelder IC, Rienstra M, Bunting KV et al. [2024 ESC Guidelines for the management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS): Developed by the task force for the management of atrial fibrillation of the European Society of Cardiology (ESC), with the special contribution of the European Heart Rhythm Association (EHRA) of the ESC. (external link)](https://academic.oup.com/eurheartj/article/45/36/3314/7738779?login=false \"Open external link\")[Endorsed by the European Stroke Organisation (ESO)(external link)](https://academic.oup.com/eurheartj/article/45/36/3314/7738779?login=false \"Open external link\") Eur. Heart J. 2024;45(36): 3314–3414\n\n\n####  Information for healthcare providers \n#### Tools\n**CHA2DS2-VASc Score  \n** Estimates stroke risk in patients with atrial fibrillation. Use online calculator [www.chadsvasc.org(external link)](https://www.chadsvasc.org/ \"Open external link\")\n**HAS-BLED Score for major bleeding risk  \n** Estimates risk of major bleeding for patients on anticoagulation to assess risk-benefit in atrial fibrillation care. Use the online calculator from [MD Calc website(external link)](https://www.mdcalc.com/has-bled-score-major-bleeding-risk \"Open external link\").\n**AF Electronic Decision Support Tool BPAC  \n**[The AF decision support(external link)](https://bpac.org.nz/b-safe/ \"Open external link\") is quick to use, providing an individualised check list for anticoagulation, steps to reduce bleeding risk, and advice on heart rate control and overall cardiovascular risk management.**  \n**\n#### Resources\n  * National Heart Foundation of Australia and the Cardiac Society of Australia and NZ. [Australian clinical guidelines for the diagnosis and management of atrial fibrillation 2018(external link)](https://www.heartlungcirc.org/article/S1443-9506%2818%2931778-5/pdf \"Open external link\") Heart, Lung and Circulation 2018;27:1209-1266. \n  * [2020 European Society of Cardiology AF guidelines(external link)](https://academic.oup.com/eurheartj/article/42/5/373/5899003 \"Open external link\") 2021\n  * [Atrial fibrillation – diagnosis and management(external link)](https://www.nice.org.uk/guidance/ng196/chapter/Recommendations \"Open external link\") NICE, UK \n  * [An update on managing patients with atrial fibrillation(external link)](https://bpac.org.nz/2017/af.aspx \"Open external link\") BPAC, NZ, 2017\n  * [Management of arrhythmias(external link)](https://nzf.org.nz/nzf_1073 \"Open external link\") NZ Formulary \n  * [Atrial fibrillation(external link)](https://bpac.org.nz/b-quick/af.aspx \"Open external link\") B-QuiCK Bpac, NZ\n\n\n#### Webinars\n[Stop the clot! AF and stroke prevention – Dr Ralph Stewart (external link)](https://youtu.be/2cFoOM3LbQg \"Open external link\")Goodfellow Unit Webinar, NZ, 2020  \n[Atrial fibrillation and its management – Prof. Gerry Devlin (external link)](https://youtu.be/NremGNdaRUw \"Open external link\")PHARMAC Seminars, NZ, 2019  \n[Goodfellow unit webinar – atrial fibrillation(external link)](https://youtu.be/3ycpw007ztQ \"Open external link\") Goodfellow Unit Webinar, NZ, 2017\n#### Apps\n[Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps)  \n[Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps)  \n[Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps)  \n[Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps)  \n[Stroke apps](https://healthify.nz/apps/s/stroke-apps)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Associate Professor Sue Wells, Public Health Physician, University of Auckland\nLast reviewed: 09 Nov 2022\nPage last updated: 28 Jan 2025\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/atrial-fibrillation \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Atrial fibrillation | Manawa tukituki\n## Also known as irregular heart beat\n### Key points about atrial fibrillation\n  * Atrial fibrillation (manawa tukituki) is a condition that affects the heart, causing a fast and irregular heart beat.\n  * This is known as a heart rhythm disorder (arrhythmia).\n  * It can lead to other problems such as stroke and heart failure.\n  * If you notice your pulse seems irregular, see your doctor.\n  * Atrial fibrillation (AF) is more common as we get older, so see your doctor for regular blood pressure and pulse checks.\n  * If you do have atrial fibrillation, take your medication regularly.\n  * With treatment and lifestyle management, you can continue with an active happy life.\n\n\n![Man holds up happy laughing baby in the air](https://healthify.nz/assets/Maori-and-Pasifika-people-/man-holds-up-happy-baby-Canva.jpg)\nQR Code Print\n####  What is atrial fibrillation? (+ VIDEO) \nAtrial fibrillation is a heart condition where your heart has a fast and irregular beat. You may be aware of your heart pounding or fluttering. It's a heart rhythm disorder and is more common in older adults. Because it affects how your heart pumps, it can make you feel tired, dizzy or lightheaded. \nIf you notice your heart has an irregular beat (an arrhythmia) it's important not to ignore it and to see a healthcare provider as atrial fibrillation can increase your risk of stroke or heart failure.\n#### Video: What is atrial fibrillation?\n(British Heart Foundation, UK, 2015)\n####  What causes atrial fibrillation? \nNormally, your heart beats about 60 to 100 beats per minute when you are at rest, or doing light activities. Usually all of the heart chambers work together in unison. If you have atrial fibrillation (AF), the electrical signals that control your heartbeat are abnormal. These signals cause the upper chambers of your heart (the atria) to beat unevenly and very quickly. In fact, the atria are racing so quickly that the lower heart chambers (the ventricles) can’t quite keep up, and so your heart doesn’t beat in the usual, coordinated way.\nThis results in an irregular and rapid heart rate, often ranging from 100 to 180 beats per minute. When this happens, the heart cannot pump blood around the body as well as it needs to.\n#### There are three different kinds of atrial fibrillation:\n  * **Paroxysmal AF**\n  * **Persistent AF**\n  * **Long-standing persistent or permanent AF**\n\n\nAF is a progressive disease, so it is not uncommon for people with paroxysmal AF to develop persistent or permanent AF over time. \n####  Who is at risk of AF? \nThe causes of atrial fibrillation are not always clear. However, there are a number of things that increase your risk of developing AF. Risk factors include:\n  * age – AF can affect adults at any age, but it is more common as people get older, particularly over 65 years\n  * [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high)\n  * heart disease like coronary artery disease or heart valve disease or heart failure\n  * heart attack\n  * being overweight or obese\n  * chronic obstructive pulmonary disease ([COPD](https://healthify.nz/health-a-z/c/copd \"COPD\"))\n  * diabetes\n  * drinking large amounts of alcohol over a long period of time\n  * genetics – atrial fibrillation can sometimes run in families\n  * overactive thyroid gland\n  * lung infections such as pneumonia\n  * [sleep apnoea.](https://healthify.nz/health-a-z/o/obstructive-sleep-apnoea \"Obstructive sleep apnoea\")\n\n\n####  What are the risks associated with AF? \nHaving AF puts you at higher risk of some serious conditions compared to people without AF. For example,\n  * you are 4–5 times more likely to have a[stroke](https://healthify.nz/health-a-z/s/stroke \"Stroke\")\n  * you are 3 times more likely develop[heart failure](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n  * you are also more likely to have a heart attack or get [dementia.](https://healthify.nz/health-a-z/d/dementia \"Dementia\")\n\n\nTo reduce these risks it is important to treat your AF, even if you don't have AF symptoms (see below).\n### How does AF cause stroke?\nBecause the atria are beating unevenly and very quickly, they don’t pump blood through the heart properly. Blood can then pool in the heart and a blood clot may form. If the clot breaks loose and leaves the heart, it can travel via your blood vessels to other organs in your body. If a clot lodges in a blood vessel that supplies your brain and cuts off the blood supply, it causes a stroke. Read more about[stroke.](https://healthify.nz/health-a-z/s/stroke \"Stroke\")\n### How does AF cause heart failure?\nUncontrolled or very fast AF can put strain on your heart and cause it to weaken. This can cause heart failure. This is a condition when the heart is unable to effectively pump blood around the body. Read more about [heart failure.](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n####  What are the symptoms of AF? \nIf you have AF, you may experience palpitations (an awareness of your heart beating or pounding in your chest). Other symptoms include:\n  * chest pain\n  * dizziness\n  * light-headedness\n  * shortness of breath\n  * fatigue and tiredness.\n\n\nSome people have no symptoms at all, and AF is only detected after a healthcare provider checks your pulse and finds it is irregular.\n![](https://healthify.nz/assets/Legacy/9529/atrial-fibrillation-665x443__ResizedImageWzYwMCw0MDBd.jpg)   \n_Image credit: Alila Medical Media / 123RF_\n####  Is an irregular pulse always due to AF? \nOccasional missed beats or extra beats between regular beats are very common and usually nothing to worry about, but best discussed with your doctor. AF, on the other hand, has no pattern to it at all and is continuously irregular.\n####  Take a test to check your pulse \nA quick guide from the British Heart Foundation:\n  1. Put one of your hands out so you’re looking at your palm.\n  2. Use the index/first finger and middle finger of your other hand and place the pads of these fingers on the inside of your wrist. You should place them at the base of your thumb near where the strap of a watch would sit.\n  3. Press lightly and feel the pulse. If you can’t feel anything press slightly harder or move your fingers around until you feel your pulse.\n  4. Once you’ve found your pulse, continue to feel it for about 20-30 seconds. Feel the rhythm of the pulse and check if it’s regular or irregular.\n\n\nListen to these examples or regular and irregular pulse rhythms from the British Heart Foundation.\n  * [Regular pulse rhythm(external link)(external link)](http://soundcloud.com/bhf/heartbeatreg \"Open external link\")\n  * [Irregular pulse rhythm(external link)(external link)](http://soundcloud.com/bhf/heartbeatirreg \"Open external link\")\n\n\n####  How is AF diagnosed? \nIf you or your doctor thinks you have AF, they may check your pulse, blood pressure, how well hydrated you are and your temperature. They may do a blood test.  \n  \nAF is diagnosed using a simple, painless test called an[electrocardiograph (ECG).](https://healthify.nz/health-a-z/e/electrocardiograph-ecg \"Electrocardiograph \\(ECG\\)\")\n  * When you have an ECG, small patches connected to wires (electrodes) are placed on your chest to measure the electrical impulses given off by your heart.\n  * These electrical impulses are recorded on a piece of paper called an ECG strip.\n  * The abnormal pattern of electrical impulses seen in people with AF is easily detected by the ECG.\n\n\nHowever, if you have paroxysmal AF (episodes that come and then go away), your heartbeat may be normal at the time the ECG is recorded. To detect paroxysmal AF, you may need to have a special test called a Holter monitor test.\n  * A Holter monitor is a portable device that you wear under your clothes.\n  * It continuously records your heart's electrical impulses for at least 24 hours.\n\n\nAF can also be diagnosed using other electrical devices such as KardiaMobile, an Apple Watch or a wearable ambulatory ECG monitor. \nIf you have AF it's likely you'll need an [echocardiogram](https://healthify.nz/health-a-z/e/echocardiogram) (heart ultrasound) to decide on the best treatment.\n####  What are the treatment options for AF? \nThe treatment for AF varies from person to person depending on a number of factors. Treatment will depend on the severity of your symptoms, the cause and duration of your AF, and whether you have any underlying health problems. The main aims of treatment are to:\n  * prevent blood clots, therefore lowering your risk of having a stroke\n  * control your heart rate to restore a normal heart rhythm\n  * manage any elated problems or risks.\n\n\n####    \nMedication\n**Blood clot prevention**\nHaving AF puts you at high risk of having a stroke due to a blood clot lodging in a blood vessel that supplies your brain. So, preventing blood clots is one of the most important parts of treating AF.  \n  \nTo prevent blood clots, you may be prescribed a type of medicine called an anticoagulant such as[warfarin,](https://healthify.nz/medicines-a-z/w/warfarin \"Warfarin\") [dabigatran](https://healthify.nz/medicines-a-z/d/dabigatran \"Dabigatran\") or[rivaroxaban.](https://healthify.nz/medicines-a-z/r/rivaroxaban \"Rivaroxaban\") Anticoagulants are medicines that prevent blood clots from forming and stop existing clots from growing bigger. Because anticoagulants stop blood clots, they may cause bleeding. Your doctor will consider your risk of bleeding and whether anticoagulants are suitable for you. Read more about[anticoagulants](https://healthify.nz/medicines-a-z/a/anticoagulants-and-antiplatelets \"Anticoagulants\")preventing blood clots in people with AF.\n**Rate control**\nYou may be prescribed medicines to slow down the rate (speed) of your heart beating to a normal level. Medicines used to control heart rate include groups of medicines called beta blockers (eg,[metoprolol,](https://healthify.nz/medicines-a-z/m/metoprolol \"Metoprolol\") [bisoprolol](https://healthify.nz/medicines-a-z/b/bisoprolol \"Bisoprolol\") and[carvedilol](https://healthify.nz/medicines-a-z/c/carvedilol \"Carvedilol\")), alcium channel blockers ([diltiazem](https://healthify.nz/medicines-a-z/d/diltiazem \"Diltiazem\")[verapamil](https://healthify.nz/medicines-a-z/v/verapamil \"Verapamil\")) or [digoxin.](https://healthify.nz/medicines-a-z/v/verapamil \"Verapamil\")\n**Rhythm control**\nIf you are not doing so well on the usual rate control medicines, there are some other medication options, eg, [amiodarone,](https://healthify.nz/medicines-a-z/a/amiodarone \"Amiodarone\") sotalol and[flecainide.](https://healthify.nz/medicines-a-z/f/flecainide \"Flecainide\")\n**Related problems**\nYou may need treatment for [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high) or [heart failure](https://healthify.nz/health-a-z/h/heart-failure) which can happen with AF.\n####    \nOther treatment options\nInstead of medicines, there are other options that your healthcare provider or cardiologist might recommend for you which can restore your heart to a normal rate and rhythm. These procedures are usually done in hospital.\n  * **Electrical cardioversion** is sometimes recommended to treat fast or irregular heartbeat. It involves the use of low-energy electrical shocks to trigger your heart into a normal rhythm. It is performed under a general anaesthetic.\n  * **Catheter ablation** is a more invasive method that may be used to restore a normal heart rhythm. In this procedure, a catheter (a long, thin tube) is inserted into a vein in the leg or arm and threaded all the way to the heart. Radio wave energy is used to damage the small portion of tissue responsible for the abnormal electrical signals.\n  * **Pacemakers** help maintain a normal heart rhythm. They are used for people with AF that has not been effectively treated with less invasive treatments. Before inserting a pacemaker, catheter ablation is used to destroy the atrioventricular (AV) node in the heart. The AV node is a part of the electrical control system of the heart that coordinates the atrial and ventricular chambers. The pacemaker takes over the role of the AV node in maintaining a normal heart rhythm.\n  * **Heart surgery** is very rarely required. The most common operation performed is known as the maze procedure, where a number of small incisions are made in the atria (upper chambers) of the heart to create a pattern of scar tissue. The scar tissue (which doesn't carry electrical currents) prevents the abnormal electrical signals that cause AF from travelling through your heart and causing an abnormal heartbeat.\n\n\n[Obstructive sleep apnoea](https://healthify.nz/health-a-z/o/obstructive-sleep-apnoea) and increased body weight can be related to AF, so your healthcare provider may ask about symptoms and management of these too.\n####  How can I look after myself if I have AF? (+ APPS) \nAtrial fibrillation can’t always be prevented but lifestyle changes can help control the level of AF symptoms you experience. \n  * Have enough rest and sleep. Tiredness and fatigue is a common trigger for AF.\n  * Reduce the amount of alcohol you drink or avoid alcohol. Drinking alcohol can trigger or worsen symptoms because alcohol can affect your heart’s electrical signals.\n  * Be aware of unhelpful ‘stressors’ in your life and take steps to address these.\n  * Know how to manage any periods of anxiety.\n  * Reduce caffeine intake as it can trigger AF symptoms.\n  * Quit smoking as it can aggravate AF and is also a risk factor for heart attacks and stroke.\n  * Medications. Talk to your pharmacist or doctor before buying any over the counter medicines, complementary medicines or supplements as some can trigger AF symptoms.\n  * Exercise. Some exercises can trigger symptoms of AF. Find out more about how to stay safe while exercising with AF (see below). \n\n\nThe Heart Foundation has more information on[adjusting to life with AF.(external link)(external link)](https://www.heartfoundation.org.nz/your-heart/hearthelp/atrial-fibrillation/living-with-af \"Open external link\").\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps), [Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps), [Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps), [Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps) and [Stroke apps](https://healthify.nz/apps/s/stroke-apps).\n####  VIDEOS: Personal stories \nStories of people living with atrial fibrillation.\n#### Video: Personal story: living with atrial fibrillation\nIn this video young dad Sela Alo talks about living with atrial fibrillation and how the diagnosis revealed his larger heart problem of mitral valve regurgitation. This video may take a few moments to load.\n(Heart Foundation NZ, 2017)\n#### Video: Personal story: a series of videos\nIn this series of videos, Nikki talks about her journey with atrial fibrillation. This video may take a few moments to load.\n(Heart Foundation NZ, 2018)\nFind more personal stories at[the Heart Foundation website.(external link)](https://www.heartfoundation.org.nz/journeys \"Open external link\")\n####  Related topics on Healthify \n[Heart risk assessment](https://healthify.nz/health-a-z/h/heart-risk-assessment \"Heart risk assessment\")  \n[Heart attack | Hē manawa](https://healthify.nz/health-a-z/h/heart-attack \"Heart attack | Hē manawa\")  \n[Stroke | Mate rehu ohotata](https://healthify.nz/health-a-z/s/stroke \"Stroke | Mate rehu ohotata\")  \n[Heart failure | Manawa ngoikore](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure | Manawa ngoikore\")  \n[Pacemaker | Pūrere whakakapa manawa](https://healthify.nz/health-a-z/p/pacemaker \"Pacemaker | Pūrere whakakapa manawa\")  \n[Anticoagulants](https://healthify.nz/medicines-a-z/a/anticoagulants-and-antiplatelets \"Anticoagulants\")  \n[Beta blockers](https://healthify.nz/medicines-a-z/b/beta-blockers \"Beta blockers\")  \n[Calcium channel blockers](https://healthify.nz/medicines-a-z/c/calcium-channel-blockers \"Calcium channel blockers\")  \n[Digoxin](https://healthify.nz/medicines-a-z/d/digoxin \"Digoxin\")\n####  More information \n[Atrial fibrillation(external link)(external link)](https://www.heartfoundation.org.nz/your-heart/heart-conditions/atrial-fibrillation \"Open external link\")Heart Foundation, NZ  \n[Understanding your pulse (heart rate)(external link)(external link)](https://www.heartfoundation.org.nz/wellbeing/managing-risk/how-to-check-your-pulse-heart-rate \"Open external link\") Heart Foundation, NZ  \n[Atrial fibrillation(external link)(external link)](https://www.nhs.uk/conditions/atrial-fibrillation/ \"Open external link\") NHS, UK  \n[Arrhythmias – normal heartbeat animation(external link)(external link)](http://watchlearnlive.heart.org/CVML_Player.php?moduleSelect=arrhyt \"Open external link\") Watch, learn, live – interactive cardiovascular library – American Heart Association  \n[Atrial fibrillation – conduction system of the heart(external link)(external link)](http://watchlearnlive.heart.org/CVML_Player.php?moduleSelect=atrfib \"Open external link\") Watch, learn, live – interactive cardiovascular library – American Heart Association  \n[Exercising with AF(external link)(external link)](https://www.bhf.org.uk/informationsupport/heart-matters-magazine/activity/exercise-and-atrial-fibrillation \"Open external link\") British Heart Foundation, UK  \n[Staying well with atrial fibrillation(external link)](https://www.heartfoundation.org.nz/your-heart/hearthelp/atrial-fibrillation \"Open external link\") Heart Foundation, NZ\n####    \nApps\n[Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps)  \n[Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps)  \n[Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps)  \n[Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps)  \n[Stroke apps](https://healthify.nz/apps/s/stroke-riskometer-app)  \n  \n\n#### References\n  1. [An update on managing patients with atrial fibrillation(external link)](https://bpac.org.nz/2017/af.aspx \"Open external link\")\n  2. [Management of arrhythmias(external link)](https://nzf.org.nz/nzf_1073 \"Open external link\")\n  3. [Atrial fibrillation(external link)](https://www.nhlbi.nih.gov/health-topics/atrial-fibrillation \"Open external link\")\n  4. [How to check your pulse(external link)](https://www.bhf.org.uk/informationsupport/tests/checking-your-pulse \"Open external link\") British Heart Foundation, UK\n  5. [Atrial fibrillation(external link)](https://3d.communityhealthpathways.org/index.htm?toc.htm?25271.htm \"Open external link\")\n  6. Van Gelder IC, Rienstra M, Bunting KV et al. [2024 ESC Guidelines for the management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS): Developed by the task force for the management of atrial fibrillation of the European Society of Cardiology (ESC), with the special contribution of the European Heart Rhythm Association (EHRA) of the ESC. (external link)](https://academic.oup.com/eurheartj/article/45/36/3314/7738779?login=false \"Open external link\")[Endorsed by the European Stroke Organisation (ESO)(external link)](https://academic.oup.com/eurheartj/article/45/36/3314/7738779?login=false \"Open external link\") Eur. Heart J. 2024;45(36): 3314–3414\n\n\n####  Information for healthcare providers \n#### Tools\n**CHA2DS2-VASc Score  \n** Estimates stroke risk in patients with atrial fibrillation. Use online calculator [www.chadsvasc.org(external link)](https://www.chadsvasc.org/ \"Open external link\")\n**HAS-BLED Score for major bleeding risk  \n** Estimates risk of major bleeding for patients on anticoagulation to assess risk-benefit in atrial fibrillation care. Use the online calculator from [MD Calc website(external link)](https://www.mdcalc.com/has-bled-score-major-bleeding-risk \"Open external link\").\n**AF Electronic Decision Support Tool BPAC  \n**[The AF decision support(external link)](https://bpac.org.nz/b-safe/ \"Open external link\") is quick to use, providing an individualised check list for anticoagulation, steps to reduce bleeding risk, and advice on heart rate control and overall cardiovascular risk management.**  \n**\n#### Resources\n  * National Heart Foundation of Australia and the Cardiac Society of Australia and NZ. [Australian clinical guidelines for the diagnosis and management of atrial fibrillation 2018(external link)](https://www.heartlungcirc.org/article/S1443-9506%2818%2931778-5/pdf \"Open external link\") Heart, Lung and Circulation 2018;27:1209-1266. \n  * [2020 European Society of Cardiology AF guidelines(external link)](https://academic.oup.com/eurheartj/article/42/5/373/5899003 \"Open external link\") 2021\n  * [Atrial fibrillation – diagnosis and management(external link)](https://www.nice.org.uk/guidance/ng196/chapter/Recommendations \"Open external link\") NICE, UK \n  * [An update on managing patients with atrial fibrillation(external link)](https://bpac.org.nz/2017/af.aspx \"Open external link\") BPAC, NZ, 2017\n  * [Management of arrhythmias(external link)](https://nzf.org.nz/nzf_1073 \"Open external link\") NZ Formulary \n  * [Atrial fibrillation(external link)](https://bpac.org.nz/b-quick/af.aspx \"Open external link\") B-QuiCK Bpac, NZ\n\n\n#### Webinars\n[Stop the clot! AF and stroke prevention – Dr Ralph Stewart (external link)](https://youtu.be/2cFoOM3LbQg \"Open external link\")Goodfellow Unit Webinar, NZ, 2020  \n[Atrial fibrillation and its management – Prof. Gerry Devlin (external link)](https://youtu.be/NremGNdaRUw \"Open external link\")PHARMAC Seminars, NZ, 2019  \n[Goodfellow unit webinar – atrial fibrillation(external link)](https://youtu.be/3ycpw007ztQ \"Open external link\") Goodfellow Unit Webinar, NZ, 2017\n#### Apps\n[Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps)  \n[Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps)  \n[Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps)  \n[Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps)  \n[Stroke apps](https://healthify.nz/apps/s/stroke-apps)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Associate Professor Sue Wells, Public Health Physician, University of Auckland\nLast reviewed: 09 Nov 2022\nPage last updated: 28 Jan 2025\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/atrial-fibrillation \n![image](https://healthify.nz/assets/Uploads/image.png)\n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-04T03:24:22.146518Z",
    "letter": "a",
    "slug": "af"
  }
}