{
  "url": "https://healthify.nz/health-a-z/a/allergies/",
  "title": "Allergies",
  "markdown": "# Allergies\n### Key points about allergies\n  * An allergy happens when your immune system overreacts to substances called allergens. \n  * Your body treats an allergen as an invader and begins to create antibodies against it in an effort to remove it.\n  * Common allergens include house dust mites, grasses, pollen, pet dander, foods, some medicines, insect stings, latex and moulds. \n  * Symptoms range from mild\n  * Children have more allergies than adults. As your immune system matures, some allergies disappear.\n\n\n![Boy in pyjamas on the couch sneezing into tissue](https://healthify.nz/assets/Health-A-Z/Infectious-and-colds/Boy-in-pyjamas-sneezing-into-tissue-canva-950x690.jpg)\nQR Code Print\n####  What to do in an emergency \nAnaphylaxis is a severe allergic reaction and must be treated as a medical emergency, requiring immediate treatment and urgent medical attention. If you or someone you care for experiences the symptoms of anaphylaxis below, give adrenaline (EpiPen) if available and call 111 for an ambulance. \nAn easy way to remember the symptoms or anaphylaxis is to think ABC for airway, breathing and circulation.\n**A** = Airway: Swelling of your tongue, swelling or tightness in your throat, difficulty talking or a hoarse (raspy) voice.\n**B** = Breathing: Difficulty breathing, wheezing or persistent cough.\n**C** = Circulation: Dizziness, collapse and/or losing consciousness (fainting), children being pale and floppy.\n![Signs of anaphylaxis related to airway, breathing and circulation](https://healthify.nz/assets/Infographics/Symptoms-of-anaphylaxis-HN-950x690__ResizedImageWzcwMCw1MDhd.png)\n_Image credit: Healthify He Puna Waiora_\n####  What is an allergic reaction? \nWhen you have an allergy, your immune system overreacts to a substance that, to most people, is harmless. Your body’s immune system treats the substance (known as an allergen or trigger) as an invader. To defend itself against the allergen, your body produces antibodies called immunoglobulin E (IgE). These antibodies cause certain cells in your body to release chemicals (eg, histamine) into your bloodstream in an attempt to fight off the invader.\nThe release of these chemicals causes an allergic reaction. Symptoms vary depending on the part of your body that's affected, but can include sneezing, watery eyes, itching, rash and raised weals ([hives](https://healthify.nz/health-a-z/h/hives \"Hives\")) on your skin. An extreme allergic reaction can be life-threatening and needs immediate treatment. This is called[anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\").\n####  What causes allergies? \nWhile you don’t inherit an allergy directly, you may inherit a tendency to be allergic and develop allergic diseases. This tendency is called being atopic. Allergies start only if you are exposed to an allergen. Once you develop a sensitivity to an allergen, an allergic response is set off every time you're exposed to the allergens that affect you. \n####  What are the common allergens? \nSubstances in the environment that can cause an allergic reaction are called allergens. Common allergens include:\n  * the droppings of house dust mites \n  * pollen, particularly from grass, trees and weeds\n  * animal dander (skin, scales or flakes from animals)\n  * metals, such as nickel in watch bands, earrings or belt buckles\n  * latex in rubber products\n  * some moulds\n  * insect bites and stings\n  * household chemicals such as those in hair dyes and detergents\n  * medicines\n  * foods such as peanuts, dairy, eggs and seafood.\n\n\nTrue[food allergies](https://healthify.nz/health-a-z/f/food-allergies \"Food allergies\")[the difference between food allergies and food intolerance](https://healthify.nz/health-a-z/f/food-allergy-or-intolerance).\nCigarette smoke is often thought to cause allergies, but it's actually an irritant rather than an allergen. That means it doesn’t cause an allergy, but makes an existing allergy worse.\n####  What are the types of allergic conditions? \nDepending on the type of allergens and where allergens enter your body, they can cause different allergic reactions and conditions. These include:\n  * allergic rhinitis ([hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\"))\n  * allergic contact[dermatitis](https://healthify.nz/health-a-z/d/dermatitis \"Dermatitis\") ([eczema](https://healthify.nz/health-a-z/e/eczema))\n  * [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\")\n  * [asthma](https://healthify.nz/health-a-z/a/asthma-topics \"Asthma\")\n  * [food allergies](https://healthify.nz/health-a-z/f/food-allergies \"Food allergies\")\n  * [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")\n\n\n####  What are the symptoms of an allergic reaction? \nSymptoms depend on where allergens enter your body and which part of your body is affected. They can range from mild to severe. Typically, symptoms happen within minutes to an hour after you are exposed to a particular allergen.\n  * [Hay fever](https://healthify.nz/health-a-z/h/hay-fever) (also known as allergic rhinitis) affects your eyes and nose when you inhale allergens. Symptoms include sneezing, runny nose, watery and itchy eyes, irritated and itchy throat and, sometimes, a stuffy, blocked nose.\n  * Allergic contact[dermatitis](https://healthify.nz/health-a-z/d/dermatitis \"Dermatitis\")\n  * Allergies to some foods, insect bites or stings can cause[hives (urticaria)](https://healthify.nz/health-a-z/h/hives \"Hives\"), which are raised red, itchy patches on your skin. Food allergies can also cause nausea or vomiting, swelling around your lips, face and eyes, diarrhoea (runny poo) or sneezing.\n  * Anaphylaxis is a severe allergic reaction. It can involve your whole body and is a life-threatening condition. It requires immediate life-saving medicine such as adrenaline. Read more about[anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis).\n\n\n####  How are allergies diagnosed? \nIt's important to talk to your healthcare provider if you think you or your child may have an allergy to something. There are many causes of allergies and some symptoms may be due to other conditions.\nYour healthcare provider will ask you or your child about allergic symptoms such as a rash or an upset stomach. Other questions may include the following:\n  * How often do your symptoms occur?\n  * Is there anything that will trigger your symptoms?\n  * How soon do your symptoms occur after being exposed to a particular allergen?\n  * Are there any family members who also have allergies?\n  * Have you been exposed to new foods, pets or medicines recently?\n\n\nWhen symptoms appear soon after you have been exposed to a particular allergen, it is easy to identify which allergen is causing your reaction. However, if the cause is unknown, other diagnostic tests may be needed. This might include a skin prick test or a blood test to test for the presence of the antibody (IgE) that causes an allergic reaction. Your healthcare provider may also refer you or your child to a paediatric clinic or allergy specialist for further tests if the cause is still unclear.\n####    \nSkin prick tests\n  * A needle is pricked into your skin through a drop of the suspected allergen, usually on the skin of your inner forearm or back.\n  * The size of the weal on your skin indicates how strongly you are allergic to a particular allergen.\n  * As many as 30 allergens can be tested at the same time to work out the particular substances you are allergic to.\n\n\n![Skin prick test for allergen reaction](https://healthify.nz/assets/Health-A-Z/Skin-topics/Skin-prick-test-for-allergens-Bruce-Blaus-Wikimedia-Commons-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Bruce Blaus via[Wikimedia Commons(external link)](https://commons.wikimedia.org/wiki/File:Skin_Prick_Test.png \"Open external link\")_\n####  How are allergies treated? \nThe most important part of managing allergies is to avoid allergens, if possible. Allergic symptoms also have specific treatments, including medicines and self-help measures. For some allergic conditions such as allergic rhinosinusitis, allergen immunotherapy (AIT) can also help.\n#### Medicines\nMedicines are used to treat allergic symptoms, including:\n  * antihistamines\n  * steroid nasal inhalers or decongestant nasal spray\n  * medicated or non-medicated eye drops\n  * emollient or corticosteroid creams\n  * steroid tablets\n  * adrenaline – usually in an autoinjector called EpiPen.\n\n\n  \n**Antihistamines**\n  * Antihistamines are medicines that reduce or block histamines, the substance released by your body in response to allergens.\n  * They're most commonly used to treat allergic symptoms.\n  * Antihistamines are usually well tolerated and work well.\n  * Antihistamines can be bought from pharmacies or prescribed by your doctor or nurse prescriber.\n  * Ask your pharmacist/chemist or healthcare provider if you don't know which one you need.\n  * Read more about[antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines).\n\n\n  \n**Steroid nasal inhalers or decongestant nasal sprays**\n  * These are used to relieve symptoms of [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\").\n  * A prescription may be needed for stronger doses of steroids.\n  * Decongestant nasal sprays can relieve stuffiness or congestion of your nostrils and can be bought over the counter. However, these medicines are not suitable for long-term use. Ask your pharmacist or healthcare provider if you don't know if they're suitable for you.\n  * Read more about[steroid nasal sprays](https://healthify.nz/medicines-a-z/s/steroid-nasal-sprays)[decongestant nasal sprays](https://healthify.nz/medicines-a-z/d/decongestants).\n\n\n  \n**Medicated or non-medicated eye drops**\n  * Some eye drops may be helpful in some allergic conditions such as [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\").\n  * These eye drops can be lubricating eye drops or may contain medications\n  * Ask your healthcare provider or pharmacist about suitable eye drops for you.\n  * Read more about[eye drops](https://healthify.nz/medicines-a-z/e/eye-drops).\n\n\n  \n**Emollients and corticosteroid creams**\n  * Emollients or corticosteroid creams can help improve allergic symptoms or conditions that involve your skin, such as [hives](https://healthify.nz/health-a-z/h/hives \"Hives\") or [eczema](https://healthify.nz/health-a-z/e/eczema \"Eczema\").\n  * Read more about[emollients](https://healthify.nz/medicines-a-z/e/emollients-moisturisers)[steroid creams](https://healthify.nz/medicines-a-z/s/steroid-creams-and-ointments).\n\n\n**Steroid tablets**\n  * Steroid tablets can also be used to treat allergic symptoms such as hives and to reduce inflammation.\n  * A prescription from your healthcare provider is needed.\n  * Read more about[steroid tablets](https://healthify.nz/medicines-a-z/s/steroid-tablets).\n\n\n  \n**Adrenaline**\n  * Adrenaline is used in an emergency to treat [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\").\n  * It is usually in the form of an autoinjector, called an EpiPen.\n  * EpiPens are easy to use and can be given by non-medical people.\n  * If you have been prescribed an EpiPen, your healthcare provider or pharmacist can teach you how to use it.\n  * Read more about[EpiPens](https://healthify.nz/medicines-a-z/e/epipen).\n\n\n####    \nAllergen immunotherapy (AIT)\nWhen medicines don’t provide enough relief, an option is immunotherapy. Immunotherapy may also be an option if your symptoms are severe and the allergen is difficult to avoid, such as with allergic rhinosinusitis or [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\"). \nThe aim of immunotherapy is to make you develop tolerance to a particular allergen. It works by changing the way your immune system reacts to allergens. Your doctor will give you an allergen you are allergic to, either under your tongue, through your nose or by an injection. This will be repeated over a period of 3 to 5 years. \nImmunotherapy isn't suitable for everyone. Ask your healthcare provider or an allergy specialist about it. \n####  How can I prevent an allergic reaction? \nHere are some tips to avoid some common allergens and help minimise allergic symptoms.\n#### Dust mites\nYou can never get rid of all the dust mites in your house, but doing these things can help reduce their numbers:\n  * If possible, replace wall-to-wall carpets with hard flooring such as floorboards.\n  * Clean non-carpeted floors with a wet or electrostatic mop rather than using a vacuum cleaner.\n  * Clean carpets 2 to 3 times each week with a vacuum cleaner that has a suitable filter.\n  * Dust surfaces with a damp or electrostatic cloth 2 to 3 times a week.\n  * Remove fluffy, stuffed toys from your child's bedroom or wash them weekly in hot water. Putting soft toys in the freezer overnight kills mites but doesn't remove allergens.\n  * Remove soft, upholstered furniture from the bedroom.\n  * Select furniture that's upholstered in vinyl or leather rather than cloth.\n  * Aim for good ventilation throughout your house to avoid moist air build-up.\n  * Try to sleep with windows open to reduce the amount of moisture in the bedroom from breathing.\n\n\n####    \nPollen\n  * Keep the garden free of highly allergenic plants.\n  * Try to stay indoors at times when the pollen count is at its highest, eg, the early evening.\n  * Get someone else to mow your lawn.\n  * Close your bedroom windows at night to prevent pollen entering.\n  * Wear wrap-around sunglasses to avoid pollen getting into your eyes.\n  * Have a shower and wash your hair at night to wash away pollen you may have ‘collected’ during the day.\n  * Dry your clothes inside or in a tumble drier to avoid getting pollen on them.\n\n\n####    \nAnimal dander\n  * Keep pets outside, if possible.\n\n\n####    \nSkin allergies\n  * Avoid strong soaps, perfumes and household cleansing products that may irritate sensitive skin.\n  * Make sure jewellery and watches don't contain nickel, and are suitable for sensitive skin.\n\n\n####    \nInsect bites and stings\n  * Make sure you wear footwear outdoors.\n  * Cover your arms and legs.\n  * Don't make sudden moves when bees or wasps are around.\n  * Avoid strong perfume as it can attract insects.\n  * Wear gloves when gardening.\n  * Use insect repellent.\n\n\n####    \nFood allergies\nIf you have food allergies, know what they are and avoid those foods. A consultation with a dietitian can help you work out how to do this and still have a healthy, balanced diet. Ask your healthcare provider for a referral to a dietitian. Read more about [food allergies](https://healthify.nz/health-a-z/f/food-allergies).\n####  How can I care for myself with allergies? \n#### Avoid allergies\nIt's not always practical to avoid the allergens you are allergic to. However, some things you can do include:\n  * being careful about what you eat if you have food allergies\n  * avoiding exposure to pets if you have animal allergies\n  * keeping your home warm and dry if you have mould allergies\n  * staying indoors and avoiding grassy areas if you have hay fever.\n\n\n####    \nCarry adrenaline\nIf you're at risk of life-threatening allergic reactions, carry adrenaline with you at all times. You also need to be trained in the correct use of an adrenaline auto-injector, EpiPen. Partners of adults should also be familiar with these devices.  \n  \nFor children with allergies, parents or caregivers (including at daycare and schools) should also be familiar with how to use the EpiPen. \n####    \nAllergic reaction action plan\nAllergic reactions can cause a variety of symptoms ranging from mild to moderate reactions, through to severe and life-threatening reactions ([anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")). You and your whānau need to be able to recognise the signs of an allergic reaction and anaphylaxis, and know what to do in an emergency.   \n  \nAn allergic reaction action plan is a written document that outlines what to do if you have an allergic reaction. \n  * Here are [plans from the Australasian Society of Clinical Immunology and Allergy (ASCIA).(external link)](https://www.allergy.org.au/hp/ascia-plans-action-and-treatment \"Open external link\")\n\n\nCarry your allergy action plan at all times or put your action plan somewhere you can easily find it in your home. If you don’t have an action plan, ask your healthcare provider to fill out one with you.\n####    \nWear a medical bracelet\nWear a medical bracelet stating what you are allergic to. This can be very helpful for health professionals when treating you.\n####    \nRemind your healthcare team\nAlways remind your healthcare provider or pharmacist about your allergies before starting any new treatment, including complementary, over-the-counter and herbal medicines.\n####  What support is available with allergies? \n[Allergy New Zealand(external link)](http://www.allergy.org.nz/ \"Open external link\") provides information, education and support for people with allergy, parents of children with allergy, teachers and health professionals. \n####  Related topics on Healthify \n[Anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")  \n[EpiPen®](https://healthify.nz/medicines-a-z/e/epipen \"EpiPen®\")  \n[Allergy tips for school children](https://healthify.nz/health-a-z/a/allergies-tips-for-children-starting-school \"Allergy tips for school children\")  \n[Hay fever | Mate hei](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever | Mate hei\")  \n[Hives | Mate kārawa](https://healthify.nz/health-a-z/h/hives \"Hives | Mate kārawa\")  \n[Food allergy topics](https://healthify.nz/health-a-z/f/food-allergy-topics \"Food allergy topics\")\n####  More information \nThe following links provide further information about allergies. Be aware that websites from other countries may have information that differs from New Zealand recommendations. \n[Allergy conditions(external link)](https://www.allergy.org.nz/conditions/ \"Open external link\") Allergy NZ  \n[Allergy(external link)](https://www.kidshealth.org.nz/allergy \"Open external link\")  \n[Allergies(external link)](https://www.healthinfo.org.nz/index.htm?overview-of-allergies.htm \"Open external link\")  \n[What is allergy?(external link)](https://www.allergy.org.au/patients/about-allergy/what-is-allergy \"Open external link\")  \n[Allergies(external link)](https://www.nhs.uk/conditions/allergies/ \"Open external link\")  \n[Allergies(external link)](https://patient.info/allergies-blood-immune/allergies \"Open external link\")  \n  \n\n#### Brochures\n[Action plan for allergic reactions(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2025/ASCIA_Action_Plan_Allergic_Reactions_2025.pdf \"Open external link\") Australasian Society of Clinical Immunology & Allergy, Australia, 2025  \n[Action plan for anaphylaxis – for use with EpiPen adrenaline autoinjectors(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2025/ASCIA_Action_Plan_Anaphylaxis_General_2025.pdf \"Open external link\") Australasian Society of Clinical Immunology and Allergy, Australia, 2025 [English(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2023/ASCIA_Action_Plan_Anaphylaxis_Red_EpiPen_2023.pdf \"Open external link\"), [Arabic(external link)](https://www.allergy.org.au/images/pcc/ana/Arabic_ASCIA_PCC_Anaphylaxis_2015.pdf \"Open external link\"), [Chinese Traditional(external link)](https://www.allergy.org.au/images/pcc/ana/Chinese_Trad_ASCIA_PCC_Anaphylaxis_2015.pdf \"Open external link\"), [Chinese Simplified(external link)](https://www.allergy.org.au/images/pcc/ana/Chinese_Simplified_ASCIA_PCC_Anaphylaxis_2018.PDF \"Open external link\")  \n[Allergies(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies.pdf \"Open external link\") Health Information Translations, US, 2016 [English(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies.pdf \"Open external link\"), [Arabic(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_ARA.pdf \"Open external link\"), [Chinese (simplified)(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_SCh.pdf \"Open external link\"), [French(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Fr.pdf \"Open external link\"), [Hindi(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Hindi.pdf \"Open external link\"), [Japanese(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Jp.pdf \"Open external link\"), [Korean(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Kor.pdf \"Open external link\"), [Nepali(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Nepali.pdf \"Open external link\"), [Russian(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Rus.pdf \"Open external link\"), [Somali(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_So.pdf \"Open external link\"), [Spanish(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Sp.pdf \"Open external link\")  \n[Allergy awareness resource for primary years(external link)](https://allergyfacts.org.au/be-a-mate/ \"Open external link\") Allergy and Anaphylaxis, Australia  \n[Allergies factsheet in multiple languages(external link)](https://www.healthinfotranslations.org/document/allergies/120994 \"Open external link\") Health Information Translations\n####    \nReferences\n  1. [Allergies(external link)](https://aucklandregion.communityhealthpathways.org/30857.htm \"Open external link\")\n  2. Calderon MA, Alves B, Jacobson M, Hurwitz B, Sheikh A, Durham S. [Allergen injection immunotherapy for seasonal allergic rhinitis(external link)](https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD001936.pub2/full?highlightAbstract=allergen%7Cseasonal%7Cimmunotherapi%7Cfor%7Crhinitis%7Callergic%7Callerg%7Cfour%7Cimmunotherapy%7Cseason%7Crhiniti%7Cinjection%7Cinject \"Open external link\") Cochrane Database of Systematic Reviews 2007;1:CD001936\n  3. [Assessing the efficacy of immunotherapy for desensitisation of peanut allergy in children(external link)(external link)](http://www.thelancet.com/journals/lancet/article/PIIS0140-6736\\(13\\)62301-6/abstract \"Open external link\") The Lancet, Volume 383, Issue 9925, Pages 1297–1304, 12 April 2014.\n  4. [Personal action plans for allergies(external link)](http://www.allergy.org.au/health-professionals/ascia-plans-action-and-treatment \"Open external link\") Australasian Society of Clinical Immunology and Allergy (ASCIA)\n\n\n####  Information for healthcare providers (+ VIDEO) \n#### Clinical resources\n_[Information for health professionals(external link)](https://allergy.org.au/hp \"Open external link\")_ Australasian Society of Clinical Immunology and Allergy (ASCIA)  \n[Information and links for health professionals(external link)](https://www.allergy.org.nz/education/health-professionals/ \"Open external link\")  \n[Laboratory investigation of allergic diseases(external link)](https://www.allergy.org.au/hp/papers/tests-in-the-diagnosis-of-allergic-diseases \"Open external link\")  \n[Skin prick testing guide for the diagnosis of allergic disease(external link)](https://allergy.org.au/hp/papers/skin-prick-testing \"Open external link\")  \n[Paediatric allergy clinical network(external link)](https://www.starship.org.nz/health-professionals/paediatric-allergy-clinical-network/ \"Open external link\")  \n[Specific allergen immunotherapy (AIT) environmental (inhaled) allergies(external link)](https://assets.ctfassets.net/uszvm6pv23md/6d1aWN2iT3ZoUpHyEyXf73/8a3541db2eca495bb8928284e66768b0/environmental_allergens.pdf \"Open external link\")  \n[Penicillin allergy in adults – bulletin for health workers(external link)](https://www.psnz.org.nz/Folder?Action=View%20File&Folder_id=225&File=Pencillin%20Allergy%20CDHB%20Bulletin%20-%20PDF.pdf \"Open external link\") Pharmaceutical Society of NZ  \n[Challenge penicillin allergies – poster for health workers(external link)](https://www.psnz.org.nz/Folder?Action=View%20File&Folder_id=225&File=Penicillin%20Allergy%20Posters%20-%20Healthcare%20Worker%20-%20PDF.pdf \"Open external link\") Pharmaceutical Society of NZ\nSee our page [Food allergy for healthcare providers](https://healthify.nz/healthcare-providers/f/food-allergies-hcps)\n####    \nContinuing professional development  \neLearning\n[Health professionals e-training(external link)](https://allergy.org.au/hp/hp-e-training \"Open external link\")  \n[Allergies – when the immune system backfires(external link)](https://www.futurelearn.com/courses/allergies \"Open external link\")\n####    \nVideos and webinars\n**Video: Goodfellow Unit Webinar: Managing childhood allergies**\n(Goodfellow Unit Webinar, NZ, 2018)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Sara Jayne Pietersen, FRNZCGP, Auckland\nLast reviewed: 17 Jun 2025\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/allergies \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Allergies\n### Key points about allergies\n  * An allergy happens when your immune system overreacts to substances called allergens. \n  * Your body treats an allergen as an invader and begins to create antibodies against it in an effort to remove it.\n  * Common allergens include house dust mites, grasses, pollen, pet dander, foods, some medicines, insect stings, latex and moulds. \n  * Symptoms range from mild\n  * Children have more allergies than adults. As your immune system matures, some allergies disappear.\n\n\n![Boy in pyjamas on the couch sneezing into tissue](https://healthify.nz/assets/Health-A-Z/Infectious-and-colds/Boy-in-pyjamas-sneezing-into-tissue-canva-950x690.jpg)\nQR Code Print\n####  What to do in an emergency \nAnaphylaxis is a severe allergic reaction and must be treated as a medical emergency, requiring immediate treatment and urgent medical attention. If you or someone you care for experiences the symptoms of anaphylaxis below, give adrenaline (EpiPen) if available and call 111 for an ambulance. \nAn easy way to remember the symptoms or anaphylaxis is to think ABC for airway, breathing and circulation.\n**A** = Airway: Swelling of your tongue, swelling or tightness in your throat, difficulty talking or a hoarse (raspy) voice.\n**B** = Breathing: Difficulty breathing, wheezing or persistent cough.\n**C** = Circulation: Dizziness, collapse and/or losing consciousness (fainting), children being pale and floppy.\n![Signs of anaphylaxis related to airway, breathing and circulation](https://healthify.nz/assets/Infographics/Symptoms-of-anaphylaxis-HN-950x690__ResizedImageWzcwMCw1MDhd.png)\n_Image credit: Healthify He Puna Waiora_\n####  What is an allergic reaction? \nWhen you have an allergy, your immune system overreacts to a substance that, to most people, is harmless. Your body’s immune system treats the substance (known as an allergen or trigger) as an invader. To defend itself against the allergen, your body produces antibodies called immunoglobulin E (IgE). These antibodies cause certain cells in your body to release chemicals (eg, histamine) into your bloodstream in an attempt to fight off the invader.\nThe release of these chemicals causes an allergic reaction. Symptoms vary depending on the part of your body that's affected, but can include sneezing, watery eyes, itching, rash and raised weals ([hives](https://healthify.nz/health-a-z/h/hives \"Hives\")) on your skin. An extreme allergic reaction can be life-threatening and needs immediate treatment. This is called[anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\").\n####  What causes allergies? \nWhile you don’t inherit an allergy directly, you may inherit a tendency to be allergic and develop allergic diseases. This tendency is called being atopic. Allergies start only if you are exposed to an allergen. Once you develop a sensitivity to an allergen, an allergic response is set off every time you're exposed to the allergens that affect you. \n####  What are the common allergens? \nSubstances in the environment that can cause an allergic reaction are called allergens. Common allergens include:\n  * the droppings of house dust mites \n  * pollen, particularly from grass, trees and weeds\n  * animal dander (skin, scales or flakes from animals)\n  * metals, such as nickel in watch bands, earrings or belt buckles\n  * latex in rubber products\n  * some moulds\n  * insect bites and stings\n  * household chemicals such as those in hair dyes and detergents\n  * medicines\n  * foods such as peanuts, dairy, eggs and seafood.\n\n\nTrue[food allergies](https://healthify.nz/health-a-z/f/food-allergies \"Food allergies\")[the difference between food allergies and food intolerance](https://healthify.nz/health-a-z/f/food-allergy-or-intolerance).\nCigarette smoke is often thought to cause allergies, but it's actually an irritant rather than an allergen. That means it doesn’t cause an allergy, but makes an existing allergy worse.\n####  What are the types of allergic conditions? \nDepending on the type of allergens and where allergens enter your body, they can cause different allergic reactions and conditions. These include:\n  * allergic rhinitis ([hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\"))\n  * allergic contact[dermatitis](https://healthify.nz/health-a-z/d/dermatitis \"Dermatitis\") ([eczema](https://healthify.nz/health-a-z/e/eczema))\n  * [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\")\n  * [asthma](https://healthify.nz/health-a-z/a/asthma-topics \"Asthma\")\n  * [food allergies](https://healthify.nz/health-a-z/f/food-allergies \"Food allergies\")\n  * [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")\n\n\n####  What are the symptoms of an allergic reaction? \nSymptoms depend on where allergens enter your body and which part of your body is affected. They can range from mild to severe. Typically, symptoms happen within minutes to an hour after you are exposed to a particular allergen.\n  * [Hay fever](https://healthify.nz/health-a-z/h/hay-fever) (also known as allergic rhinitis) affects your eyes and nose when you inhale allergens. Symptoms include sneezing, runny nose, watery and itchy eyes, irritated and itchy throat and, sometimes, a stuffy, blocked nose.\n  * Allergic contact[dermatitis](https://healthify.nz/health-a-z/d/dermatitis \"Dermatitis\")\n  * Allergies to some foods, insect bites or stings can cause[hives (urticaria)](https://healthify.nz/health-a-z/h/hives \"Hives\"), which are raised red, itchy patches on your skin. Food allergies can also cause nausea or vomiting, swelling around your lips, face and eyes, diarrhoea (runny poo) or sneezing.\n  * Anaphylaxis is a severe allergic reaction. It can involve your whole body and is a life-threatening condition. It requires immediate life-saving medicine such as adrenaline. Read more about[anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis).\n\n\n####  How are allergies diagnosed? \nIt's important to talk to your healthcare provider if you think you or your child may have an allergy to something. There are many causes of allergies and some symptoms may be due to other conditions.\nYour healthcare provider will ask you or your child about allergic symptoms such as a rash or an upset stomach. Other questions may include the following:\n  * How often do your symptoms occur?\n  * Is there anything that will trigger your symptoms?\n  * How soon do your symptoms occur after being exposed to a particular allergen?\n  * Are there any family members who also have allergies?\n  * Have you been exposed to new foods, pets or medicines recently?\n\n\nWhen symptoms appear soon after you have been exposed to a particular allergen, it is easy to identify which allergen is causing your reaction. However, if the cause is unknown, other diagnostic tests may be needed. This might include a skin prick test or a blood test to test for the presence of the antibody (IgE) that causes an allergic reaction. Your healthcare provider may also refer you or your child to a paediatric clinic or allergy specialist for further tests if the cause is still unclear.\n####    \nSkin prick tests\n  * A needle is pricked into your skin through a drop of the suspected allergen, usually on the skin of your inner forearm or back.\n  * The size of the weal on your skin indicates how strongly you are allergic to a particular allergen.\n  * As many as 30 allergens can be tested at the same time to work out the particular substances you are allergic to.\n\n\n![Skin prick test for allergen reaction](https://healthify.nz/assets/Health-A-Z/Skin-topics/Skin-prick-test-for-allergens-Bruce-Blaus-Wikimedia-Commons-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Bruce Blaus via[Wikimedia Commons(external link)](https://commons.wikimedia.org/wiki/File:Skin_Prick_Test.png \"Open external link\")_\n####  How are allergies treated? \nThe most important part of managing allergies is to avoid allergens, if possible. Allergic symptoms also have specific treatments, including medicines and self-help measures. For some allergic conditions such as allergic rhinosinusitis, allergen immunotherapy (AIT) can also help.\n#### Medicines\nMedicines are used to treat allergic symptoms, including:\n  * antihistamines\n  * steroid nasal inhalers or decongestant nasal spray\n  * medicated or non-medicated eye drops\n  * emollient or corticosteroid creams\n  * steroid tablets\n  * adrenaline – usually in an autoinjector called EpiPen.\n\n\n  \n**Antihistamines**\n  * Antihistamines are medicines that reduce or block histamines, the substance released by your body in response to allergens.\n  * They're most commonly used to treat allergic symptoms.\n  * Antihistamines are usually well tolerated and work well.\n  * Antihistamines can be bought from pharmacies or prescribed by your doctor or nurse prescriber.\n  * Ask your pharmacist/chemist or healthcare provider if you don't know which one you need.\n  * Read more about[antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines).\n\n\n  \n**Steroid nasal inhalers or decongestant nasal sprays**\n  * These are used to relieve symptoms of [hay fever](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever\").\n  * A prescription may be needed for stronger doses of steroids.\n  * Decongestant nasal sprays can relieve stuffiness or congestion of your nostrils and can be bought over the counter. However, these medicines are not suitable for long-term use. Ask your pharmacist or healthcare provider if you don't know if they're suitable for you.\n  * Read more about[steroid nasal sprays](https://healthify.nz/medicines-a-z/s/steroid-nasal-sprays)[decongestant nasal sprays](https://healthify.nz/medicines-a-z/d/decongestants).\n\n\n  \n**Medicated or non-medicated eye drops**\n  * Some eye drops may be helpful in some allergic conditions such as [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\").\n  * These eye drops can be lubricating eye drops or may contain medications\n  * Ask your healthcare provider or pharmacist about suitable eye drops for you.\n  * Read more about[eye drops](https://healthify.nz/medicines-a-z/e/eye-drops).\n\n\n  \n**Emollients and corticosteroid creams**\n  * Emollients or corticosteroid creams can help improve allergic symptoms or conditions that involve your skin, such as [hives](https://healthify.nz/health-a-z/h/hives \"Hives\") or [eczema](https://healthify.nz/health-a-z/e/eczema \"Eczema\").\n  * Read more about[emollients](https://healthify.nz/medicines-a-z/e/emollients-moisturisers)[steroid creams](https://healthify.nz/medicines-a-z/s/steroid-creams-and-ointments).\n\n\n**Steroid tablets**\n  * Steroid tablets can also be used to treat allergic symptoms such as hives and to reduce inflammation.\n  * A prescription from your healthcare provider is needed.\n  * Read more about[steroid tablets](https://healthify.nz/medicines-a-z/s/steroid-tablets).\n\n\n  \n**Adrenaline**\n  * Adrenaline is used in an emergency to treat [anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\").\n  * It is usually in the form of an autoinjector, called an EpiPen.\n  * EpiPens are easy to use and can be given by non-medical people.\n  * If you have been prescribed an EpiPen, your healthcare provider or pharmacist can teach you how to use it.\n  * Read more about[EpiPens](https://healthify.nz/medicines-a-z/e/epipen).\n\n\n####    \nAllergen immunotherapy (AIT)\nWhen medicines don’t provide enough relief, an option is immunotherapy. Immunotherapy may also be an option if your symptoms are severe and the allergen is difficult to avoid, such as with allergic rhinosinusitis or [allergic conjunctivitis](https://healthify.nz/health-a-z/a/allergic-conjunctivitis \"Allergic conjunctivitis\"). \nThe aim of immunotherapy is to make you develop tolerance to a particular allergen. It works by changing the way your immune system reacts to allergens. Your doctor will give you an allergen you are allergic to, either under your tongue, through your nose or by an injection. This will be repeated over a period of 3 to 5 years. \nImmunotherapy isn't suitable for everyone. Ask your healthcare provider or an allergy specialist about it. \n####  How can I prevent an allergic reaction? \nHere are some tips to avoid some common allergens and help minimise allergic symptoms.\n#### Dust mites\nYou can never get rid of all the dust mites in your house, but doing these things can help reduce their numbers:\n  * If possible, replace wall-to-wall carpets with hard flooring such as floorboards.\n  * Clean non-carpeted floors with a wet or electrostatic mop rather than using a vacuum cleaner.\n  * Clean carpets 2 to 3 times each week with a vacuum cleaner that has a suitable filter.\n  * Dust surfaces with a damp or electrostatic cloth 2 to 3 times a week.\n  * Remove fluffy, stuffed toys from your child's bedroom or wash them weekly in hot water. Putting soft toys in the freezer overnight kills mites but doesn't remove allergens.\n  * Remove soft, upholstered furniture from the bedroom.\n  * Select furniture that's upholstered in vinyl or leather rather than cloth.\n  * Aim for good ventilation throughout your house to avoid moist air build-up.\n  * Try to sleep with windows open to reduce the amount of moisture in the bedroom from breathing.\n\n\n####    \nPollen\n  * Keep the garden free of highly allergenic plants.\n  * Try to stay indoors at times when the pollen count is at its highest, eg, the early evening.\n  * Get someone else to mow your lawn.\n  * Close your bedroom windows at night to prevent pollen entering.\n  * Wear wrap-around sunglasses to avoid pollen getting into your eyes.\n  * Have a shower and wash your hair at night to wash away pollen you may have ‘collected’ during the day.\n  * Dry your clothes inside or in a tumble drier to avoid getting pollen on them.\n\n\n####    \nAnimal dander\n  * Keep pets outside, if possible.\n\n\n####    \nSkin allergies\n  * Avoid strong soaps, perfumes and household cleansing products that may irritate sensitive skin.\n  * Make sure jewellery and watches don't contain nickel, and are suitable for sensitive skin.\n\n\n####    \nInsect bites and stings\n  * Make sure you wear footwear outdoors.\n  * Cover your arms and legs.\n  * Don't make sudden moves when bees or wasps are around.\n  * Avoid strong perfume as it can attract insects.\n  * Wear gloves when gardening.\n  * Use insect repellent.\n\n\n####    \nFood allergies\nIf you have food allergies, know what they are and avoid those foods. A consultation with a dietitian can help you work out how to do this and still have a healthy, balanced diet. Ask your healthcare provider for a referral to a dietitian. Read more about [food allergies](https://healthify.nz/health-a-z/f/food-allergies).\n####  How can I care for myself with allergies? \n#### Avoid allergies\nIt's not always practical to avoid the allergens you are allergic to. However, some things you can do include:\n  * being careful about what you eat if you have food allergies\n  * avoiding exposure to pets if you have animal allergies\n  * keeping your home warm and dry if you have mould allergies\n  * staying indoors and avoiding grassy areas if you have hay fever.\n\n\n####    \nCarry adrenaline\nIf you're at risk of life-threatening allergic reactions, carry adrenaline with you at all times. You also need to be trained in the correct use of an adrenaline auto-injector, EpiPen. Partners of adults should also be familiar with these devices.  \n  \nFor children with allergies, parents or caregivers (including at daycare and schools) should also be familiar with how to use the EpiPen. \n####    \nAllergic reaction action plan\nAllergic reactions can cause a variety of symptoms ranging from mild to moderate reactions, through to severe and life-threatening reactions ([anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")). You and your whānau need to be able to recognise the signs of an allergic reaction and anaphylaxis, and know what to do in an emergency.   \n  \nAn allergic reaction action plan is a written document that outlines what to do if you have an allergic reaction. \n  * Here are [plans from the Australasian Society of Clinical Immunology and Allergy (ASCIA).(external link)](https://www.allergy.org.au/hp/ascia-plans-action-and-treatment \"Open external link\")\n\n\nCarry your allergy action plan at all times or put your action plan somewhere you can easily find it in your home. If you don’t have an action plan, ask your healthcare provider to fill out one with you.\n####    \nWear a medical bracelet\nWear a medical bracelet stating what you are allergic to. This can be very helpful for health professionals when treating you.\n####    \nRemind your healthcare team\nAlways remind your healthcare provider or pharmacist about your allergies before starting any new treatment, including complementary, over-the-counter and herbal medicines.\n####  What support is available with allergies? \n[Allergy New Zealand(external link)](http://www.allergy.org.nz/ \"Open external link\") provides information, education and support for people with allergy, parents of children with allergy, teachers and health professionals. \n####  Related topics on Healthify \n[Anaphylaxis](https://healthify.nz/health-a-z/a/anaphylaxis \"Anaphylaxis\")  \n[EpiPen®](https://healthify.nz/medicines-a-z/e/epipen \"EpiPen®\")  \n[Allergy tips for school children](https://healthify.nz/health-a-z/a/allergies-tips-for-children-starting-school \"Allergy tips for school children\")  \n[Hay fever | Mate hei](https://healthify.nz/health-a-z/h/hay-fever \"Hay fever | Mate hei\")  \n[Hives | Mate kārawa](https://healthify.nz/health-a-z/h/hives \"Hives | Mate kārawa\")  \n[Food allergy topics](https://healthify.nz/health-a-z/f/food-allergy-topics \"Food allergy topics\")\n####  More information \nThe following links provide further information about allergies. Be aware that websites from other countries may have information that differs from New Zealand recommendations. \n[Allergy conditions(external link)](https://www.allergy.org.nz/conditions/ \"Open external link\") Allergy NZ  \n[Allergy(external link)](https://www.kidshealth.org.nz/allergy \"Open external link\")  \n[Allergies(external link)](https://www.healthinfo.org.nz/index.htm?overview-of-allergies.htm \"Open external link\")  \n[What is allergy?(external link)](https://www.allergy.org.au/patients/about-allergy/what-is-allergy \"Open external link\")  \n[Allergies(external link)](https://www.nhs.uk/conditions/allergies/ \"Open external link\")  \n[Allergies(external link)](https://patient.info/allergies-blood-immune/allergies \"Open external link\")  \n  \n\n#### Brochures\n[Action plan for allergic reactions(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2025/ASCIA_Action_Plan_Allergic_Reactions_2025.pdf \"Open external link\") Australasian Society of Clinical Immunology & Allergy, Australia, 2025  \n[Action plan for anaphylaxis – for use with EpiPen adrenaline autoinjectors(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2025/ASCIA_Action_Plan_Anaphylaxis_General_2025.pdf \"Open external link\") Australasian Society of Clinical Immunology and Allergy, Australia, 2025 [English(external link)](https://www.allergy.org.au/images/stories/anaphylaxis/2023/ASCIA_Action_Plan_Anaphylaxis_Red_EpiPen_2023.pdf \"Open external link\"), [Arabic(external link)](https://www.allergy.org.au/images/pcc/ana/Arabic_ASCIA_PCC_Anaphylaxis_2015.pdf \"Open external link\"), [Chinese Traditional(external link)](https://www.allergy.org.au/images/pcc/ana/Chinese_Trad_ASCIA_PCC_Anaphylaxis_2015.pdf \"Open external link\"), [Chinese Simplified(external link)](https://www.allergy.org.au/images/pcc/ana/Chinese_Simplified_ASCIA_PCC_Anaphylaxis_2018.PDF \"Open external link\")  \n[Allergies(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies.pdf \"Open external link\") Health Information Translations, US, 2016 [English(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies.pdf \"Open external link\"), [Arabic(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_ARA.pdf \"Open external link\"), [Chinese (simplified)(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_SCh.pdf \"Open external link\"), [French(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Fr.pdf \"Open external link\"), [Hindi(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Hindi.pdf \"Open external link\"), [Japanese(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Jp.pdf \"Open external link\"), [Korean(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Kor.pdf \"Open external link\"), [Nepali(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Nepali.pdf \"Open external link\"), [Russian(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Rus.pdf \"Open external link\"), [Somali(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_So.pdf \"Open external link\"), [Spanish(external link)](https://storage.googleapis.com/healthinfotranslations-pdfdocs/Allergies_Sp.pdf \"Open external link\")  \n[Allergy awareness resource for primary years(external link)](https://allergyfacts.org.au/be-a-mate/ \"Open external link\") Allergy and Anaphylaxis, Australia  \n[Allergies factsheet in multiple languages(external link)](https://www.healthinfotranslations.org/document/allergies/120994 \"Open external link\") Health Information Translations\n####    \nReferences\n  1. [Allergies(external link)](https://aucklandregion.communityhealthpathways.org/30857.htm \"Open external link\")\n  2. Calderon MA, Alves B, Jacobson M, Hurwitz B, Sheikh A, Durham S. [Allergen injection immunotherapy for seasonal allergic rhinitis(external link)](https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD001936.pub2/full?highlightAbstract=allergen%7Cseasonal%7Cimmunotherapi%7Cfor%7Crhinitis%7Callergic%7Callerg%7Cfour%7Cimmunotherapy%7Cseason%7Crhiniti%7Cinjection%7Cinject \"Open external link\") Cochrane Database of Systematic Reviews 2007;1:CD001936\n  3. [Assessing the efficacy of immunotherapy for desensitisation of peanut allergy in children(external link)(external link)](http://www.thelancet.com/journals/lancet/article/PIIS0140-6736\\(13\\)62301-6/abstract \"Open external link\") The Lancet, Volume 383, Issue 9925, Pages 1297–1304, 12 April 2014.\n  4. [Personal action plans for allergies(external link)](http://www.allergy.org.au/health-professionals/ascia-plans-action-and-treatment \"Open external link\") Australasian Society of Clinical Immunology and Allergy (ASCIA)\n\n\n####  Information for healthcare providers (+ VIDEO) \n#### Clinical resources\n_[Information for health professionals(external link)](https://allergy.org.au/hp \"Open external link\")_ Australasian Society of Clinical Immunology and Allergy (ASCIA)  \n[Information and links for health professionals(external link)](https://www.allergy.org.nz/education/health-professionals/ \"Open external link\")  \n[Laboratory investigation of allergic diseases(external link)](https://www.allergy.org.au/hp/papers/tests-in-the-diagnosis-of-allergic-diseases \"Open external link\")  \n[Skin prick testing guide for the diagnosis of allergic disease(external link)](https://allergy.org.au/hp/papers/skin-prick-testing \"Open external link\")  \n[Paediatric allergy clinical network(external link)](https://www.starship.org.nz/health-professionals/paediatric-allergy-clinical-network/ \"Open external link\")  \n[Specific allergen immunotherapy (AIT) environmental (inhaled) allergies(external link)](https://assets.ctfassets.net/uszvm6pv23md/6d1aWN2iT3ZoUpHyEyXf73/8a3541db2eca495bb8928284e66768b0/environmental_allergens.pdf \"Open external link\")  \n[Penicillin allergy in adults – bulletin for health workers(external link)](https://www.psnz.org.nz/Folder?Action=View%20File&Folder_id=225&File=Pencillin%20Allergy%20CDHB%20Bulletin%20-%20PDF.pdf \"Open external link\") Pharmaceutical Society of NZ  \n[Challenge penicillin allergies – poster for health workers(external link)](https://www.psnz.org.nz/Folder?Action=View%20File&Folder_id=225&File=Penicillin%20Allergy%20Posters%20-%20Healthcare%20Worker%20-%20PDF.pdf \"Open external link\") Pharmaceutical Society of NZ\nSee our page [Food allergy for healthcare providers](https://healthify.nz/healthcare-providers/f/food-allergies-hcps)\n####    \nContinuing professional development  \neLearning\n[Health professionals e-training(external link)](https://allergy.org.au/hp/hp-e-training \"Open external link\")  \n[Allergies – when the immune system backfires(external link)](https://www.futurelearn.com/courses/allergies \"Open external link\")\n####    \nVideos and webinars\n**Video: Goodfellow Unit Webinar: Managing childhood allergies**\n(Goodfellow Unit Webinar, NZ, 2018)\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[![Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Sara Jayne Pietersen, FRNZCGP, Auckland\nLast reviewed: 17 Jun 2025\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/allergies \n![image](https://healthify.nz/assets/Uploads/image.png)\n",
  "metadata": {
    "source": "healthify",
    "crawledAt": "2025-10-04T03:24:25.120341Z",
    "letter": "a",
    "slug": "allergies"
  }
}
