{
  "url": "https://healthify.nz/health-a-z/a/allergy-dust-mites/",
  "title": "Allergy Dust Mites",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nReviewed by: Dr Karen Lindsay, Rheumatologist, Clinical Immunologist and Allergist, Rheumatologist/Immunologist, Auckland DHB \nLast reviewed: 11 Feb 2022\nPage last updated: 14 Jul 2022\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/allergy-dust-mites \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Allergy due to dust mites\n### Key points about dust mite allergy\n  * Many people with asthma, eczema and hay fever (allergic rhinitis) are allergic to a protein found in the microscopic waste of dust mites.\n  * It is the most common cause of year-round allergy symptoms.\n  * Dust mite allergy can be diagnosed with a skin prick test or blood test. \n  * Antihistamines help manage the condition.\n  * There are a few easy steps you can do to reduce house dust mites, such as hot washing (>60 degrees Celsius) bedding each week and keeping your home well-ventilated and dry.\n  * If dust mite allergy continues to be a problem, consider desensitisation therapy.\n\n\n![Kiwi bach Wikimedia Commons ](https://healthify.nz/assets/NZ-outdoors/Kiwi-bach-Wikimedia-Commons-.jpeg)\n####  What are dust mites? \nHouse dust mites are tiny bugs, too small to see without a microscope. They are present wherever people live. They thrive in warm, moist places such as mattresses, bedding and carpets, and feed mainly on flakes of dead skin, which humans constantly shed.\n  * House dust mite may be more common in NZ than most other countries due to the climate.\n  * There are two species in New Zealand, called D. Pteronissinus and D. Farinae, and both usually cause problems.\n  * Dust mites don't bite or pass on disease.\n  * They are only a problem to people who are allergic to their waste.\n  * A female dust mite can lay up to 300 eggs during its short 80-day lifespan.\n  * During its lifespan, a single dust mite can produce as much as 200 times its body weight in waste.\n  * Within the waste is a protein that is an allergen – a substance that starts an allergic reaction in many people.\n\n\n####  What are the symptoms of dust mite allergy? \nIf you have an allergy to dust mites, you will have hay fever-like symptoms all year round, such as runny nose, sneezing, sinus congestion.  \n  \nSigns that you might have an allergy to dust mites include:\n  * wheezing when you are vacuuming, dusting or spring cleaning\n  * allergy symptoms like runny or blocked nose or itchy eyes all year\n  * wheeze or cough when you enter a dusty room or house\n  * itchy nose, mouth, eyes, throat or skin\n  * puffy swollen eyelids \n  * asthma symptoms during the night or first thing in the morning\n  * improvement when travelling to drier, hotter climates like Australia. \n\n\n####  What are the complications of dust mite allergy? \n#### Allergic rhinonconjuncitivitis\nDust mite allergy can cause you to have itchy eyes and nose, sneezing, blockage, and keratoconus (change in shape of the cornea on the front of the eye), from continuously rubbing the eyes. It can also make your asthma symptoms more difficult to control if you also have asthma. \n#### Asthma\nPeople with dust mite allergy and asthma often have difficulty managing asthma symptoms. ",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.693314+00:00",
    "source": "healthify"
  }
}