{
  "url": "https://healthify.nz/health-a-z/a/angina/",
  "title": "Angina",
  "content": "Angina is caused by a temporary reduction in the blood flow to part of your heart muscle, a heart attack is caused by an actual blockage.\nAngina doesn’t damage your heart muscle but a heart attack causes permanent damage.\nAngina is usually eased fairly quickly by resting and using GTN spray, but with a heart attack the pain can last longer than 15 minutes and rest and GTN spray doesn’t help.\n**If you think you might be having a heart attack, call 111 for an ambulance.  \n  \n**\n![Characteristics of angina and a heart attack](https://healthify.nz/assets/Infographics/Angina-or-heart-attack-HN-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: Healtify He Puna Waiora_\n####  How is angina diagnosed? \nSee your healthcare provider if you've had an episode of chest pain or are concerned about angina. They may ask about:\n  * your symptoms – what you experienced, when they happened and what you were doing at the time, and if anything makes them better or worse\n  * your lifestyle, eg, what your diet is like and whether you smoke\n  * whether heart problems run in your family.\n\n\nThey may also measure your:\n  * blood pressure\n  * weight\n  * blood glucose and cholesterol, along with other blood tests, including a full blood count and troponin level (which indicates if there’s damage to your heart muscle).\n\n\nIf they think you might have angina, they may refer you to hospital for further tests to confirm the diagnosis.\n#### Further tests\nTo confirm if you have angina and assess your risk of more serious problems such as heart attacks or stroke, you may have one or more of the following:\n  * An [electrocardiogram (ECG)](https://healthify.nz/health-a-z/e/electrocardiograph-ecg) – to check your heart's rhythm and electrical activity.\n  * An exercise ECG – an ECG that's recorded while you're exercising on a treadmill or stationary bike to assess your heart's response to stress or exercise.\n  * A [coronary angiography](https://healthify.nz/health-a-z/c/coronary-angiography) – a procedure that uses a special dye (contrast material) and X-rays to see how blood flows through the arteries in your heart.\n  * An [echocardiogram (ECHO)](https://healthify.nz/health-a-z/e/echocardiogram) – a type of ultrasound which looks at your heart and how it's working. It can be performed when you're at rest or it may be done after being given medication which stimulates your heart, to see how it responds to stress.\n  * A [CT calcium score](https://healthify.nz/health-a-z/c/ct-calcium-score) test – a scan that looks at how your blood flows in the arteries of your heart. \n  * A myocardial perfusion scan – a scan that looks at how your blood flows to your heart muscle at rest and under stress. \n  * Blood tests.\n\n\nFind out more about the different [heart tests](https://healthify.nz/health-a-z/h/heart-disease-tests).\n####    \nWhat happens if I'm diagnosed with angina?\nIf you have stable angina, you’ll be given medicines to treat attacks when they occur and reduce the risk of further attacks. Your healthcare provider may refer you to a heart specialist (a cardiologist).\nIf you have unstable angina, you’ll be referred urgently to hospital for further tests and treatment, which may include surgery. You’ll need medicines to prevent blood clots and reduce your risk of having a heart attack or stroke. \n####  How is angina treated? \nA combination of medicines and a healthy lifestyle can help stop angina attacks and reduce the risk of further problems such as a heart attack.\n  * You may need to take several medicines to control your angina.\n  * Adopting a [heart-healthy lifestyle](https://healthify.nz/health-a-z/h/heart-disease-risk-factors) will help prevent further damage.\n  * Surgery may be recommended if medicines and lifestyle changes don't help.\n\n\n####    \nMedicines for angina\nThere are a variety of medicines for angina, which work in different ways. Medicines are used together with healthy lifestyle choices such as eating a healthy balanced diet, maintaining a healthy weight and exercising regularly.\nThe following are examples of the medicines used to ease and prevent chest pain and reduce your chances of further heart problems. Not everyone with angina will be prescribed the same medicines. Your healthcare provider will prescribe the medicines that work best for you.\n**Medicines to ease chest pain**\nGTN (glyceryl trinitrate) is available in Aotearoa New Zealand as a spray. It’s used to ease chest pain and provides rapid relief from angina symptoms. You spray it under your tongue so that it works quickly.\n  * GTN works by widening blood vessels, letting more blood and oxygen reach your heart, which reduces strain on it and makes it easier for it to pump blood.\n  * It can also be used if you’re going to do something that triggers angina pain, such as exercise or climbing stairs.\n  * Always carry your GTN spray with you and know how to use them. Read more about [GTN spray](https://healthify.nz/medicines-a-z/g/glyceryl-trinitrate-spray). \n\n\n**Medicines to prevent angina**\nThe following are examples of medicines used to prevent chest pain and angina symptoms from happening. They must be taken every day on an ongoing basis.\n  * **Beta-blockers** such as metoprolol and bisoprolol reduce the work your heart has to do, so it needs less oxygen. This helps prevent angina. Read more about [beta-blockers](https://healthify.nz/medicines-a-z/b/beta-blockers).\n  * **Calcium channel blockers** such as amlodipine or felodipine are used when beta-blockers are not suitable, such as if you have angina due to blood vessel spasm, or asthma. Read more about [calcium channel blockers](https://healthify.nz/medicines-a-z/c/calcium-channel-blockers). \n  * **Isosorbide mononitrate** works by widening blood vessels, letting more blood and oxygen reach your heart. This reduces strain on your heart and makes it easier for it to pump blood. It can be used when beta-blockers or calcium channels are unsuitable, or can be used in combination with these if they're not working well enough. Read more about [isosorbide mononitrate](https://healthify.nz/medicines-a-z/i/isosorbide-mononitrate). \n\n\n**Medicines to reduce further heart problems**\nIf you have angina you’re at high risk of having serious heart problems such as a heart attack. To reduce your risk of heart problems and stroke, your healthcare provider may prescribe other medicines including:\n  * medicines to lower your [cholesterol](https://healthify.nz/health-a-z/c/cholesterol-high) such as [statins](https://healthify.nz/health-a-z/a/angina)\n  * blood thinning medicines that reduce the chance of blood clots developing such as [aspirin](https://healthify.nz/medicines-a-z/a/aspirin-low-dose)\n  * medicines to control your blood pressure\n  * medicines to control your diabetes.\n\n\nRead more about [medicines used for heart problems](https://healthify.nz/medicines-a-z/c/cardiovascular-medications).\n####    \nSurgery for angina \nIf medicines and lifestyle changes aren't helping control your angina, or if you have unstable angina, surgery may be recommended.\nThe 2 main types of surgery for angina are:\n  * [coronary artery bypass surgery (CABG)](https://healthify.nz/health-a-z/c/coronary-artery-bypass-surgery) – where a section of blood vessel from another part of your body is used to re-route blood around a narrowed or blocked artery\n  * percutaneous coronary intervention (PCI) – widening of a narrowed section of artery by use of a stent (a tiny piece of tube). \n\n\nAn X-ray of the coronary arteries (coronary angiography) is used to decide whether CABG or PCI is appropriate.\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps), [nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps), [blood pressure apps](https://healthify.nz/apps/b/blood-pressure-apps), [diabetes apps](https://healthify.nz/apps/d/diabetes-apps) and [meditation and mindfulness apps](https://healthify.nz/apps/m/meditation-and-mindfulness-apps).\n####  How can I improve my heart health? (+ APPS) \n#### A healthy lifestyle to help prevent further heart damage\nAngina is a sign that your heart isn't healthy. Medicines and surgery can help with symptoms but they're not a cure for heart disease. The best way to help prevent further damage is to make healthy lifestyle changes.\nTo improve your heart health:\n  * cut down on saturated (animal) fats and salt\n  * eat more fruit, vegetables and wholegrain cereals\n  * don't smoke\n  * limit your alcohol intake\n  * have your blood pressure checked regularly\n  * build regular physical activity into your week\n  * maintain a healthy bodyweight\n  * develop ways to cope with stress. \n\n\n",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.119134+00:00",
    "source": "healthify"
  }
}