{
  "url": "https://healthify.nz/health-a-z/a/anal-fissure/",
  "title": "Anal Fissure",
  "content": "Other symptoms include:\n  * blood on toilet paper. This may be the only symptom if the tear is mild.\n  * tearing sensation during bowel movements\n  * irritation or itching around the tear\n  * a small lump or skin tag around your anus.\n\n\n####  What are the causes of anal fissures? \nDamage to the skin around your anus from over-stretching is the most common reason why an anal fissure develops. They can be caused by various factors such as:\n  * constipation (passing dry, hard poo, particularly if its large) or straining during bowel movements\n  * repeated diarrhoea (runny poo)\n  * pregnancy, childbirth and after delivery (postpartum period)\n  * sexually transmitted infections ([STIs](https://healthify.nz/health-a-z/s/sexually-transmitted-infections-stis)), particularly HIV, syphilis, and herpes simplex\n  * anal intercourse\n  * [Crohn's disease](https://healthify.nz/health-a-z/c/crohns-disease), anal cancer,[tuberculosis](https://healthify.nz/health-a-z/t/tuberculosis)[chemotherapy](https://healthify.nz/medicines-a-z/c/chemotherapy)\n\n\nWhen a fissure develops, the muscles inside the anus (internal anal sphincter) go into spasm which can cause further tearing and cutting off of blood flow making healing more difficult.  \n  \nWith proper treatment, an anal fissure is a curable problem and doesn't go on to form cancer.\n####  How are anal fissures diagnosed? \nIf you have any of the symptoms above, you need to visit your doctor.\nThey will assess your symptoms and look at the skin around your anus to make a diagnosis. If there is an obvious fissure then usually a rectal exam is not required (inserting a gloved finger into the anus). If a fissure isn't visible but you have bleeding, and there is no obvious haemorrhoid to explain the bleeding, then they may arrange some tests such as a [colonoscopy](https://healthify.nz/health-a-z/c/colonoscopy).\n####  How are anal fissures treated? (+ APPS) \nMost fissures can be treated simply and heal within a few weeks. Many fissures will heal on their own without medical treatment. However medical treatment increases the success rate.\n#### Ease and prevent constipation\nSoft stools will be less likely to open the fissure and cause pain. Increase the fibre in your diet by eating more vegetables, fruits, wholegrain breads and cereals. Learn more about [fibre in your diet.(external link)](https://colorectal.co.nz/wp-content/uploads/2014/08/Information-on-high-fibre-diet.pdf \"Open external link\")\nYou can also consider using commercially available fibre supplements such as psyllium (Metamucil and Konsyl D). These help by absorbing water into the stools (poo) in your bowel to soften them and improves the regularity of passing them. They are also called bulk forming laxatives. ",
  "chunkIndex": 5,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.198829+00:00",
    "source": "healthify"
  }
}