{
  "url": "https://healthify.nz/health-a-z/a/anencephaly/",
  "title": "Anencephaly",
  "content": "There’s no chance of survival.\n####  What support is available? \nTalking with a trained counsellor can often be helpful in times like this. You and your whānau will usually be offered counselling through your local Fetal Medicine Unit. You can also find out more at [Maternal Fetal Medicine Network(external link)](https://www.healthpoint.co.nz/public/wahi-rua-new-zealand-maternal-fetal-medicine/ \"Open external link\"). The Network is a national organisation with hubs in Auckland, Wellington and Christchurch. \nOther support options include:\n  * [Sands:(external link)](https://sands.org.nz/ \"Open external link\") A network of parent-run, non-profit groups supporting families who have experienced the loss of a baby.\n  * [Grief counselling](https://healthify.nz/support/g/grief-loss-support)\n  * Check with your general practice – some have access to free counselling through health improvement practitioners (HIPs). Read more about [HIPs](https://healthify.nz/hauora-wellbeing/h/health-improvement-practitioner). \n\n\n####  How can I prevent my baby having anencephaly? \nResearch shows that women who have a high level of [folic acid](https://healthify.nz/medicines-a-z/f/folic-acid) before they become pregnant, are less likely to have a baby with neural tube defects. For it to work, supplementation should begin before you try to get pregnant, but if you didn’t start folic acid before you were pregnant it's still worth starting it as soon as you find out you're pregnant.\n#### Wanting to get pregnant? \nAsk your GP or nurse for a free folic acid prescription. You can also get this from your local pharmacy. Health New Zealand | Te Whatu Ora recommends you take these folic-acid only tablets for at least 4 weeks prior to conception and for 12 weeks after conception to reduce the risk of NTDs. \nThe recommended dose of folic acid for most women is 0.8 mg per day. Women who are at higher risk of having a baby with a neural defect (eg, those who are taking certain medicines or who have had a previous child with a neural tube defect) should take 5 mg of folic acid a day for at least a month before getting pregnant.\nRead more about[folic acid in pregnancy](https://healthify.nz/hauora-wellbeing/f/folic-acid-and-folate).\nWatch ['The Short Life of Poe Elijah Williams a baby born with Anencephaly into Much Love' by Ozventures(external link)](https://www.youtube.com/watch?v=S4GEn3c89Zg \"Open external link\")   \n**Note:** You may find this video upsetting.\n####  If I get pregnant again will this baby also have anencephaly? \nFuture pregnancies are not usually affected. ",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.787411+00:00",
    "source": "healthify"
  }
}