{
  "url": "https://healthify.nz/health-a-z/a/autoimmune-diseases-overview/",
  "title": "Autoimmune Diseases Overview",
  "content": "# Autoimmune diseases overview\n### Key points about autoimmune diseases\n  * Autoimmune diseases are conditions in which your immune system mistakenly attacks your own cells causing damage to organs in your body.\n  * Different autoimmune diseases affect different parts of your body, so symptoms depend on which type of autoimmune disease you have and how it affects your body.\n  * Examples of autoimmune diseases are Coeliac disease, Crohn’s disease, lupus and rheumatoid arthritis.\n  * Most are long-term conditions and symptoms may come and go over time.\n  * Autoimmune diseases can't be cured, but there are treatments to help you manage your symptoms and slow down the progression of the disease.\n\n\n![Two sisters hugging at the beach after a swim](https://healthify.nz/assets/Maori-and-Pasifika-people-/two-sisters-hugging-at-the-beach-Canva.jpg)\n####  What are autoimmune diseases? \nA normal immune system helps you fight off harmful things such as infections, by killing bacteria or viruses that get into your body. \nIf you have an autoimmune disease, your immune system attacks your own healthy cells. This causes damage to different parts of your body depending on the areas that are affected. \nExamples of autoimmune diseases include those that affect your:\n  * gut, eg, [coeliac disease](https://healthify.nz/health-a-z/c/coeliac-disease-topics \"Coeliac disease topics\"), [Crohn's disease](https://healthify.nz/health-a-z/c/crohns-disease \"Crohn's disease\"), [ulcerative colitis](https://healthify.nz/health-a-z/u/ulcerative-colitis)\n  * joints, eg, [rheumatoid arthritis](https://healthify.nz/health-a-z/r/rheumatoid-arthritis \"Rheumatoid arthritis\"), [psoriatic arthritis](https://healthify.nz/health-a-z/p/psoriatic-arthritis)\n  * pancreas, eg, [type 1 diabetes](https://healthify.nz/health-a-z/d/diabetes-type-1-overview \"Diabetes – type 1\")\n  * thyroid gland, eg, [Graves' disease](https://healthify.nz/health-a-z/o/overactive-thyroid)\n  * nervous system, eg, [Guillain-Barre syndrome](https://healthify.nz/health-a-z/g/guillain-barre-syndrome \"Guillain-Barre syndrome\"), [multiple sclerosis](https://healthify.nz/health-a-z/m/multiple-sclerosis \"Multiple sclerosis\"), [myasthenia gravis](https://healthify.nz/health-a-z/m/myasthenia-gravis)\n  * skin, eg, [psoriasis](https://healthify.nz/health-a-z/p/psoriasis \"Psoriasis\")\n  * blood, eg, [pernicious anaemia](https://healthify.nz/health-a-z/p/pernicious-anaemia \"Pernicious anaemia\").\n\n\nThere are also autoimmune diseases that can affect many parts of your body, eg, [lupus](https://healthify.nz/health-a-z/l/lupus \"Lupus\"), [scleroderma](https://healthify.nz/health-a-z/s/scleroderma) and [Sjögren’s disease](https://healthify.nz/health-a-z/s/sjogrens-syndrome) (this mainly affects your salivary and tear glands).\nYou can have more than 1 autoimmune disease at a time.\nMost autoimmune diseases are chronic (long-term) conditions and symptoms might come and go over time. Generally autoimmune diseases don't affect how long you'll live.\n####  What are the causes of autoimmune diseases? \nIt's not clear why some people get autoimmune diseases, but there often appears to be a genetic predisposition. This means you have a higher chance of getting the condition if other members of your family also have it.\nYou also have a greater chance of getting a different autoimmune disease if a relative has an autoimmune disease, eg, one sibling (sister or brother) may have type 1 diabetes while another has coeliac disease. You can also have more than one autoimmune condition. \nIf you have certain genes, at some stage something in your environment may trigger the symptoms of an autoimmune condition. These factors include:\n  * an infection\n  * stress\n  * medicines\n  * diet\n  * UV radiation.\n\n\nIn general, autoimmune conditions are more common in women than men. Some autoimmune diseases are more common in certain ethnicities. Other factors such as smoking, your diet and being very overweight can increase your risk of developing autoimmune disease.  \n  \n\n![Information about autoimmune diseases](https://healthify.nz/assets/Health-A-Z/Miscellaneous/Autoimmune-disease-information-NIEHS-Wikimedia-Commons-665x443__ResizedImageWzYwMCw0MDBd.png)\n_Image credit: NIEHS via[Wikimedia Commons(external link)](https://commons.wikimedia.org/wiki/File:Autoimmune_disease.jpg \"Open external link\")_\n####  What are the common symptoms of autoimmune diseases? \nThe symptoms you have will depend on the parts of your body that are affected by the autoimmune disease that you have. For example, coeliac disease damages your small intestine so you may have gut symptoms such as diarrhoea (runny poo) or tummy pain. \nAs well as symptoms that are specific to your autoimmune condition, you may also have general symptoms, such as:\n  * tiredness or fatigue\n  * fevers\n  * loss of appetite\n  * loss of weight\n  * rash\n  * a feeling that something's not quite right. \n\n\n####    \nWhen to see a healthcare provider\nIt's a good idea to see your healthcare provider if:\n  * you experience any of these general symptoms often, and without a clear cause\n  * you have muscle, bone, or joint pain that’s not related to an injury, or pain in lots of areas of your body.\n\n\n####  How are autoimmune diseases diagnosed? \nYour healthcare provider will ask you questions about your symptoms and examine you. Depending on what they think is causing your symptoms, they may also order tests to find out the cause. They may then refer you to an appropriate medical specialist, eg, if you have coeliac disease, you’ll see a gastroenterologist, or if you have rheumatoid arthritis you’ll see a rheumatologist.\nAutoimmune diseases can be hard to diagnose as the symptoms can come and go. It can be useful to keep a diary of your symptoms over time. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:38.716567+00:00",
    "source": "healthify"
  }
}