{
  "url": "https://healthify.nz/health-a-z/a/acupuncture/",
  "title": "Acupuncture",
  "content": "Acupuncture is a very passive treatment, where someone is doing something to you. This is in contrast to active treatment where you take an active part in your own treatment, such as stretching and exercise.  \n  \nActive treatments are probably more effective than passive treatments. But passive treatments like acupuncture may have a role in helping you do those active treatments.  \n  \nIf you are considering acupuncture it is recommended you discuss this with the primary health provider treating your pain, such as your doctor or physiotherapist. \n####  Is there any misleading information I should look out for? \nAcupuncture websites and associated advertising such as billboards often say that acupuncture works for a variety of conditions. Acupuncturists may selectively present evidence that supports their view.  \n  \nThey may point to a 2017 report done by Australian acupuncturists called the Acupuncture Evidence Project. This report concluded that acupuncture could be effective in migraine, tension headache, hay fever, nausea and vomiting after surgery and chemotherapy, pain after surgery, low back pain and knee osteoarthritis.  \n  \nThis research was biased as it was funded by the Australian Acupuncture and Chinese Medicine Association, it did not have any medical reviewers from outside the acupuncture industry and it was not published in a medical journal. \nMany New Zealand acupuncture websites provide misleading or false information about the benefits of acupuncture. There have been many complaints to the Advertising Standards Authority that have been upheld, but the practice continues.  \n  \nFor example, 96% of New Zealand websites falsely claimed acupuncture could be effective for mental disorders, and 85% falsely claimed it could be effective for infertility.  \n  \nThe Acupuncture NZ website in August 2020 still listed acupuncture as a treatment for many conditions not supported by evidence, such as infertility, problems with your lungs, digestion, nerves, menopause, high blood pressure and mental health.\n####  Are all acupuncturists licensed and qualified? \nChinese medicine (including acupuncture, Chinese herbal medicine, and tui na massage therapy) is a regulated health profession under the HPCA Act, 2023. Chinese Medicine Practitioners and Acupuncturists, including those practicing Traditional Chinese acupuncture, are registered with the Chinese Medicine Council of New Zealand (CMCNZ).  \n  \n\n####  Is acupuncture treatment subsidised? \nTo be covered for acupuncture by a TCM provider under ACC, you first need to first see a non-TCM health provider who is authorised under ACC to make a diagnosis and lodge an initial claim (called an ACC45 form).  \n  \nAuthorised health providers include a doctor, nurse, osteopath, physiotherapist, podiatrist or chiropractor. ACC does not allow TCM providers to make diagnoses and lodge initial claims.  \n  \nOnce the claim has been accepted you can visit an acupuncturist with or without a referral. ACC subsidises the treatment for some but not all conditions. The average surcharge above the ACC subsidy is around $60 for a 30–45 minute treatment. If herbal medicine is offered then there is an additional surcharge. \nApart from ACC, a limited number of health insurance plans have acupuncture treatment included. You can also see an acupuncturist privately without any subsidy.\n####  Related topics on Healthify \n[Complementary and alternative medicine](https://healthify.nz/medicines-a-z/c/complementary-and-alternative-medicine \"Complementary and alternative medicine\")\n####  More information \n[Evidence for and against acupuncture(external link)(external link)](http://www.nhs.uk/Conditions/Acupuncture/Pages/Evidence.aspx \"Open external link\") NHS, UK, 2019  \n[Poking holes: ACC, acupuncture and the problem of proof(external link)(external link)](https://thespinoff.co.nz/science/19-06-2020/poking-holes-acc-acupuncture-and-the-problem-of-proof/ \"Open external link\") Jonathon Harper and Daniel Ryan, The Spinoff, NZ, 19 June 2020  \nRyan DJ. [Acupuncture, ACC and the Medicines Act(external link)(external link)](https://assets-global.website-files.com/5e332a62c703f653182faf47/5e332a62c703f615722fcb7b_Ryan%20FINAL.pdf \"Open external link\") NZ Med J. 2017 Dec 1;130(1466).  \n[Acupuncture evidence-based review(external link)(external link)](https://pnz.org.nz/Folder?Action=View%20File&Folder_id=472&File=Acupuncture%20EBR%201%20Page%20Summary.pdf \"Open external link\") ACC, NZ, 2018\n#### References\n  1. Melchart D, Weidenhammer W, Streng A, et al. [Prospective investigation of adverse effects of acupuncture in 97 733 patients(external link)(external link)](https://pubmed.ncbi.nlm.nih.gov/14718331/ \"Open external link\") Arch Intern Med. 2004 Jan 12;164(1):104-5.\n  2. The International Centre for Allied Health Evidence.[Effectiveness and safety of acupuncture interventions for the treatment of musculoskeletal conditions– technical report(external link)(external link)](https://www.acc.co.nz/assets/research/2b0c243f75/acupuncture-musculoskeletal-conditions-review.pdf \"Open external link\") Prepared for ACC, NZ, 2018\n  3. [Chinese clinical trials data 80 percent fabricated– government(external link)(external link)](https://www.rfa.org/english/news/china/clinical-fakes-09272016141438.html \"Open external link\") Radio Free Asia, 2016\n  4. McDonald J, Janz S.[The acupuncture evidence project – a(external link)(external link)](https://www.asacu.org/wp-content/uploads/2017/09/Acupuncture-Evidence-Project-The.pdf \"Open external link\") Australian Acupuncture and Chinese Medicine Association Australia, 2017\n  5. ",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:20.042457+00:00",
    "source": "healthify"
  }
}