{
  "url": "https://healthify.nz/health-a-z/a/allergy-dust-mites/",
  "title": "Allergy Dust Mites",
  "content": "* Treat any mould and the cause of the damp removed.\n  * Use extraction fans in bathrooms and in kitchens.\n  * Avoid drying washing indoors.\n  * Do not use humidifiers in bedrooms.\n\n\n#### Bedroom/bedding\n  * Wash bedding (sheets, pillow slips, duvets covers) once a week, using a long and hot (>60 degrees Celcius) wash cycle.\n  * Do not eat on the bed or soft furnishings.\n  * Do not keep animals in bedrooms.\n  * Use dust mite covers on your bedding. These are a very efficient way of keeping the dust mite inside mattresses and stopping the food supply from entering into mite colonies. Plastic sheets are good only when they are brand new.\n  * Clean your bedroom twice a week with a damp cloth and mop. Avoid sweeping.\n  * De-clutter your bedroom – remove books, ornaments, silk plants and shelves from bedrooms.\n\n\n#### Carpets\n  * Carpets provide a great environment for dust mites. Remove wall-to-wall carpeting. Fixed carpets, especially those with thick underlay, harbour dust mites. Even the strongest vacuum cleaners cannot produce enough draft in the depth of the carpet piles to dislodge them. Rugs are the best way to go.\n  * If you can't live without a carpet, look for ones that are specially treated with an anti-microbial product.\n  * For vacuum cleaners to effectively remove dust mite particles, they must be fitted with a suitable filter (such as a HEPA filter), otherwise particles will just be spread throughout the room.\n\n\n#### Soft toys\n  * Soft toys are an ideal environment for dust mite. A good way to reduce dust mite in soft toys is freeze the toys in the freezer and then place them in sunlight for 6 hours or put them in the dryer for half an hour.\n  * Remove or limit the number of stuffed toys in the bedroom.\n\n\n#### General\n  * Boiling or heating materials to above 60ºC is efficient in killing the mites.\n  * The use of insecticide sprays is questionable and may be effective in reducing dust mite only for a short time.\n\n\n#### Treatment for dust mite allergy\nIf you are unable to avoid dust mites (which is difficult to do in New Zealand homes where dust mites thrive), you may need to talk to your doctor about medicines to help control the allergic reactions. These are called [antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines \"Antihistamines\") and come in different forms, including tablets, nasal sprays, eye drops and syrups. \nOther medicines include:\n  * [corticosteroid nasal sprays](https://healthify.nz/medicines-a-z/s/steroid-nasal-sprays \"Steroid nasal sprays\")\n  * [decongestants](https://healthify.nz/medicines-a-z/d/decongestants \"Decongestants \\(nasal\\)\")\n  * medicated or non-medicated eye drops (olapatidine, lomide)\n  * combination products that combine these medicines, eg, an antihistamine and a decongestant.\n  ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:25.693314+00:00",
    "source": "healthify"
  }
}