{
  "url": "https://healthify.nz/health-a-z/a/anaesthesia/",
  "title": "Anaesthesia",
  "content": "Before the procedure, your anaesthetist will discuss the best types of anaesthetic. They'll plan your anaesthetic and pain control with you, and will consider any preferences you have. Your anaesthetist will carefully monitor you during your operation and make sure you wake up comfortably afterwards. They may also help with pain relief after the procedure.\nAn anaesthetist is the only kind of doctor trained to use general anaesthetics. Anaesthetists work with anaesthetic technicians and nurses as a team during operations. Anaesthetists also specialise in chronic pain management, and work in pain clinics. They often care for patients in intensive care units and during resuscitation in hospitals.\nHealthcare providers such as GPs, emergency department and orthopaedic doctors and nurses, nurse practitioners and paramedics use local and regional anaesthetics and sedation too.\n####  How can you prepare for anaesthesia? (+ VIDEO) \nOnce surgery is offered, the hospital will ask you to fill out a health questionnaire. It will ask about:\n  * other medical conditions\n  * previous anaesthetics\n  * any problems or concerns you have about anaesthesia\n  * what medicines you're taking\n  * your home and whānau and friends who may be involved with your care around the time of surgery.\n\n\nYou may have a phone call or be invited for a face-to-face preoperative assessment. The healthcare team will use this information to give you the best and safest anaesthetic and plan for your post-operative care including going home and what happens afterwards. This is a good opportunity to discuss your concerns.\nAll this information is used to advise you about preparing for surgery including stopping smoking, what medicines to take and when to stop eating and drinking. \n####    \nVideo: Preparing for your anaesthesia \n  \n(ANZCA, 2019)\n####  What are the side effects of anaesthetics? \nLike all medicines, anaesthetics can cause side effects, but they don't last very long. Common side effects of general anaesthesia and some of regional anaesthesia include:\n  * feeling sick (nausea) or vomiting\n  * headache\n  * sore throat and dry lips\n  * dizziness and feeling faint\n  * feeling cold or shivering\n  * itchiness\n  * pain and bruising at the injection site\n  * difficulty passing urine (pee)\n  * aches and pains.\n\n\n####  Are there any risks and complications? \nHaving an anaesthetic is usually safe, and major problems are rare. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:28.659418+00:00",
    "source": "healthify"
  }
}