{
  "url": "https://healthify.nz/health-a-z/a/anxiety-young-people/",
  "title": "Anxiety Young People",
  "content": "It’s tempting to run away from or avoid the thing you’re finding threatening.\nThis helps for a while but in the longer term it can make your anxiety worse as you get more worried, feel even more like you can’t cope and lose confidence.\nYou may also try to find ways of managing your anxiety which aren’t healthy or helpful – [self-harm](https://healthify.nz/health-a-z/s/self-harm), drinking alcohol or finding more ways to avoid the situation. This can become a cycle you get stuck in.  \n  \n\n![Cycle of anxiety where avoidance makes anxiety worse](https://healthify.nz/assets/Infographics/Anxiety-cycle-HN-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Healthify He Puna Waiora_\n####    \nReversing the cycle\nIt’s possible to create a positive cycle to help you control your anxiety. If you begin to face the potential threat, rather than finding ways to avoid it, your anxiety symptoms might get worse at first but then they begin to reduce. As you find better ways to manage your symptoms, you’ll get more confident and the next time it won’t be as difficult. \n####  What can I do to manage my anxiety? (+ APPS + VIDEO) \nThe choices you make every day about how much you move, what you eat, how much sleep you get, whether you take time to relax and whether you smoke or drink are all important for reducing anxiety.\n####    \nTalk about it\nFind somebody you trust to talk to about how you’re feeling. It might be a friend, a member of your whānau, a teacher or a school nurse or counsellor. They can help you make sense of what’s going on and get support if you need more help.\n####    \nGet to know yourself\nKnowing what triggers your anxiety and finding out how you feel, physically and emotionally, can help you understand yourself and how anxiety affects you. Take note of your ‘self-talk’ – the feedback you give yourself or the thoughts you have about yourself when something happens to make you feel anxious. This can help you know what you need to change to help manage your anxiety.\n####    \nBe aware of avoidance\nYou may want to avoid the situation you’re feeling anxious about and that might work at first but it won’t make it any better the next time the situation comes up. Try to find ways to manage your anxiety so you can face what you fear – it mightn’t be as bad as you thought!\nBelow are some things that can help you manage your anxiety.\n####    \nExercise\nRegular exercise, particularly aerobic exercise, such as walking, swimming or running, is an excellent way of managing [stress ](https://healthify.nz/health-a-z/s/stress)and tension. Bodies need to move, not sit most of the day. Being active for 30 minutes a day or more is one of the best things you can do to improve your mental and physical health. Exercise encourages your brain to release neurochemicals which can improve your mood and make you feel calmer.\n####    \nDiet\nYour body and mind need good food to feel well. Try eating regular meals, starting with breakfast, and including more fruit and vegetables and more whole foods. Find out more about [healthy eating basics](https://healthify.nz/hauora-wellbeing/h/healthy-eating-basics).\nCaffeine and energy drinks can disrupt your sleep, speed up your heartbeat and increase anxiety. \n####  **  \n**Sleep\nWhile anxiety can affect your sleep, not getting enough sleep can also contribute to making you more anxious. Make sleep a priority. Follow our [sleep tips](https://healthify.nz/hauora-wellbeing/s/sleep-tips) to help with this.\n####    \nRelaxation\nTaking time to relax each day helps to reduce anxiety. Learn relaxation and breathing exercises or try meditation or yoga. Spend time [outside in nature](https://healthify.nz/hauora-wellbeing/l/let-nature-in-strengthen-your-wellbeing). Do things that you enjoy, make you feel comfortable or lift your mood. Learn more about [looking after your mental health](https://healthify.nz/hauora-wellbeing/m/mental-health-topics).\nA New Zealand website called Small Steps has some tools you might find helpful for:\n  * [identifying the signals(external link)](https://www.smallsteps.org.nz/app/identifying-signals \"Open external link\") that tell you you’re upset\n  * [deep breathing(external link)](https://www.smallsteps.org.nz/app/deep-breathing \"Open external link\") and [mindful watching(external link)](https://www.smallsteps.org.nz/app/mindful-watching \"Open external link\") to help you relax.\n\n\n####    \nUse grounding techniques\nThere are many different techniques you can use to help you feel calmer and more in control. They won’t all work for you so it’s good to try several and see which suit you best.\n",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:31.996570+00:00",
    "source": "healthify"
  }
}