{
  "url": "https://healthify.nz/health-a-z/a/anal-fissure/",
  "title": "Anal Fissure",
  "content": "Surgery has the highest success rate of all treatments but has the highest risks and so is done as a last resort. The surgical options include making a small cut in your anal sphincter muscle (sphincterotomy), a skin flap (V-Y advancement flap), and cutting out the fissure (subcutaneous fissurectomy). The sphincterotomy is the procedure of choice for most people needing surgery.  \n  \nFor Botox and sphincterotomy, both methods relax the anal sphincter muscle, give pain relief and allow the fissure to heal. Sphincterotomy works best to manage anal fissure in the long-term compared to Botox but has a small risk of causing fecal incontinence (poo or gas leaking out unintentionally). Many people have mild incontinence immediately after surgery, but it's rarely permanent.  \n  \nSome people are at high risk of incontinence after sphincterotomy, eg, if you've given birth to multiple children vaginally. In this instance your surgeon may recommend one of the other procedures.\n####  Are there risks if anal fissures are left untreated? \nAnal fissures are not usually harmful or dangerous. However, some people (mainly children) may avoid having bowel movements due to fear of pain. This avoidance can lead to worsening constipation and increased straining during bowel movements, which makes the fissure worse or creates new fissures. To prevent this, it's important to address the underlying issues and encourage regular, pain-free bowel movements.  \n  \nIn rare cases, an infection or fistula can develop as a complication of an anal fissure. A fistula is an abnormal connection that forms between the inside of the rectum and the skin, creating a new channel. It's essential to seek medical attention if you suspect an infection or fistula, as they may require additional treatment to prevent further complications. \n####  Related topics on Healthify \n[Constipation](https://healthify.nz/health-a-z/c/constipation-in-adults)  \n[Constipation in children](https://healthify.nz/health-a-z/c/constipation-in-children)  \n[Medicines and constipation](https://healthify.nz/medicines-a-z/m/medicines-and-constipation)  \n[Rectogesic](https://healthify.nz/medicines-a-z/g/glyceryl-trinitrate-rectal)\n#### Apps\n[Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps)\n####  More information \n#### References\n  1. [A quick guide to managing anal fissures(external link)](https://bpac.org.nz/bpj/2013/april/anal-fissures.aspx \"Open external link\") BPAC, NZ 2013\n\n\n## Need help now?\n[![Healthline logo in supporters block](https://healthify.nz/assets/Affiliate-Images/Healthline-Supporters-Block__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthy.org.nz/ \"Contact Healthline \")\n[!",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.198829+00:00",
    "source": "healthify"
  }
}