{
  "url": "https://healthify.nz/health-a-z/a/abortion/",
  "title": "Abortion",
  "content": "Surgical abortion is a simple procedure carried out to end a pregnancy. It is usually performed between 7 and 15 weeks of pregnancy but can be done later in some centres.\nDuring this procedure, a small tube is inserted into your uterus through your vagina and cervix. The pregnancy is then removed by gentle suction. This takes about 3–5 minutes and can usually be performed under a[local anaesthetic.](https://healthify.nz/health-a-z/a/anaesthesia \"Anaesthesia\") If the pregnancy is further on, or depending on the provider, a [general anaesthetic](https://healthify.nz/health-a-z/a/anaesthesia \"Anaesthesia\")\nRecovery after a surgical abortion is usually very quick. There is usually very little pain, and the bleeding and cramping are about the same as a period.\n####  Where does an abortion take place? \n  * An early medical abortion (in the first 9–10 weeks) usually takes place at home as long as you have access to a phone, and a way of getting to hospital if you need to in an emergency. Once you've had an appointment via [telehealth](https://healthify.nz/health-a-z/t/telehealth-faqs) at a community clinic or Sexual Wellbeing Aotearoa clinic you can collect the 2 types of medicine needed. \n  * For a later medical abortion, you will need to visit a clinic or hospital.\n  * For a surgical abortion, you'll need to visit a specialist clinic or hospital. Sometimes you need to have an appointment before you're booked in for surgery. You'll be able to go home the same day after surgery if it's done early (in the first 13–15 weeks), but you may need to stay overnight if it's done later in your pregnancy. \n  * You don't need a referral from your GP or other healthcare provider to have an abortion. You can use this link to [search for an abortion provider(external link)](https://decide.org.nz/en/find-a-provider/ \"Find an abortion provider in your area\") in your area. \n\n\n#### Does anyone else need to know?\nIt's your decision who you tell about your pregnancy or abortion, including your parents, whānau or sexual partner. Accessing an abortion is confidential, no-one will be told without your permission. It's a good idea to talk it over with someone who can support you if you feel you can. If you're having an early medical abortion at home, it's also recommended that you have a support person available throughout the process. \nRead more about [abortion and your rights(external link)](https://decide.org.nz/en/abortion-services/abortion-and-your-rights/#section_you-decide-who-knows \"Link to abortion and your rights\").\n#### Will there be protestors at the clinic or people seeing me go in?\nA law was recently passed in Aotearoa New Zealand so there are[Safe Areas(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Link to Safe Areas established for abortion services\") of up to 150 metres around some of the premises where abortion services are provided. There are currently [6 Safe Area providers(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas/safe-area-locations \"Safe Area locations NZ\") across the country. They are there to protect the safety, wellbeing, privacy and dignity of people – those who are accessing abortions or providing abortion services. This means it's illegal for anyone to:\n  * block an entrance to stop anyone entering or leaving\n  * take photos or videos that will cause distress\n  * approach you to provide information about abortion services (this doesn't include the service provider themselves)\n  * approach you to try and put you off accessing these services\n  * provide anti-abortion pamphlets or similar materials\n  * protest about matters relating to the provision of abortion services. \n\n\nIf anybody is doing any of these things within the safe area, make sure you report it to your abortion provider.\n####  What are the risks involved with an abortion? \nAbortion is a safe procedure, with fewer risks than pregnancy or childbirth. Most people have no complications during or after their abortion, however with any surgical or medical procedure there are some risks. Risks are lower for abortions at <12 weeks.\nThe most common risk for medical abortion is heavy bleeding or infection. This can be due to pregnancy tissue that hasn’t completely passed. Usually, further misoprostol (abortion medicine) or antibiotics are used to manage this. \nFor surgical abortions there's also a risk of bleeding and infection (lower than medical termination), and there's a very low risk of damage to your cervix or uterus.\nFor both procedures, there's a small chance the termination isn't successful. Further misoprostol medication or a surgical abortion will be recommended in that case. However, 99% of surgical terminations and 97–99% of medical terminations _are successful_. \nThere is no evidence to suggest that having an abortion will affect your ability to get pregnant in the future.\n####  Where can I find more information, and get support, if I am considering an abortion? \n  * If you're thinking about having an abortion, [DECIDE.org.nz(external link)](https://www.decide.org.nz/ \"Open external link\") has the information you need about abortion services, abortion care, and how to find a provider near you.\n  * Health New Zealand | Te Whatu Ora website has[information for women considering an abortion.(external link)](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/abortion-services-information-health-practitioners/safe-areas \"Open external link\")\n  * Healthline can be contacted on 0800 611 116. This free service is available 24 hours a day, 7 days a week. They have interpreters available.\n\n\n#### Decision-making support\nFor some women, the process of thinking about and going through with an abortion can be emotionally difficult. If you are struggling in this way, it is a good idea to seek counselling and advice from a qualified therapist. Free counselling is available to anyone considering an abortion in Aotearoa New Zealand, and is also available after you've had an abortion if you need it. \nYou can contact a healthcare provider to discuss your options, including continuing a pregnancy or having an abortion, and to access counselling that is unbiased and non-judgmental.\nCounselling is not mandatory – a healthcare provider cannot insist that you have counselling before providing abortion services.  \n  \nContact the New Zealand organisation [DECIDE(external link)](https://www.decide.org.nz/ \"Open external link\")\n####  What happens to the pregnancy tissue after an abortion? \nIf you are having an abortion at home, it is common to pass the miscarriage into the toilet, but you may want to collect the tissue for burial. If you have a surgical abortion, you can choose to have the pregnancy tissue returned to you, otherwise it will be cremated by the clinic or hospital services.\nYou might choose to bury the pregnancy tissue, returning the tissue to the whenua. Your abortion provider can provide more specific instructions on how to do this safely.\n####  What should I do after an abortion? \nTake pain relief as you need it to manage cramping (paracetamol or ibuprofen) and contact your abortion provider if you feel the pain is getting worse rather than better over time.\nUse pads rather than tampons or menstrual cups, and have showers rather than baths and avoid swimming (in spas, the ocean or swimming pools) for the first couple of weeks.  \n  \nIt's best to wait at least 2 weeks after an abortion before having sexual intercourse, to reduce the risk of infection. If you do have intercourse before then, you should use a condom to decrease the chance of infection.\nUse [contraception](https://healthify.nz/health-a-z/c/contraception). This is a good time to discuss contraception and choose a method that works for you. Remember that you can still get pregnant again within 2 weeks of a termination of pregnancy.\n####  Te Tiriti o Waitangi, Māori and abortion \nIn Aotearoa New Zealand, healthcare providers actively support Māori to make decisions that are best for them, in combination with the principles of Te Tiriti o Waitangi.\nThey seek to work in partnership with Māori wahine, including your whānau if you would like. ",
  "chunkIndex": 12,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:18.744080+00:00",
    "source": "healthify"
  }
}