{
  "url": "https://healthify.nz/health-a-z/a/angina/",
  "title": "Angina",
  "content": "You might experience an unpleasant feeling, tightness, pressure or weight on your chest, and sometimes a feeling of breathlessness. It usually only lasts a few minutes and can be relieved by rest and/or medicine.\nAlthough it's not usually life-threatening, it’s a warning sign that you could be at risk of a heart attack or stroke.\nIf your angina happens more often or gets worse, lasts longer or happens when you’re doing very little or resting, see your healthcare provider in the next 24 hours.\n####    \nVideo: What is angina?  \n  \n\n(British Heart Foundation, UK, 2019)\n####  What are the symptoms of angina? \nThe symptoms of angina are sometimes called an angina attack or episode. The main symptom is chest pain or discomfort.\n  * The pain may feel tight, dull or heavy and is usually felt across the centre of your chest.\n  * It may also be felt in either or both shoulders, your neck or jaw, down one or both arms and in your hands.\n  * You may get pain or discomfort in only one of these areas and not in your chest at all.\n  * Angina is usually brought on by physical exertion or stress.\n  * Angina usually stops within a few minutes of resting or taking angina medicines.\n\n\nAngina can also cause breathlessness, nausea (feeling sick), feeling sweaty, pain in your lower chest or belly that's similar to indigestion and fatigue. **O****lder people, people with diabetes and women are more likely to have these symptoms.**\nYou may get angina when you’re sitting down or even during the night. It’s often experienced at particular times of the day, such as first thing in the morning or late afternoon.\n####    \nTypes of angina\nThere are 2 main types of angina.\n  * **Stable angina** (the most common type) is when something, such as exercise, triggers your symptoms. The symptoms improve with medicines and rest.\n  * **Unstable angina** (the more serious type) is when attacks are more unpredictable. They can happen while you’re resting, last longer than 15 to 20 minutes and can continue even after resting and taking angina medicine (if you’ve used this before). It’s a sign that you could have a heart attack soon.\n\n\n####  Angina action plan – what to do if you have an attack \n#### What to do in an angina attack\nFollow this action plan if you have an angina attack\n  1. If you’re having angina symptoms, stop what you’re doing and rest. Tell someone how you’re feeling and use your glyceryl trinitrate (GTN) medicine – take 1 puff of your GTN spray or put 1 tablet under your tongue.\n  2. If you still have symptoms after 5 minutes, take 1 more puff of your GTN spray or put 1 more tablet under your tongue.\n  3. If you still have symptoms 5 minutes after taking the second dose of GTN, call 111 and ask for an ambulance. If a paramedic advises it, chew an aspirin while you wait.\n\n\nIf your symptoms are relieved, you can get back to your activities gently.\nIf your angina becomes more frequent or severe, lasts longer or happens when you are doing very little or resting, see your healthcare provider in the next 24 hours.\nIf you’re not sure what to do, you can call [Healthline(external link)](https://www.health.govt.nz/your-health/services-and-support/health-care-services/healthline \"Open external link\") on 0800 611 116 for free health advice at any time.\n####  What should I do if I have angina symptoms? \n#### Regular pattern of symptoms\nIf you get angina at predictable times (eg, in cold temperatures, walking up hills, while mowing lawns or showering, during sexual activity or at work) use your glyceryl trinitrate (GTN) spray a few minutes before doing that activity. If you’re experiencing angina symptoms every day, see your healthcare provider in case you need more, or different, treatment.\n####    \nChange in symptoms\nSee your healthcare provider within 24 hours if the pattern of your angina symptoms changes significantly in one or more of the following ways:\n  * Frequency – you get angina more often.\n  * Severity – your symptoms get worse.\n  * Duration – your symptoms last longer.\n  * Your symptoms occur when you're doing very little or you’re resting. \n\n\nContinue to use your medicine in the meantime. \n####  What causes angina? \nIn most cases, angina is caused by [coronary artery disease (CAD)](https://healthify.nz/health-a-z/c/coronary-artery-disease). Your coronary arteries supply blood to your heart muscle and CAD occurs when fatty deposits build up inside them. This causes narrowing of these arteries resulting in poor blood flow to your heart muscle. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.119134+00:00",
    "source": "healthify"
  }
}