{
  "url": "https://healthify.nz/health-a-z/a/anxiety-young-people/",
  "title": "Anxiety Young People",
  "content": "Some offer face-to-face meetings where you can talk about your difficulties and problems with other people. Many provide support and guidance over the phone or by email.  \n  \nAsk your healthcare provider about local support groups for anxiety in your area or [contact one of these support groups.](https://healthify.nz/support/a/anxiety-support)\n####    \nApps reviewed by Healthify\nYou might find some [mental health and wellbeing apps for rangatahi](https://healthify.nz/apps/m/mental-health-and-wellbeing-apps-for-teenagers-and-young-people) helpful.\n####    \nVideo: \nWhat exactly is anxiety, and why are today’s teenagers more anxious than previous generations? Neuro-educator Nathan Wallis reveals why the brain is more vulnerable to anxiety during adolescence. Teens and parents talk about ways to develop coping skills, build confidence and take back control.\n![](https://healthify.nz/assets/Screenshot-2025-03-19-142106__ResizedImageWzYwMCwzODRd.png)   \n(Attitude Live, NZ)  \n  \nTo view more videos of the same series, visit [Attitude Live: In my mind.(external link)](https://www.youtube.com/watch?v=sJMNpHoJ7Kg&list=PLAPx32oh7H1qTKlpCNQFuZuLrdhFfttLU \"Open external link\")\n####  What treatment is available if I am feeling anxious? \nThere are lots of things that can help you to manage your anxiety. As well as self-care (the things you can do for yourself) there are many other types of treatment and support available. For example, talking therapy, learning anxiety management techniques and medication.\nThe first step is to talk to somebody about how you’re feeling. This might be a school nurse or counsellor or a nurse or doctor at your medical centre. They can help you decide what’s the best thing to do next. They may refer you to somebody who specialises in mental health concerns for talking therapy. \n####    \nTechniques for managing anxiety\nBy talking to a professional who knows about anxiety and listens to what’s going on for you, you can learn some new skills that make a big difference in how well you manage your anxiety. Instead of the anxiety controlling you and what you do, you can take charge. Things you can do to break out of the cycle of anxiety include:\n  * understanding anxiety\n  * accepting and managing normal anxiety (and knowing when yours isn't)\n  * taking small steps towards doing the things you are worried about coping with, instead of avoiding them\n  * learning mindfulness\n  * taking good care of yourself each day\n  * dealing with issues that need addressing \n  * getting personal and professional support.\n\n\n####    \nMedication\nIf you’re anxiety is really bad and is affecting your daily life, you may be prescribed antidepressant medication to take – antidepressant medication also works for anxiety. It works best if you take it every day (not just when you’re feeling anxious) and if you have some talking therapy, such as [cognitive behavioural therapy (CBT)](https://healthify.nz/health-a-z/c/cognitive-behavioural-therapy), as well. This is because the medicine can help with the symptoms of anxiety but won’t make it go away – you need to deal with the reason for your anxiety as well.\nIt can take a few weeks for antidepressants to work fully and at first your symptoms can appear to get worse before you start to feel better. ",
  "chunkIndex": 4,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:31.996570+00:00",
    "source": "healthify"
  }
}