{
  "url": "https://healthify.nz/health-a-z/a/abuse-and-safety/",
  "title": "Abuse And Safety",
  "content": "* Nobody is allowed to have sexual contact with another person without permission.\n  * Nobody has the right to use intimidation, threats or mind games to gain power over another person.\n\n\n####  What are the different types of abuse? \nAbuse can be physical, sexual, psychological, financial or spiritual. Neglect is also a form of abuse.\n**Physical abuse includes** :\n  * hitting and punching\n  * biting, pushing, choking or pulling your hair\n  * making you drink or take drugs when you don't want to\n  * using or threatening to use weapons.\n\n\n**Sexual abuse includes** :\n  * forcing you to have sex or do other sexual acts you don't want to do\n  * touching you in a way you don't want\n  * frequently accusing you of sleeping with other people\n  * forcing you to watch porn or other sexual material against your will.\n\n\n**Psychological abuse includes** :\n  * making you feel like everything you do is wrong\n  * constantly criticising you or your friends\n  * humiliating you in front of your friends\n  * using unsafe driving to frighten you\n  * damaging property/walls/possessions to scare you\n  * stopping you from seeing friends and family so you feel isolated and alone\n  * blaming everything on you\n  * threatening to take the children away or hurt them\n  * stalking, following or checking up on you\n  * harming pets to punish you\n  * making you scared of what might happen next.\n\n\n**Financial abuse includes** :\n  * taking your money or property\n  * running up debts in your name\n  * misusing[power of attorney(external link)(external link)](https://www.consumer.org.nz/articles/power-of-attorney#:~:text=Power%20of%20attorney%20is%20an,to%20act%20in%20their%20name. \"Open external link\")\n  * pressuring you into paying money for things. \n\n\n**Spiritual abuse (attacks to your wairua or spirit) includes** :\n  * belittling your whakapapa, beliefs, traditions or culture\n  * not allowing you to participate in church, temple or other religious activities\n  * stopping you from expressing your spiritual or religious beliefs\n  * manipulating or coercing you to hold certain beliefs or carry out religious practices against your will\n  * inappropriately using spiritual or religious beliefs and practices to justify other types of abuse and violence. \n\n\n**Neglect includes** :\n  * not providing enough food, clothing or warmth\n  * leaving dependents alone or with someone who is unsafe\n  * not providing comfort, attention and love\n  * not providing appropriate or necessary medical treatment.\n\n\n!",
  "chunkIndex": 6,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:18.526604+00:00",
    "source": "healthify"
  }
}