{
  "url": "https://healthify.nz/health-a-z/a/appendicitis/",
  "title": "Appendicitis",
  "content": "If you gently press this area of your tummy it can make the pain worse. Coughing or walking may also worsen the pain.\nNot all cases of appendicitis follow this ‘classic’ course. In some cases, the pain is felt higher in your tummy, particularly if you are pregnant, or closer to your anus (back passage). In other cases the pain is quite mild and does not become severe until the appendix bursts.\nOther symptoms may include:\n  * fever\n  * nausea (feeling sick)\n  * vomiting (being sick)\n  * diarrhoea (runny poos)\n  * constipation (hard poos)\n  * loss of appetite.\n\n\nIf you have any of the symptoms above, contact your GP urgently.\n####  What are the complications of appendicitis? \nAppendicitis can cause complications, including:\n  * peritonitis\n  * abscess.\n\n\n**Peritonitis**\nIf you have appendicitis and don’t seek medical treatment, the inflammation can get worse and your appendix can burst. Once your appendix bursts, the entire lining of your abdomen (the peritoneum) can become infected with bacteria, and this can cause severe pain to your whole abdomen (tummy area). This is known as peritonitis (the inflammation of your peritoneum). Peritonitis is life threatening and needs to be treated immediately by antibiotics and surgery to remove your appendix.\nSymptoms of peritonitis can include:\n  * severe continuous tummy pain\n  * your tummy feels hard and tight\n  * your tummy appears swollen\n  * fever (high temperature)\n  * nausea (feeling sick) and vomiting (being sick)\n  * fast heartbeat\n  * shortness of breath or rapid breathing\n  * coughing\n  * any movement, particularly of your legs at your hips, is painful.\n\n\n**Abscess**\nAfter your appendix bursts, pus can collect around it and form a lump or mass where your body is trying to fight off the infection. This can cause pain around your right lower tummy area. If this happens, you will need surgery to drain the pus, as well as to take[antibiotic medicine](https://healthify.nz/medicines-a-z/a/antibiotics \"Antibiotics\").\n####  How is appendicitis diagnosed? \nYour GP or doctor will ask you questions related to your symptoms and examine you, pressing your right lower tummy to see if the pain gets worse. Your doctor may also order tests to confirm the diagnosis and rule out other conditions that can have the same symptoms.\nTests that may be done include:\n  * a[blood test](https://healthify.nz/health-a-z/b/blood-tests \"Blood tests\")\n  * a[pregnancy test](https://healthify.nz/health-a-z/p/pregnancy-screening-tests-and-checks \"Pregnancy screening tests and checks\")\n  * a[urine (pee) test](https://healthify.nz/health-a-z/u/urine-testing \"Urine testing\")\n  * a[CT scan](https://healthify.nz/health-a-z/c/ct-scan \"CT scan\").\n\n\n",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:33.042995+00:00",
    "source": "healthify"
  }
}