{
  "url": "https://healthify.nz/health-a-z/a/anxiety/",
  "title": "Anxiety",
  "content": "There are a range of treatments available, including self-management tools, talking therapy, and medicines. A good first step is to talk to your healthcare provider who will discuss these with you and together you can decide which is best for you. Or you can decide to start with a self-management programme or seeing a mental healthcare provider.\n####    \nSelf-management tools\nThere are many online resources designed to help you manage anxiety. Some are downloadable workbooks/courses, which are useful for whanau who prefer to work on paper. Others can be done online. Some are free, some have a cost\n  * [Just a Thought, NZ](https://healthify.nz/apps/j/just-a-thought) free online cognitive behavioural therapy course\n  * [SPARX, NZ](https://healthify.nz/apps/s/sparx) interactive game for young people\n  * [Beating the Blues(external link)](https://beatingtheblues.co.nz/ \"Open external link\") NZ an online course – needs your healthcare provider to register you.\n  * [Computer-assisted learning for the mind CALM(external link)](https://www.calm.auckland.ac.nz/ \"Open external link\") University of Auckland, NZ, free, downloads and audio files\n  * [eCouch self-help(external link)](https://www.ecouch.com.au/ \"Open external link\") Australia, interactive programme in modules\n  * [Anxiety(external link)](https://www.cci.health.wa.gov.au/Resources/Looking-After-Yourself/Anxiety \"Open external link\") Centre for Clinical Interventions, Australia, free downloadable information and worksheets\n\n\n#### Talking therapy\nThis is psychological therapy with a counsellor or [psychologist](https://healthify.nz/hauora-wellbeing/p/psychologist). They will help you understand what is happening in your body and your thoughts when you feel anxious (psychoeducation) and work with you on how to change it. For anxiety disorders [cognitive behavioural therapy](https://healthify.nz/health-a-z/c/cognitive-behavioural-therapy) is the type most often used, but your talking therapist might use another type such as acceptance and commitment therapy.\nEven though it seems scary, doing your therapy with a group of others having a similar experience works well too, and can be more supportive and less costly.\nYour GP or nurse practitioner can recommend a talking therapist, or you can find out from whānau or the [Mental Health Foundation(external link)](https://mentalhealth.org.nz/help/accessing-mental-health-services \"Open external link\"). In some situations there is funding for talking therapy, especially if you have a community services card.\n####    \nMedicines\nDepending on how severe your anxiety is and what you have already tried, your doctor may prescribe medicines for anxiety. Medicine is best used together with talking therapy. Medicines help with symptoms but working through underlying problems is usually needed for long-lasting change.\nAntidepressants, mainly selective serotonin reuptake inhibitors (SSRIs) are effective in treating [panic disorder](https://healthify.nz/health-a-z/p/panic-disorder \"Panic disorder\"), [social anxiety disorder](https://healthify.nz/health-a-z/s/social-anxiety-disorder \"Social anxiety disorder\") and generalised anxiety disorder. Examples of SSRIs include citalopram, escitalopram, fluoxetine, paroxetine, sertraline. In some people, venlafaxine may be used for panic disorder. ead more about[SSRIs](https://healthify.nz/medicines-a-z/s/ssri-antidepressants \"SSRI antidepressants\") and[venlafaxine](https://healthify.nz/medicines-a-z/v/venlafaxine \"Venlafaxine\").\nWhen starting these medicines, your healthcare provider will start you on a low dose and, if needed, will increase your dose slowly. This allows your body to get used to the medicine and reduces side effects. ",
  "chunkIndex": 11,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:32.177865+00:00",
    "source": "healthify"
  }
}