{
  "url": "https://healthify.nz/health-a-z/a/aids-hiv/",
  "title": "Aids Hiv",
  "content": "When you have acute HIV infection, you have a large amount of virus in your blood and you are very contagious. But people with acute infection are often unaware of being infected, because you may not feel sick right away or at all.   \n  \nTo know whether you have acute infection, you need to have blood tests. If you think you have been exposed to HIV through sex or drug use and you have flu-like symptoms, see your healthcare provider and ask for an HIV test.\n####    \nStage 2: Clinical latency (HIV inactivity or dormancy)\nThis stage is sometimes called asymptomatic HIV infection or chronic HIV infection.   \n  \nDuring this phase, HIV is still active but reproduces at very low levels. You may not have any symptoms or get sick during this time. If you aren’t taking medicine to treat HIV, this period can last a decade or longer, but you may move through this phase faster. You can still pass on HIV to others during this phase. At the end of Stage 2, your viral load starts to go up and your CD4 cell count begins to go down. You may begin to have symptoms as the virus levels increase in your body and you move into Stage 3.   \n  \nHowever, if you take HIV medicine as prescribed and get to and keep an undetectable viral load (or stay virally suppressed), you have zero risk of transmitting HIV to your HIV-negative sexual partners. If you take ART as prescribed, you may stay in this stage indefinitely and may not progress to Stage 3 of the infection.\n####    \nStage 3: Acquired immunodeficiency syndrome (AIDS)\nAIDS is the most severe phase of HIV infection. People with AIDS have badly damaged immune systems and they get an increasing number of severe illnesses, called opportunistic illnesses (eg, tuberculosis (TB), cryptococcal meningitis and severe bacterial infections).   \n  \nYou're diagnosed with AIDS when your CD4 cell count drops below 200 cells/mm or if you develop opportunistic illnesses. People with AIDS can have a high viral load and be very infectious.  \n  \nWithout treatment, people with AIDS typically live about 3 years. Common symptoms of AIDS include chills, fever, sweats, swollen lymph glands, weakness and weight loss.\n####  How do I know if I have HIV? \nThe only way to know for sure whether you have HIV is to get tested. ",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:23.427849+00:00",
    "source": "healthify"
  }
}