{
  "url": "https://healthify.nz/health-a-z/a/automated-insulin-delivery/",
  "title": "Automated Insulin Delivery",
  "content": "[](https://healthify.nz/health-a-z/i/insulin-pumps)\n####  What is an insulin pump? \nAn insulin pump is a small battery-operated device, used by people mainly with type 1 diabetes. It's a similar size to a small mobile phone and can be clipped to your belt or waistband, carried in your pocket or in a pouch.\n  * Insulin pumps consist of the pump itself, a disposable reservoir to store the insulin, and a disposable infusion set.\n  * The infusion set includes the tubing that connects the pump to a smaller fine tube (or cannula) which sits just under your skin. Read more about [how an insulin pump works](https://healthify.nz/health-a-z/i/insulin-pumps#how-does-an-insulin-pump-work).\n  * An insulin pump continuously releases small amounts of [rapid acting insulin](https://healthify.nz/medicines-a-z/i/insulin) to keep your blood glucose levels steady between meals and during sleep. (This replaces the long-acting insulin that most people inject once a day).\n  * The pump is also used to release insulin to your body when needed, such as during a meal or snack, to help manage your glucose levels.\n\n\nUsing an insulin pump can improve blood glucose management and reduce the number of severe hypoglycaemic events for people with type 1 diabetes compared to multiple daily injections.\nIt's important to remember that you must continue to check glucose levels using a [continuous glucose monitor (CGM)](https://healthify.nz/health-a-z/c/continuous-glucose-monitoring) or glucose meter.\nFrom 1 October 2024 Pharmac has made it easier to access insulin pumps in people who meet their criteria and have been assessed by a specialist diabetes services. \nThere are 2 insulin pumps which are funded – mylife YpsoPump and Tandem t:slim pump. Read more below about [which pumps are funded in Aotearoa New Zealand(external link)](https://healthify.nz/health-a-z/i/insulin-pumps/#which-insulin-pumps-are-funded-in-New-Zealand \"Open external link\").\nYou can also find information about [diabetes technology on KidsHealth(external link)](https://www.kidshealth.org.nz/diabetes-technology \"Open external link\").\n####  How does an insulin pump work? \nInsulin pumps consist of the pump itself, a disposable reservoir to store the insulin, and a disposable infusion set. The infusion set includes the tubing that connects the pump to a fine tube (or cannula) which sits just under your skin.\nAn automated insulin delivery system (AID) is when the pump is used together with a CGM **plus** an algorithm, that links the 2 devices together, enabling them to “talk” to each other. In this way, the pump can receive blood glucose readings from a CGM and calculate how much insulin to deliver based on your current and predicted glucose values. Read more about [automated insulin delivery (AID) system](https://healthify.nz/health-a-z/i/insulin-pumps#automated-insulin-delivery-system).\n#### How is the insulin pump connected to my body?\nThe pump is connected to your body through an infusion set, so the insulin can be delivered.\n  * The infusion set is a thin plastic tube that’s connected to a fine tube (or cannula) which sits just under your skin.\n  * The tube is inserted where you would give insulin injections, and is designed to be pain free.\n  * The tube needs to be changed every 3 days.\n  * You can remove the tubing when you have a bath, go swimming, or when you play sports. \n  * The plastic tube is also called 'insulin pump consumables'.\n\n\n#### How is insulin delivered through the pump?\nThe insulin pump holds insulin. An insulin pump is designed to copy how your pancreas would naturally release insulin. Insulin pump users deliver almost all of their insulin through their pump.\n  * The pump is programmed to give insulin at a continuous low rate during the day and night. This is called background insulin or basal insulin.\n  * It's also used to give additional insulin at mealtimes, by entering the number of grams of carbohydrate you've eaten into the pump. The pump then delivers extra insulin for meals – this is called bolus insulin. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:39.345570+00:00",
    "source": "healthify"
  }
}