{
  "url": "https://healthify.nz/health-a-z/a/abortion/",
  "title": "Abortion",
  "content": "# Abortion\n## Also known as a termination of pregnancy\n### Key points about abortion\n  * Abortion and related counselling services are free for anyone eligible to receive publicly-funded healthcare in Aotearoa New Zealand.\n  * There are 2 types of abortion available here: medical (taking pills) and surgical (a minor operation).\n  * Healthcare providers can provide abortion services up to and including 20 weeks of pregnancy. \n  * After 20 weeks, a second health practitioner is consulted, to decide if termination is clinically appropriate. \n  * If you're thinking about having an abortion, get advice and information from DECIDE (link provided below) and see a doctor or an organisation like Family Planning.\n  * It's up to you who you tell about the abortion, but having a support person can be really helpful.\n\n\n![Two women sitting on couch and talking while one comforts the other](https://healthify.nz/assets/Health-A-Z/Mental-health/Woman-comforting-friend-canva-950x690.jpg)\n####  What are my options if I am pregnant? \n![Worried young woman looks out the window](https://healthify.nz/assets/Healthy-Living/Women/worried-young-woman-looking-out-window-Canva__ResizedImageWzYwMCw0MzZd.jpg)\nImage credit; Canva\nIf you miss a period or have pregnancy symptoms, find out as soon as possible whether you are pregnant. This will give you more time to think about your options and seek advice about how you wish to proceed. Pregnancy tests can be purchased from pharmacies and supermarkets, or you can see your healthcare provider or Sexual Wellbeing Aotearoa for an appointment.\nFinding out you are pregnant is different for everyone and how you feel about it will depend on a number of factors. There are several options available to you:\n  * **Keeping the pregnancy**\n  * **Whāngai** – the Māori tradition of a child being raised by a relative or relatives who are not the birth parents, eg, grandparents or other whānau members. \n  * **Adoption** a permanent legal agreement where the adoptive parents have full parental rights and responsibilities.\n  * **Abortion**\n\n\nDeciding what to do when you are pregnant is a very personal decision. ",
  "chunkIndex": 0,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:18.744080+00:00",
    "source": "healthify"
  }
}