{
  "url": "https://healthify.nz/health-a-z/a/anencephaly/",
  "title": "Anencephaly",
  "content": "Screening tests can provide you with information about your baby’s growth and development. They can also tell you whether you or your baby are more likely to have a medical condition. Read more about [antenatal screening tests.](https://healthify.nz/health-a-z/p/pregnancy-screening-tests-and-checks)\n####  Screening tests used to diagnose anencephaly include:\n**Ultrasound scan:** In most cases, signs of anencephaly are observed at the 11 to14-week scan and, if not, will almost always be picked up at the 20-week scan.\n**Blood test:** If you have the second trimester maternal serum screening (a blood test taken between 14 and 20 weeks), one of the components measures how much alpha-fetoprotein (AFP) is in your blood. High levels of AFP may suggest the developing baby has a neural tube defect (eg, spina bifida or anencephaly) or some other developmental problem.\n#### Diagnostic tests\nIf any of the screening tests suggest there's a higher risk of a genetic condition or anencephaly, further diagnostic testing will be arranged through your local Fetal Medicine team. Diagnostic tests include [amniocentesis](https://healthify.nz/health-a-z/a/amniocentesis) or chorionic villus sampling (CVS).If anencephaly is confirmed, what this means for you and your whānau will be explained as carefully as possible. You will be given time to decide what to do next. You may choose to continue with or [terminate](https://healthify.nz/health-a-z/a/abortion)[ your pregnancy](https://healthify.nz/health-a-z/a/abortion).\nIf you choose not to have an ultrasound scan during pregnancy, anencephaly might not be diagnosed until after the baby is born.\nAnencephaly is clearly seen at birth. Most babies with anencephaly are stillborn. \n####  Can anencephaly be treated? \nSadly, there is no treatment. Because their brain hasn’t fully developed and lacks important parts, the baby dies before or shortly after birth. ",
  "chunkIndex": 2,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:29.787411+00:00",
    "source": "healthify"
  }
}