{
  "url": "https://healthify.nz/health-a-z/a/atrial-fibrillation/",
  "title": "Atrial Fibrillation",
  "content": "Use the index/first finger and middle finger of your other hand and place the pads of these fingers on the inside of your wrist. You should place them at the base of your thumb near where the strap of a watch would sit.\n  3. Press lightly and feel the pulse. If you can’t feel anything press slightly harder or move your fingers around until you feel your pulse.\n  4. Once you’ve found your pulse, continue to feel it for about 20-30 seconds. Feel the rhythm of the pulse and check if it’s regular or irregular.\n\n\nListen to these examples or regular and irregular pulse rhythms from the British Heart Foundation.\n  * [Regular pulse rhythm(external link)(external link)](http://soundcloud.com/bhf/heartbeatreg \"Open external link\")\n  * [Irregular pulse rhythm(external link)(external link)](http://soundcloud.com/bhf/heartbeatirreg \"Open external link\")\n\n\n####  How is AF diagnosed? \nIf you or your doctor thinks you have AF, they may check your pulse, blood pressure, how well hydrated you are and your temperature. They may do a blood test.  \n  \nAF is diagnosed using a simple, painless test called an[electrocardiograph (ECG).](https://healthify.nz/health-a-z/e/electrocardiograph-ecg \"Electrocardiograph \\(ECG\\)\")\n  * When you have an ECG, small patches connected to wires (electrodes) are placed on your chest to measure the electrical impulses given off by your heart.\n  * These electrical impulses are recorded on a piece of paper called an ECG strip.\n  * The abnormal pattern of electrical impulses seen in people with AF is easily detected by the ECG.\n\n\nHowever, if you have paroxysmal AF (episodes that come and then go away), your heartbeat may be normal at the time the ECG is recorded. To detect paroxysmal AF, you may need to have a special test called a Holter monitor test.\n  * A Holter monitor is a portable device that you wear under your clothes.\n  * It continuously records your heart's electrical impulses for at least 24 hours.\n\n\nAF can also be diagnosed using other electrical devices such as KardiaMobile, an Apple Watch or a wearable ambulatory ECG monitor. \nIf you have AF it's likely you'll need an [echocardiogram](https://healthify.nz/health-a-z/e/echocardiogram) (heart ultrasound) to decide on the best treatment.\n####  What are the treatment options for AF? \nThe treatment for AF varies from person to person depending on a number of factors. Treatment will depend on the severity of your symptoms, the cause and duration of your AF, and whether you have any underlying health problems. The main aims of treatment are to:\n  * prevent blood clots, therefore lowering your risk of having a stroke\n  * control your heart rate to restore a normal heart rhythm\n  * manage any elated problems or risks.\n\n\n####    \nMedication\n**Blood clot prevention**\nHaving AF puts you at high risk of having a stroke due to a blood clot lodging in a blood vessel that supplies your brain. So, preventing blood clots is one of the most important parts of treating AF.  \n  \nTo prevent blood clots, you may be prescribed a type of medicine called an anticoagulant such as[warfarin,](https://healthify.nz/medicines-a-z/w/warfarin \"Warfarin\") [dabigatran](https://healthify.nz/medicines-a-z/d/dabigatran \"Dabigatran\") or[rivaroxaban.](https://healthify.nz/medicines-a-z/r/rivaroxaban \"Rivaroxaban\") Anticoagulants are medicines that prevent blood clots from forming and stop existing clots from growing bigger. Because anticoagulants stop blood clots, they may cause bleeding. Your doctor will consider your risk of bleeding and whether anticoagulants are suitable for you. Read more about[anticoagulants](https://healthify.nz/medicines-a-z/a/anticoagulants-and-antiplatelets \"Anticoagulants\")preventing blood clots in people with AF.\n**Rate control**\nYou may be prescribed medicines to slow down the rate (speed) of your heart beating to a normal level. Medicines used to control heart rate include groups of medicines called beta blockers (eg,[metoprolol,](https://healthify.nz/medicines-a-z/m/metoprolol \"Metoprolol\") [bisoprolol](https://healthify.nz/medicines-a-z/b/bisoprolol \"Bisoprolol\") and[carvedilol](https://healthify.nz/medicines-a-z/c/carvedilol \"Carvedilol\")), alcium channel blockers ([diltiazem](https://healthify.nz/medicines-a-z/d/diltiazem \"Diltiazem\")[verapamil](https://healthify.nz/medicines-a-z/v/verapamil \"Verapamil\")) or [digoxin.](https://healthify.nz/medicines-a-z/v/verapamil \"Verapamil\")\n**Rhythm control**\nIf you are not doing so well on the usual rate control medicines, there are some other medication options, eg, [amiodarone,](https://healthify.nz/medicines-a-z/a/amiodarone \"Amiodarone\") sotalol and[flecainide.](https://healthify.nz/medicines-a-z/f/flecainide \"Flecainide\")\n**Related problems**\nYou may need treatment for [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high) or [heart failure](https://healthify.nz/health-a-z/h/heart-failure) which can happen with AF.\n####    \nOther treatment options\nInstead of medicines, there are other options that your healthcare provider or cardiologist might recommend for you which can restore your heart to a normal rate and rhythm. These procedures are usually done in hospital.\n  ",
  "chunkIndex": 13,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:37.262757+00:00",
    "source": "healthify"
  }
}