{
  "url": "https://healthify.nz/health-a-z/a/asthma-exercise/",
  "title": "Asthma Exercise",
  "content": "####    \nUse your reliever inhaler before activity\nMany people with asthma now use a single inhaler combining prevent medication with reliever medication. Take 1 or 2 puffs about 15 minutes before exercising.\nIf you're still using 2 separate inhalers, take 1 or 2 puffs of your[reliever medicine](https://healthify.nz/medicines-a-z/s/salbutamol)[Using a spacer](https://healthify.nz/medicines-a-z/s/spacers \"Spacers\") increases the effectiveness of[metered dose inhalers (MDIs)](https://healthify.nz/medicines-a-z/i/inhaler-devices).\nIf you exercise often and you need a dose of reliever before and during your session, ask your healthcare provider to reassess your[preventer medications](https://healthify.nz/medicines-a-z/b/budesonide-inhaler) as you may not yet be on the best possible treatment.\n####    \nBreathe – don't heave\nTaking slow deep breaths through your nose with the right breathing pattern can help people with EIA (see below).\n####    \nApps reviewed by Healthify\nYou may find it useful to look at some [Asthma apps](https://healthify.nz/apps/a/asthma-apps) and [Breathing apps](https://healthify.nz/apps/b/breathing-apps).\n####  Four steps to good breathing \n#### Breathe through your nose\n  * It is important to breathe through your nose as this warms, filters and moistens the air that enters your lungs.\n  * It also helps to regulate your breathing.\n  * Nose breathing may take practice, especially if you're not used to it.\n  * If your nose is blocked by hay fever, dust mite allergy or sinusitis, ask your doctor about nasal treatments.\n  * Controlling any allergies and clearing your nose can make a big difference to your daily life and to your asthma.\n\n\n####    \nUse your diaphragm to breathe\nYour diaphragm is a large muscle separating your lungs from your abdomen. Your diaphragm can work hard and never get tired. ",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:35.562793+00:00",
    "source": "healthify"
  }
}