{
  "url": "https://healthify.nz/health-a-z/a/atrial-fibrillation/",
  "title": "Atrial Fibrillation",
  "content": "It's a heart rhythm disorder and is more common in older adults. Because it affects how your heart pumps, it can make you feel tired, dizzy or lightheaded. \nIf you notice your heart has an irregular beat (an arrhythmia) it's important not to ignore it and to see a healthcare provider as atrial fibrillation can increase your risk of stroke or heart failure.\n#### Video: What is atrial fibrillation?\n(British Heart Foundation, UK, 2015)\n####  What causes atrial fibrillation? \nNormally, your heart beats about 60 to 100 beats per minute when you are at rest, or doing light activities. Usually all of the heart chambers work together in unison. If you have atrial fibrillation (AF), the electrical signals that control your heartbeat are abnormal. These signals cause the upper chambers of your heart (the atria) to beat unevenly and very quickly. In fact, the atria are racing so quickly that the lower heart chambers (the ventricles) can’t quite keep up, and so your heart doesn’t beat in the usual, coordinated way.\nThis results in an irregular and rapid heart rate, often ranging from 100 to 180 beats per minute. When this happens, the heart cannot pump blood around the body as well as it needs to.\n#### There are three different kinds of atrial fibrillation:\n  * **Paroxysmal AF**\n  * **Persistent AF**\n  * **Long-standing persistent or permanent AF**\n\n\nAF is a progressive disease, so it is not uncommon for people with paroxysmal AF to develop persistent or permanent AF over time. \n####  Who is at risk of AF? \nThe causes of atrial fibrillation are not always clear. However, there are a number of things that increase your risk of developing AF. Risk factors include:\n  * age – AF can affect adults at any age, but it is more common as people get older, particularly over 65 years\n  * [high blood pressure](https://healthify.nz/health-a-z/b/blood-pressure-high)\n  * heart disease like coronary artery disease or heart valve disease or heart failure\n  * heart attack\n  * being overweight or obese\n  * chronic obstructive pulmonary disease ([COPD](https://healthify.nz/health-a-z/c/copd \"COPD\"))\n  * diabetes\n  * drinking large amounts of alcohol over a long period of time\n  * genetics – atrial fibrillation can sometimes run in families\n  * overactive thyroid gland\n  * lung infections such as pneumonia\n  * [sleep apnoea.](https://healthify.nz/health-a-z/o/obstructive-sleep-apnoea \"Obstructive sleep apnoea\")\n\n\n####  What are the risks associated with AF? \nHaving AF puts you at higher risk of some serious conditions compared to people without AF. For example,\n  * you are 4–5 times more likely to have a[stroke](https://healthify.nz/health-a-z/s/stroke \"Stroke\")\n  * you are 3 times more likely develop[heart failure](https://healthify.nz/health-a-z/h/heart-failure \"Heart failure\")\n  * you are also more likely to have a heart attack or get [dementia.](https://healthify.nz/health-a-z/d/dementia \"Dementia\")\n\n\nTo reduce these risks it is important to treat your AF, even if you don't have AF symptoms (see below).\n### How does AF cause stroke?\nBecause the atria are beating unevenly and very quickly, they don’t pump blood through the heart properly. Blood can then pool in the heart and a blood clot may form. If the clot breaks loose and leaves the heart, it can travel via your blood vessels to other organs in your body. ",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:37.262757+00:00",
    "source": "healthify"
  }
}