{
  "url": "https://healthify.nz/health-a-z/a/anxiety-young-people/",
  "title": "Anxiety Young People",
  "content": "Some are **physical or sensory approaches** which use your environment and how you sense or feel it to keep you grounded in the here and now.\nSome examples are:\n  * Put both feet on the ground and stamp several times. Move your weight or wiggle your toes and concentrate on the feelings in your toes, feet and legs.\n  * Dip your face in cold water, or splash cold water on your face, it can help distract you from increasing anxiety.\n  * Listen to the sounds around you and identify what they are to help locate you in your environment.\n  * Pick up a stone or another small item nearby, notice it’s texture and weight and how it feels in your hand, whether it’s cool or warm.\n\n\nOthers are **mental exercises** to focus your mind and pull you out of an anxiety response.\nSome examples are:\n  * Name your family members, think about their ages and something special about them.\n  * Think about an ordinary, familiar activity and think through each of the steps involved in doing it.\n  * Play a category game. Choose a category (eg, animals or plants) and name as many things that match the category as you can in a minute or two.\n\n\nRead more about these and other [grounding techniques to help control anxiety(external link)](https://hr.jhu.edu/wp-content/uploads/JHEAP-Grounding-Techniques-to-Help-Control-Anxietypdf.pdf \"Open external link\").\n[The Huberman Lab(external link)](https://www.hubermanlab.com/ \"Open external link\") has podcasts on a range of neuroscience topics including one on [tools for managing stress and anxiety.(external link)](https://www.hubermanlab.com/episode/tools-for-managing-stress-and-anxiety \"Open external link\")\n**Music**\nAnother way of grounding yourself and calming your anxiety is to listen to music. It can trigger positive neurochemicals in your brain and slow your heart rate and breathing rate. It might help to choose some music that helps you process your emotions and build a playlist you can easily find to listen to when you need it. Read more about [music and mental health(external link)](https://anxiety.org.nz/resources/harmonising-music-and-mental-health \"Open external link\").  \n  \n\n![Young person listening to music through headphones](https://healthify.nz/assets/Healthy-Living/Rangitahi-teenagers/Teenager-listening-to-music-through-headphones-Canva-950x690__ResizedImageWzYwMCw0MzZd.jpg)   \n_Image credit: Canva_\n#### Smoking, alcohol and drugs\nSmoking and [alcohol](https://healthify.nz/hauora-wellbeing/a/alcohol-and-mental-health) have been shown to make feelings of anxiety worse. MDMA, methamphetamine and cannabis can cause anxiety. It’s best not to smoke, drink alcohol or use other drugs at all. If you need help to stop, talk to your healthcare provider or ring [Quitline(external link)](https://quit.org.nz/ \"Open external link\") for advice and support (call 0800 778 778 or text 4006).\n####    \nSupport\nBuild a support network – a few people you can go to when things are tough. There are also a range of support organisations. ",
  "chunkIndex": 9,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:31.996570+00:00",
    "source": "healthify"
  }
}