{
  "url": "https://healthify.nz/health-a-z/a/aphasia/",
  "title": "Aphasia",
  "content": "* Someone with aphasia may find it hard to talk, write, read, and understand what's being said.\n  * Aphasia affects each person differently and can be mild to severe. Someone who has aphasia might not have a physical disability, or appear to be any different from a person without aphasia.\n  * Communication difficulties may change from day to day – some days will be better than others. \n  * Being patient and finding the best ways to communicate with your loved one is an important part of aphasia treatment and recovery.\n  * Apraxia of speech may accompany aphasia. Apraxia is when you know what you want to say but your brain has trouble communicating with your speech muscles.\n\n\n####  What is aphasia? \nAphasia is the partial or total loss of the ability to articulate (put into words) ideas or understand spoken or written language. It results from damage to the brain caused by injury or disease. Aphasia may be accompanied by apraxia of speech – read more below.\nThis video provides a simple explanation of aphasia and how you can communicate better with someone who has it.\n#### Video: What is aphasia?  \n  \n\n(National Aphasia Association, US, 2018)\n####  What are the types of aphasia? \nAphasia is usually thought of as either fluent or non-fluent. The severity of aphasia can vary greatly, and each person’s aphasia is unique to them.\n#### Fluent aphasia\nPeople with fluent aphasia may talk easily but their speech lacks content and is difficult for other people to understand. They often think they're making sense to other people and aren't aware of the extent of their aphasia. People with fluent aphasia struggle to understand what other people say or write. Fluent aphasia is also known as Wernicke’s aphasia.\n#### Non-fluent aphasia\nPeople with non-fluent aphasia usually have difficulty finding words and may have effortful speech. They are usually aware of their own difficulties and their understanding of language is better than their ability to express themselves. Non-fluent aphasia is also known as Broca’s aphasia.\nThere are many ways of categorising and describing aphasia.\nThis diagram shows the location of Wernicke's and Broca's areas in the brain.\n![Motor and sensory regions of the cerebral cortex labelled in brain diagram](https://healthify.nz/assets/Health-A-Z/Neurological/Labelled-parts-of-the-brain-including-speech-areas-BruceBlaus-wikimedia-commons-950x690__ResizedImageWzYwMCw0MzZd.png)\n_Image credit: Medical gallery of Blausen Medical 2014 via[Wikimedia Commons(external link)](https://creativecommons.org/licenses/by/3.0 \"Open external link\")_\n####    \nPrimary progressive aphasia (PPA)\nPPA is a rare condition caused by gradual damage to the areas of the brain that control language. It causes difficulty with finding the right words, understanding what people are saying and with reading and writing. \nPPA is a type of fronto-temporal dementia and therefore more widespread cognitive changes occur over time. However, it’s not the same as Alzheimer’s disease. Frontotemporal dementia is the most common cause of dementia in people under the age of 65 years.\nThere are 3 different subtypes based on which abilities are affected:\n  * **Semantic dementia** – where people have difficulty remembering the meaning of words\n  * **Progressive non-fluent aphasia** – where people find it harder to speak and make mistakes in how they say words and sentences\n  * **Logopenic aphasia** – where people have trouble finding the words they want to use.\n\n\nUnlike the other types of aphasia, people with PPA won’t experience any improvement, but will continue to lose their language abilities.\nPeople with PPA can benefit from speech-language therapy as they and their whānau adjust the way they communicate.\nIt may be helpful to carry an [identification card to show people and help them understand your communication issues(external link)](https://www.aphasia.org.nz/aphasianz-services/aphasia-booklets/ \"Open external link\"). Some communication-assistive devices can also be useful. \n####  What are the causes of aphasia? \nAphasia is most often caused by stroke – about a third of the people who suffer a stroke will get aphasia. This means there are more than 17,000 Kiwis currently living with aphasia, maybe up to 20,000 as the exact numbers aren't known.\nAphasia can also happen after:\n  * a head injury\n  * a brain tumour\n  * another neurological disease.\n\n\nAphasia can occur at any age, however about 75% of cases occur in older people. The impact of aphasia on families can be enormous. \n####  How is aphasia diagnosed? \nIf your healthcare provider thinks you have aphasia, you may be sent to a speech-language therapist. They will test your ability to:\n  * understand language\n  * talk and have a conversation\n  * read\n  * express thoughts\n  * write\n  * use other forms of communication. \n\n\n![Woman having speech language assessment for aphasia](https://healthify.nz/assets/Health-A-Z/Neurological/Speech-language-assessment-for-aphasia-canva-950x690__ResizedImageWzYwMCw0MzZd.jpg) _Image credit: Canva_\n####  How is aphasia treated? \nSometimes a full recovery from aphasia can be made without any treatment.\n  * This kind of recovery usually happens after a stroke where blood flow to the brain is only interrupted for a short time, then quickly re-connected.\n  * This is known as a [transient ischemic attack](https://healthify.nz/health-a-z/t/transient-ischaemic-attack).\n  * In this situation, full language capacity can return within hours or days.\n\n\nMostly, however, language recovery is slow and less complete.\n  * Even though many people with aphasia achieve some quick recovery, where some language ability returns within a few days to 3–4 weeks after the brain injury, some level of aphasia usually remains.\n  * In these cases, speech-language therapy can be very useful.\n  * Recovery can continue over a long time period, although the most rapid improvements usually happen within the first 6 months. \n\n\n#### What factors affect recovery from aphasia?\nMany health professionals think that treatment is most effective early in the recovery period. Some factors that affect recovery and improvement are:\n  * the specific event that caused the brain damage\n  * the part of the brain that was damaged\n  * the seriousness of the brain injury\n  * the age and health of the person\n  * motivation to get better\n  * being socially connected to whānau, friends and support groups.\n\n\n####  Therapy for aphasia (+ APPS) \nAphasia therapy tries to improve a person’s communication by helping them to:\n  * use their remaining language abilities\n  * get back as much language ability as they can \n  * adjust for ongoing language problems\n  * learn different ways of communicating.\n\n\nTherapy can take place one-on-one to meet individual needs, or in a group setting where people can practice and learn different ways of communicating with others. \n#### Computer-aided therapy for aphasia\nThe use of computers to bring back the language abilities of people with aphasia has been used with some success:\n  * Studies have shown that computer-aided therapy can help people with aphasia recover specific parts of speech, eg, remembering how to use verbs.\n  * Computers also offer another communication option for people with trouble expressing language.\n  * Your speech language therapist can help you to find the most appropriate therapy apps for your aphasia.\n\n\n[Aphasia Therapy Online(external link)](http://www.aphasiatherapyonline.com/about.html \"Open external link\") is a free programme provided by an Australian speech pathologist.\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [Communication apps](https://healthify.nz/apps/c/communication-apps).\n####  What is it like to have aphasia? \nAphasia would be like going to bed tonight then waking up in a different country where you don't speak the language. ",
  "chunkIndex": 1,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:32.648585+00:00",
    "source": "healthify"
  }
}