{
  "url": "https://healthify.nz/health-a-z/a/animal-and-human-bites/",
  "title": "Animal And Human Bites",
  "content": "[Need to talk logo](https://healthify.nz/assets/Affiliate-Images/Need-to-talk-1737-logo-800x400__ResizedImageWzMwMCwxNTBd.png) ](https://1737.org.nz/ \"Contact 1737\")\n[![Healthpoint logo](https://healthify.nz/assets/Affiliate-Images/Health-Point-logo__ResizedImageWzMwMCwxNTBd.png) ](https://www.healthpoint.co.nz/ \"Healthpoint website\")\nEmail\nCredits: Healthify editorial team. Healthify is brought to you by Health Navigator Charitable Trust.\nPage last updated: 07 Jun 2022\nScan the QR code to view the full page:   \nhttps://healthify.nz/health-a-z/a/animal-and-human-bites \n![image](https://healthify.nz/assets/Uploads/image.png)\n  1. [Home](https://healthify.nz/)\n  2. [Health A–Z](https://healthify.nz/health-a-z)\n  3. [A](https://healthify.nz/health-a-z/a)\n\n\n# Animal and human bites\n### Key points about animal and human bites\n  * Bites from dogs, cats and rodents as well as from other people can be serious.\n  * Clean them carefully and seek medical attention if your skin has been broken.\n  * All animal and human bites can become infected if they are not treated.\n\n\n![Kitten cuddles up to gentle labrador dog](https://healthify.nz/assets/Plants-and-animals/Dog-and-cat-canva-950x690.jpg)\n####  What are animal bites? \nMost of the animal bites people get are from dogs, followed by cats and rodents (rabbits, rats, etc). Cat scratches can be as serious as cat bites, because cats constantly lick their claws and the claws carry germs from the cat’s mouth. People and animals have bacteria in their mouths which can easily lead to an infection if a bite breaks the skin. Even minor scrapes, such as in sports when someone’s mouth could graze your hand by accident, should be taken seriously. As long as animal and human bites are treated the wound is generally not serious but, if not treated, it can quickly become infected.\n####  What should I do if I have been bitten by a person or an animal? \n![Cat baring teeth bites into human arm](https://healthify.nz/assets/Legacy/15680/biting-cat-canva-665x443__ResizedImageWzYwMCw0MDBd.png)\nImage credit: Canva\n  * Start by cleaning the bite. Run it under warm water for a few minutes. Wash the area even if the skin is intact.\n  ",
  "chunkIndex": 3,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:30.997007+00:00",
    "source": "healthify"
  }
}