{
  "url": "https://healthify.nz/health-a-z/a/allergic-rhinitis/",
  "title": "Allergic Rhinitis",
  "content": "* Maximise natural ventilation in areas where mould is likely to grow.\n  * Remove indoor plants that may promote mould growth.\n\n\n####    \nOther ways to look after yourself if you have hay fever\n  * Don’t smoke, and avoid being around smoke, as it can make your symptoms worse.\n  * Have a [treatment plan for allergic rhinitis.(external link)](https://www.allergy.org.au/patients/allergic-rhinitis-hay-fever-and-sinusitis/allergic-rhinitis-treatment-plan \"Open external link\")\n  * If you have asthma as well, see your healthcare provider a few weeks before the hay fever season starts. Hay fever can make asthma worse and more difficult to control so it may be important to review or make an [asthma action plan](https://healthify.nz/health-a-z/a/asthma-adults#action-plans). \n\n\n####  How is hay fever treated? \nThe most important part of managing hay fever is to avoid the allergens that cause your symptoms. Other treatments include medicines and allergen immunotherapy (AIT).\n####    \nMedicines\nMedicines to treat and help prevent hay fever can be prescribed for you or are available over the counter at your pharmacy. They can be very effective in reducing your symptoms. Keep avoiding the allergens causing your symptoms whenever possible, even when you're taking medicines.\nMedicines for hay fever include:\n  * [antihistamines](https://healthify.nz/medicines-a-z/a/antihistamines) – tablets such as loratadine or cetirizine, or antihistamine nasal sprays\n  * [corticosteroid nasal sprays](https://healthify.nz/medicines-a-z/s/steroid-nasal-sprays)\n  * [decongestants (for short-term use)](https://healthify.nz/medicines-a-z/d/decongestants)\n  * medicated or non-medicated [eye drops](https://healthify.nz/medicines-a-z/e/eye-drops-for-eye-allergies)\n  * products that combine these medicines, eg, an antihistamine and a decongestant.\n\n\nYou may need a combination of these treatments to keep your symptoms under control. If you get seasonal hay fever each year, it’s a good idea to start taking antihistamine tablets and/or using a corticosteroid nasal spray at least a week or two before the time of year your hay fever usually starts and continue taking them throughout the season.\nYou can also try a [saline nasal spray or rinse](https://healthify.nz/medicines-a-z/s/saline-nasal-sprays-drops-rinses) if you have a blocked nose. \nIf you have severe symptoms, or if your symptoms aren't getting better with the medicines listed above, you may be prescribed a short course of oral corticosteroids or [montelukast](https://healthify.nz/medicines-a-z/m/montelukast). \n####    \nAllergen immunotherapy (AIT)\nAllergen immunotherapy, also known as desensitisation, may also be an option if your symptoms are severe and the allergen is difficult to avoid. Immunotherapy works by changing the way your immune system reacts to allergens. ",
  "chunkIndex": 11,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:24.384743+00:00",
    "source": "healthify"
  }
}