{
  "url": "https://healthify.nz/health-a-z/a/alzheimers-disease/",
  "title": "Alzheimers Disease",
  "content": "No two people with Alzheimer's have exactly the same symptoms.\nProblems with remembering things that have happened recently are usually the first thing you or the people around you will notice. You’ll usually remember things that happened in the past very well until much later. In the beginning you may:\n  * have problems finding the right words\n  * forget the names of people and places\n  * forget appointments.\n\n\nAs time goes by you may:\n  * not be able to concentrate or pay attention\n  * get lost, especially in new places\n  * lose track of time\n  * have trouble understanding what is said to you, or what is written down\n  * have increasing difficulty solving problems and managing complex or new tasks\n  * show less initiative or withdraw from your usual activities\n  * experience emotional and personality changes, such as frustration, anxiety or sadness\n  * become more irritable, suspicious or less emotionally responsive\n  * get confused.\n\n\n####  How is Alzheimer’s disease diagnosed? \nIf you're concerned you or someone close to you may have symptoms of Alzheimer's disease or dementia, it's a good idea to see your healthcare provider. An early diagnosis will:\n  * help you plan for the future\n  * allow you to benefit from the treatments available\n  * help you and your whānau find advice and support.\n\n\nYour healthcare provider will ask you and the people closest to you about changes you’ve noticed. They will do a cognitive screening test (eg the [mini-ACE](https://healthify.nz/tools/m/mini-ace)) to check how well your memory and other brain functions are working.\nYour healthcare provider will examine you and will likely order blood tests to rule out other possible causes for your symptoms such as depression, delirium, thyroid problems, side effects of medicines, vitamin deficiencies or a brain tumour. \nYou may need a [CT scan](https://healthify.nz/health-a-z/c/ct-scan) of your head. If the diagnosis is not clear your healthcare provider may refer you to Older Persons Health services. \n####  What is the treatment for Alzheimer’s disease? (+ APPS) \nThere is currently no cure for Alzheimer's disease. However, there are treatments to help slow it down.\n####    \nLifestyle changes\nLifestyle factors can affect dementia risk and by changing those, you can make the most of your brain. Looking after your brain means:\n  * getting regular exercise\n  * avoiding or reducing alcohol and other substance use\n  * eating a healthy diet\n  * getting enough sleep\n  * getting a hearing aid if you have hearing loss\n  * getting eyesight problems fixed if possible, or having up to date glasses\n  * keeping up your social activities.\n\n\nIt may also be useful to do brain exercises such as puzzles or use [phone apps](https://healthify.nz/apps/d/dementia-apps) and practice memory strategies such as lists and reminder notes.\n####    \nCognitive stimulation therapy\nIn some parts of Aotearoa New Zealand, there is the option of cognitive stimulation therapy (CST). This is a structured group treatment developed for people with mild to moderate dementia. There are 14 sessions with a range of activities and discussions aimed at improving cognitive and social functioning. Some rest homes and private hospitals also run similar programmes to CST.\n####    \nHeart risk factors\nManagement of heart risk factors may benefit all types of dementia. Generally, what's good for your heart is good for your brain. Read about[heart risk assessment](https://healthify.nz/health-a-z/h/heart-risk-assessment \"Heart risk assessment\").\n####    \nMedicines\nYour healthcare provider will discuss stopping or changing any medicines that can cause or worsen confusion.\nThere are medicines that can help some people with the symptoms of forgetfulness and confusion.\n**Acetylcholinesterase inhibitors**\nThese work by increasing the levels of acetylcholine, a neurotransmitter (chemical messenger) in the brain that is involved in memory and judgment. They can help with some of the symptoms or hold back progression of the disease (on average, by 6 to 12 months) if you have mild to moderate Alzheimer’s disease.\nAcetylcholinesterase inhibitors include [donepezil](https://healthify.nz/medicines-a-z/d/donepezil), [rivastigmine](https://healthify.nz/medicines-a-z/r/rivastigmine) and [galantamine](https://healthify.nz/medicines-a-z/g/galantamine).\n**NMDA receptor antagonists**\nAn NMDA receptor antagonist called [memantine](https://healthify.nz/medicines-a-z/m/memantine) is also available in Aotearoa New Zealand for moderate to severe Alzheimer’s disease. This prevents too much calcium moving into brain cells. Too much calcium in your brain cells damages them and stops them from getting messages from other brain cells.\n",
  "chunkIndex": 8,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:26.512430+00:00",
    "source": "healthify"
  }
}