{
  "url": "https://healthify.nz/health-a-z/a/atrophic-vaginitis/",
  "title": "Atrophic Vaginitis",
  "content": "![Older woman with glasses on head](https://healthify.nz/assets/Healthy-Living/Women/Older-woman-with-glasses-on-head-canva-950x690.jpg)\n![](https://healthify.nz/health-a-z/g/genitourinary-syndrome-of-menopause)\n####  What is genitourinary syndrome of menopause? \nGenitourinary syndrome of menopause is the changes to the lining of your vulva and vagina (atrophic vaginitis) and the resulting changes to your urinary and sexual function (peeing and sex) which can happen at menopause.\nAtrophic vaginitis is a condition where the lining of your vagina gets drier, thinner and less stretchy because of a lack of oestrogen.\nIt’s most common in women going through menopause because oestrogen levels drop a lot at this time. However, it can also occur in younger women and people assigned female at birth, due to breastfeeding, cancer treatment or having your ovaries removed, which reduces oestrogen levels. Some birth control pills or medicines that counteract oestrogen, (eg, tamoxifen) can cause these symptoms too.\nSymptoms include burning, itching, spotting, pain during sex, and needing to urinate (pee) often.\nWhen your body has less oestrogen, you also produce less vaginal fluid and the acid balance in your vagina changes which can irritate your vaginal tissue.  \n  \n\n![Inforgraphic explaining vaginal changes in menopause and symptoms of atrophic vaginitis](https://healthify.nz/assets/Infographics/Atrophic-vaginitis-infographic-HN-665x443__ResizedImageWzY2NSw0NDNd.png)\n_Image credit: Healthify He Puna Waiora_\n**Note:** The lack of oestrogen that happens at the time of menopause is different from low levels of oestrogen in children due to [differences in sex development](https://healthify.nz/health-a-z/d/differences-in-sex-development).\n####  What are the symptoms of genitourinary syndrome of menopause? \nVaginal/genital symptoms include:\n  * vaginal dryness and loss of elasticity – this is usually the first symptom and you may notice pain during sex because of this\n  * burning and/or itching in your vagina\n  * vaginal discharge which may be  a yellow colour\n  * spotting or bleeding, eg, during or after sex\n  * itching around your vulva (your external genitals)\n  * shortening and tightening of your vaginal canal which can also be noticed during sex.\n\n\nYou may also have urinary symptoms including:\n  * frequent [urinary tract infections](https://healthify.nz/health-a-z/u/urinary-tract-infection-uti-in-women) (UTIs)\n  * urinary incontinence (being unable to hold in your pee)\n  * urinary frequency (peeing more often than usual)\n  * pain when you pee\n  * blood in your pee\n  * a burning feeling when you pee.\n\n\nSee your healthcare provider if you have any of these symptoms. This is especially important if you have any type of bleeding that's unexpected such as after sex, or after your periods seemed to have stopped because you've been through the [menopause](https://healthify.nz/hauora-wellbeing/m/menopause). Read more about [bleeding after sex](https://healthify.nz/health-a-z/b/bleeding-after-sex).\nThese symptoms can affect your quality of life and your relationship with your partner, but there are things that can be done to help.\n####  How is genitourinary syndrome of menopause diagnosed? \nYour healthcare provider will diagnose genitourinary syndrome of menopause based on your symptoms and a pelvic exam, which includes looking at your vulva (the outside part of the vagina), vagina and cervix. Atrophic vaginitis can be diagnosed from the changes to the appearance of your vulva and vagina without needing further tests.\nTests may also be done to rule out other conditions. These may include:\n  * a [cervical screening test](https://healthify.nz/health-a-z/c/cervical-screening)\n  * urine testing\n  * an [ultrasound](https://healthify.nz/health-a-z/u/ultrasound)\n  * vaginal infection testing (done by sending a swab from your vagina to the lab for analysis).\n\n\nIf you are menopausal and have bleeding after sex, or after your periods seemed to have stopped, your healthcare provider may do an endometrial biopsy (take a small piece of tissue) to check the lining of your womb (uterus) for any changes – including pre-cancerous changes. This can be done during a pelvic exam and is usually straightforward, but may cause some cramping pains.\n####  How is genitourinary syndrome of menopause treated? \nHormone treatments are generally the most effective treatments for genitourinary syndrome of menopause.\n#### Topical oestrogen\n[Topical oestrogen](https://healthify.nz/medicines-a-z/o/oestrogen-vaginal-cream), applied directly to your vagina, is preferable for treating atrophic vaginitis. It can be given in different forms including:\n  * a **cream** that you put into your vagina using an applicator\n  * a **tablet** that you place into your vagina using an applicator.\n\n\nYou usually use the cream or tablet daily for a few weeks and then 2 to 3 times a week. Your healthcare provider will give you more instructions about this.\n####    \nSystemic oestrogen (hormone replacement therapy or [menopausal hormone therapy](https://healthify.nz/medicines-a-z/m/menopausal-hormone-therapy))\nIf you have other symptoms of menopause, eg, hot flushes, your doctor may prescribe oral [oestrogen tablets](https://healthify.nz/medicines-a-z/o/oestrogen-tablets) or an [oestrogen patch](https://healthify.nz/medicines-a-z/o/oestrogen-patch-for-mht) or [gel](https://healthify.nz/medicines-a-z/o/oestrogen-gel). If you have any of these treatments and you have a uterus (womb), you’ll also need to take another hormone (progesterone) to reduce your risk of [endometrial cancer](https://healthify.nz/health-a-z/e/endometrial-cancer) (cancer of the lining of your uterus). This type of hormone therapy isn’t generally recommended if you’ve had breast cancer. Talk to your healthcare provider about whether systemic oestrogen therapy is suitable for you.\n####    \nNon-hormone treatments\nThese are also used in the treatment of atrophic vaginitis. They include:\n  * vaginal **lubricants** – you can use a water-based lubricant, eg, KY Jelly, during sex\n  * vaginal **moisturisers** – water-based moisturisers, eg, Replens, are good if vaginal dryness is a problem most of the time not just during sex\n  * vaginal **dilators** – these are devices that can gently stretch your vagina and make sex more comfortable if your vagina has narrowed because of atrophic vaginitis. Your healthcare provider or a specialist pelvic floor physio can show you how to use a dilator.\n\n\nYou may need a combination of hormone and non-hormone treatments to successfully treat your symptoms.\n####  What self-care can I do if I have genitourinary syndrome of menopause? \nThere are things you can do help manage your symptoms if you have genitourinary syndrome of menopause.\n  * Use non-soap cleansers or warm water to clean your external genital area (vulva). Ordinary soaps can make dry skin problems worse.\n  ",
  "chunkIndex": 7,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:37.705084+00:00",
    "source": "healthify"
  }
}