{
  "url": "https://healthify.nz/health-a-z/a/atrial-fibrillation/",
  "title": "Atrial Fibrillation",
  "content": "* **Electrical cardioversion** is sometimes recommended to treat fast or irregular heartbeat. It involves the use of low-energy electrical shocks to trigger your heart into a normal rhythm. It is performed under a general anaesthetic.\n  * **Catheter ablation** is a more invasive method that may be used to restore a normal heart rhythm. In this procedure, a catheter (a long, thin tube) is inserted into a vein in the leg or arm and threaded all the way to the heart. Radio wave energy is used to damage the small portion of tissue responsible for the abnormal electrical signals.\n  * **Pacemakers** help maintain a normal heart rhythm. They are used for people with AF that has not been effectively treated with less invasive treatments. Before inserting a pacemaker, catheter ablation is used to destroy the atrioventricular (AV) node in the heart. The AV node is a part of the electrical control system of the heart that coordinates the atrial and ventricular chambers. The pacemaker takes over the role of the AV node in maintaining a normal heart rhythm.\n  * **Heart surgery** is very rarely required. The most common operation performed is known as the maze procedure, where a number of small incisions are made in the atria (upper chambers) of the heart to create a pattern of scar tissue. The scar tissue (which doesn't carry electrical currents) prevents the abnormal electrical signals that cause AF from travelling through your heart and causing an abnormal heartbeat.\n\n\n[Obstructive sleep apnoea](https://healthify.nz/health-a-z/o/obstructive-sleep-apnoea) and increased body weight can be related to AF, so your healthcare provider may ask about symptoms and management of these too.\n####  How can I look after myself if I have AF? (+ APPS) \nAtrial fibrillation can’t always be prevented but lifestyle changes can help control the level of AF symptoms you experience. \n  * Have enough rest and sleep. Tiredness and fatigue is a common trigger for AF.\n  * Reduce the amount of alcohol you drink or avoid alcohol. Drinking alcohol can trigger or worsen symptoms because alcohol can affect your heart’s electrical signals.\n  * Be aware of unhelpful ‘stressors’ in your life and take steps to address these.\n  * Know how to manage any periods of anxiety.\n  * Reduce caffeine intake as it can trigger AF symptoms.\n  * Quit smoking as it can aggravate AF and is also a risk factor for heart attacks and stroke.\n  * Medications. Talk to your pharmacist or doctor before buying any over the counter medicines, complementary medicines or supplements as some can trigger AF symptoms.\n  * Exercise. Some exercises can trigger symptoms of AF. Find out more about how to stay safe while exercising with AF (see below). \n\n\nThe Heart Foundation has more information on[adjusting to life with AF.(external link)(external link)](https://www.heartfoundation.org.nz/your-heart/hearthelp/atrial-fibrillation/living-with-af \"Open external link\").\n#### Apps reviewed by Healthify\nYou may find it useful to look at some [Quit smoking apps](https://healthify.nz/apps/q/quit-smoking-apps), [Alcohol use apps](https://healthify.nz/apps/a/alcohol-use-apps), [Nutrition, exercise and weight management apps](https://healthify.nz/apps/n/nutrition-exercise-and-weight-management-apps), [Heart rate apps](https://healthify.nz/apps/h/heart-rate-apps) and [Stroke apps](https://healthify.nz/apps/s/stroke-apps).\n####  VIDEOS: Personal stories \nStories of people living with atrial fibrillation.\n#### Video: Personal story: living with atrial fibrillation\nIn this video young dad Sela Alo talks about living with atrial fibrillation and how the diagnosis revealed his larger heart problem of mitral valve regurgitation. This video may take a few moments to load.\n(Heart Foundation NZ, 2017)\n#### Video: Personal story: a series of videos\nIn this series of videos, Nikki talks about her journey with atrial fibrillation. ",
  "chunkIndex": 14,
  "metadata": {
    "lastUpdated": "2025-10-04T03:24:37.262757+00:00",
    "source": "healthify"
  }
}